PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sun Apr 15 02:17:54 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("detector.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_IEP
      15
      16$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("pru_rpmsg_init")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("pru_rpmsg_init")
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$389)
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external

    1277 00000248 0000006973000E          QBNE      ||$C$L34||, r0.b0, 0x73 ; [ALU_PRU] |298| 
    1278;* --------------------------------------------------------------------------*
    1279 0000024c 000000F1010500          LBBO      &r0.b0, r5, 1, 1      ; [ALU_PRU] |298| $O$K37
    1280 00000250 0000006974000C          QBNE      ||$C$L34||, r0.b0, 0x74 ; [ALU_PRU] |298| 
    1281;* --------------------------------------------------------------------------*
    1282 00000254 000000F1020500          LBBO      &r0.b0, r5, 2, 1      ; [ALU_PRU] |298| $O$K37
    1283 00000258 000000696F000A          QBNE      ||$C$L34||, r0.b0, 0x6f ; [ALU_PRU] |298| 
    1284;* --------------------------------------------------------------------------*
    1285 0000025c 000000F1030500          LBBO      &r0.b0, r5, 3, 1      ; [ALU_PRU] |298| $O$K37
    1286 00000260 0000005770008F          QBEQ      ||$C$L15||, r0.b0, 0x70 ; [ALU_PRU] |298| 
    1287;* --------------------------------------------------------------------------*
    1288 00000264 00000021000000!         JMP       ||$C$L34||            ; [ALU_PRU] |298| 
    1289;* --------------------------------------------------------------------------*
    1290 00000268                 ||$C$L33||:    
    1291        .dwpsn  file "detector.c",line 301,column 6,is_stmt,isa 0
    1292;----------------------------------------------------------------------
    1293; 301 | CT_INTC.SICR_bit.STS_CLR_IDX = FROM_ARM_HOST;                          
    1294; 307 | while( CT_IEP.TMR_CNT < SAMPLE_PERIOD);                                
    1295;----------------------------------------------------------------------
    1296 00000268 FC008024FFFFC0          LDI32     r0, 0xfffffc00        ; [ALU_PRU] |301| 
    1297 00000270 000000F1002681          LBBO      &r1, r6, 0, 4         ; [ALU_PRU] |301| $O$K4
    1298 00000274 00000010E0E1E0          AND       r0, r1, r0            ; [ALU_PRU] |301| 
    1299 00000278 0000001313E0E0          OR        r0, r0, 0x13          ; [ALU_PRU] |301| 
    1300 0000027c 000000E1002680          SBBO      &r0, r6, 0, 4         ; [ALU_PRU] |301| $O$K4
    1301;* --------------------------------------------------------------------------*
    1302;*   BEGIN LOOP ||$C$L34||
    1303;*
    1304;*   Loop source line                : 307
    1305;*   Loop closing brace source line  : 307
    1306;*   Known Minimum Trip Count        : 1
    1307;*   Known Maximum Trip Count        : 4294967295
    1308;*   Known Max Trip Count Factor     : 1
    1309;* --------------------------------------------------------------------------*
    1310 00000280                 ||$C$L34||:    
    1311        .dwpsn  file "detector.c",line 226,column 9,is_stmt,isa 0
    1312 00000280 0000002407D0E0          LDI       r0, 0x07d0            ; [ALU_PRU] |226| 
    1313 00000284 000000F10C2A81          LBBO      &r1, r10, 12, 4       ; [ALU_PRU] |226| $O$K160
    1314 00000288 00000076E1E0A2          QBGE      ||$C$L19||, r0, r1    ; [ALU_PRU] |226| 
    1315;* --------------------------------------------------------------------------*
    1316 0000028c 00000021000000!         JMP       ||$C$L34||            ; [ALU_PRU] |226| 
    1317;* --------------------------------------------------------------------------*
    1318        .dwattr $C$DW$44, DW_AT_TI_end_file("detector.c")
    1319        .dwattr $C$DW$44, DW_AT_TI_end_line(0x136)
    1320        .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   25

    1321        .dwendentry
    1322        .dwendtag $C$DW$44
    1323
    1324;******************************************************************************
    1325;* STRINGS                                                                    *
    1326;******************************************************************************
    1327 00000000                         .sect   ".rodata:.string"
    1328 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
    1329 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000031 
         00000014 00000000000000 
    1330;*****************************************************************************
    1331;* UNDEFINED EXTERNAL REFERENCES                                             *
    1332;*****************************************************************************
    1333        .global ||pru_rpmsg_init||
    1334        .global ||pru_rpmsg_receive||
    1335        .global ||pru_rpmsg_send||
    1336        .global ||pru_rpmsg_channel||
    1337
    1338;******************************************************************************
    1339;* TYPE INFORMATION                                                           *
    1340;******************************************************************************
    1341
    1342$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1343        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1344$C$DW$58        .dwtag  DW_TAG_member
    1345        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1346        .dwattr $C$DW$58, DW_AT_name("REVID")
    1347        .dwattr $C$DW$58, DW_AT_TI_symbol_name("REVID")
    1348        .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1349        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1350        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1351        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1352        .dwattr $C$DW$58, DW_AT_decl_line(0x2d)
    1353        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1354        .dwendtag $C$DW$T$19
    1355
    1356        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   26

    1357        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1358        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1359$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1360        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    1361
    1362$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1363        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1364$C$DW$59        .dwtag  DW_TAG_member
    1365        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1366        .dwattr $C$DW$59, DW_AT_name("IDLE_MODE")
    1367        .dwattr $C$DW$59, DW_AT_TI_symbol_name("IDLE_MODE")
    1368        .dwattr $C$DW$59, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1369        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1371        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1372        .dwattr $C$DW$59, DW_AT_decl_line(0x37)
    1373        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1374$C$DW$60        .dwtag  DW_TAG_member
    1375        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1376        .dwattr $C$DW$60, DW_AT_name("STANDBY_MODE")
    1377        .dwattr $C$DW$60, DW_AT_TI_symbol_name("STANDBY_MODE")
    1378        .dwattr $C$DW$60, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1379        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1381        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1382        .dwattr $C$DW$60, DW_AT_decl_line(0x38)
    1383        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1384$C$DW$61        .dwtag  DW_TAG_member
    1385        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1386        .dwattr $C$DW$61, DW_AT_name("STANDBY_INIT")
    1387        .dwattr $C$DW$61, DW_AT_TI_symbol_name("STANDBY_INIT")
    1388        .dwattr $C$DW$61, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1389        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1391        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1392        .dwattr $C$DW$61, DW_AT_decl_line(0x39)
    1393        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1394$C$DW$62        .dwtag  DW_TAG_member
    1395        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1396        .dwattr $C$DW$62, DW_AT_name("SUB_MWAIT")
    1397        .dwattr $C$DW$62, DW_AT_TI_symbol_name("SUB_MWAIT")
    1398        .dwattr $C$DW$62, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1399        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1401        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1402        .dwattr $C$DW$62, DW_AT_decl_line(0x3a)
    1403        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1404$C$DW$63        .dwtag  DW_TAG_member
    1405        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1406        .dwattr $C$DW$63, DW_AT_name("rsvd6")
    1407        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd6")
    1408        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1409        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1411        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   27

    1412        .dwattr $C$DW$63, DW_AT_decl_line(0x3b)
    1413        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1414        .dwendtag $C$DW$T$20
    1415
    1416        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1417        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1418        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1419$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1420        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$20)
    1421
    1422$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1423        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1424$C$DW$64        .dwtag  DW_TAG_member
    1425        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1426        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_MODE")
    1427        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1428        .dwattr $C$DW$64, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1429        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1431        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1432        .dwattr $C$DW$64, DW_AT_decl_line(0x45)
    1433        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1434$C$DW$65        .dwtag  DW_TAG_member
    1435        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1436        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_CLK_MODE")
    1437        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1438        .dwattr $C$DW$65, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1439        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1441        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1442        .dwattr $C$DW$65, DW_AT_decl_line(0x46)
    1443        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1444$C$DW$66        .dwtag  DW_TAG_member
    1445        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1446        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_DIV0")
    1447        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1448        .dwattr $C$DW$66, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1449        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1451        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1452        .dwattr $C$DW$66, DW_AT_decl_line(0x47)
    1453        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1454$C$DW$67        .dwtag  DW_TAG_member
    1455        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1456        .dwattr $C$DW$67, DW_AT_name("PRU0_GPI_DIV1")
    1457        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1458        .dwattr $C$DW$67, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1459        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1461        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1462        .dwattr $C$DW$67, DW_AT_decl_line(0x48)
    1463        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1464$C$DW$68        .dwtag  DW_TAG_member
    1465        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1466        .dwattr $C$DW$68, DW_AT_name("PRU0_GPI_SB")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   28

    1467        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1468        .dwattr $C$DW$68, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1469        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1471        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1472        .dwattr $C$DW$68, DW_AT_decl_line(0x49)
    1473        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1474$C$DW$69        .dwtag  DW_TAG_member
    1475        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1476        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_MODE")
    1477        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1478        .dwattr $C$DW$69, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1479        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1481        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1482        .dwattr $C$DW$69, DW_AT_decl_line(0x4a)
    1483        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1484$C$DW$70        .dwtag  DW_TAG_member
    1485        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1486        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_DIV0")
    1487        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1488        .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1489        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1491        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1492        .dwattr $C$DW$70, DW_AT_decl_line(0x4b)
    1493        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1494$C$DW$71        .dwtag  DW_TAG_member
    1495        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1496        .dwattr $C$DW$71, DW_AT_name("PRU0_GPO_DIV1")
    1497        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1498        .dwattr $C$DW$71, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1499        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1501        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1502        .dwattr $C$DW$71, DW_AT_decl_line(0x4c)
    1503        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1504$C$DW$72        .dwtag  DW_TAG_member
    1505        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1506        .dwattr $C$DW$72, DW_AT_name("PRU0_GPO_SH_SEL")
    1507        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1508        .dwattr $C$DW$72, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1509        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1510        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1511        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1512        .dwattr $C$DW$72, DW_AT_decl_line(0x4d)
    1513        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1514$C$DW$73        .dwtag  DW_TAG_member
    1515        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1516        .dwattr $C$DW$73, DW_AT_name("rsvd26")
    1517        .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd26")
    1518        .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1519        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1520        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1521        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   29

    1522        .dwattr $C$DW$73, DW_AT_decl_line(0x4e)
    1523        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1524        .dwendtag $C$DW$T$21
    1525
    1526        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1527        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1528        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1529$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1530        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    1531
    1532$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1533        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1534$C$DW$74        .dwtag  DW_TAG_member
    1535        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1536        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_MODE")
    1537        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1538        .dwattr $C$DW$74, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1539        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1541        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1542        .dwattr $C$DW$74, DW_AT_decl_line(0x58)
    1543        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1544$C$DW$75        .dwtag  DW_TAG_member
    1545        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1546        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_CLK_MODE")
    1547        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1548        .dwattr $C$DW$75, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1549        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1550        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1551        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1552        .dwattr $C$DW$75, DW_AT_decl_line(0x59)
    1553        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1554$C$DW$76        .dwtag  DW_TAG_member
    1555        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1556        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_DIV0")
    1557        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1558        .dwattr $C$DW$76, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1559        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1561        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1562        .dwattr $C$DW$76, DW_AT_decl_line(0x5a)
    1563        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1564$C$DW$77        .dwtag  DW_TAG_member
    1565        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1566        .dwattr $C$DW$77, DW_AT_name("PRU1_GPI_DIV1")
    1567        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1568        .dwattr $C$DW$77, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1569        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1571        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1572        .dwattr $C$DW$77, DW_AT_decl_line(0x5b)
    1573        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1574$C$DW$78        .dwtag  DW_TAG_member
    1575        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1576        .dwattr $C$DW$78, DW_AT_name("PRU1_GPI_SB")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   30

    1577        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1578        .dwattr $C$DW$78, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1579        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1581        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1582        .dwattr $C$DW$78, DW_AT_decl_line(0x5c)
    1583        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1584$C$DW$79        .dwtag  DW_TAG_member
    1585        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1586        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_MODE")
    1587        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1588        .dwattr $C$DW$79, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1589        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1591        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1592        .dwattr $C$DW$79, DW_AT_decl_line(0x5d)
    1593        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1594$C$DW$80        .dwtag  DW_TAG_member
    1595        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1596        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_DIV0")
    1597        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1598        .dwattr $C$DW$80, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1599        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1601        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1602        .dwattr $C$DW$80, DW_AT_decl_line(0x5e)
    1603        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1604$C$DW$81        .dwtag  DW_TAG_member
    1605        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1606        .dwattr $C$DW$81, DW_AT_name("PRU1_GPO_DIV1")
    1607        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1608        .dwattr $C$DW$81, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1609        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1611        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1612        .dwattr $C$DW$81, DW_AT_decl_line(0x5f)
    1613        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1614$C$DW$82        .dwtag  DW_TAG_member
    1615        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1616        .dwattr $C$DW$82, DW_AT_name("PRU1_GPO_SH_SEL")
    1617        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1618        .dwattr $C$DW$82, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1619        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1621        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1622        .dwattr $C$DW$82, DW_AT_decl_line(0x60)
    1623        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1624$C$DW$83        .dwtag  DW_TAG_member
    1625        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1626        .dwattr $C$DW$83, DW_AT_name("rsvd26")
    1627        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd26")
    1628        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1629        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1631        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   31

    1632        .dwattr $C$DW$83, DW_AT_decl_line(0x61)
    1633        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1634        .dwendtag $C$DW$T$22
    1635
    1636        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1637        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1638        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1639$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1640        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$22)
    1641
    1642$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1643        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1644$C$DW$84        .dwtag  DW_TAG_member
    1645        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1646        .dwattr $C$DW$84, DW_AT_name("PRU0_CLK_STOP_REQ")
    1647        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1648        .dwattr $C$DW$84, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1649        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1651        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1652        .dwattr $C$DW$84, DW_AT_decl_line(0x6b)
    1653        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1654$C$DW$85        .dwtag  DW_TAG_member
    1655        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1656        .dwattr $C$DW$85, DW_AT_name("PRU0_CLK_STOP_ACK")
    1657        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1658        .dwattr $C$DW$85, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1659        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1661        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1662        .dwattr $C$DW$85, DW_AT_decl_line(0x6c)
    1663        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1664$C$DW$86        .dwtag  DW_TAG_member
    1665        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1666        .dwattr $C$DW$86, DW_AT_name("PRU0_CLK_EN")
    1667        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1668        .dwattr $C$DW$86, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1669        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1671        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1672        .dwattr $C$DW$86, DW_AT_decl_line(0x6d)
    1673        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1674$C$DW$87        .dwtag  DW_TAG_member
    1675        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1676        .dwattr $C$DW$87, DW_AT_name("PRU1_CLK_STOP_REQ")
    1677        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1678        .dwattr $C$DW$87, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1679        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1681        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1682        .dwattr $C$DW$87, DW_AT_decl_line(0x6e)
    1683        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1684$C$DW$88        .dwtag  DW_TAG_member
    1685        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1686        .dwattr $C$DW$88, DW_AT_name("PRU1_CLK_STOP_ACK")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   32

    1687        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1688        .dwattr $C$DW$88, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1689        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1691        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1692        .dwattr $C$DW$88, DW_AT_decl_line(0x6f)
    1693        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1694$C$DW$89        .dwtag  DW_TAG_member
    1695        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1696        .dwattr $C$DW$89, DW_AT_name("PRU1_CLK_EN")
    1697        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1698        .dwattr $C$DW$89, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1699        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1700        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1701        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1702        .dwattr $C$DW$89, DW_AT_decl_line(0x70)
    1703        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1704$C$DW$90        .dwtag  DW_TAG_member
    1705        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1706        .dwattr $C$DW$90, DW_AT_name("INTC_CLK_STOP_REQ")
    1707        .dwattr $C$DW$90, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1708        .dwattr $C$DW$90, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1709        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1711        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1712        .dwattr $C$DW$90, DW_AT_decl_line(0x71)
    1713        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1714$C$DW$91        .dwtag  DW_TAG_member
    1715        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1716        .dwattr $C$DW$91, DW_AT_name("INTC_CLK_STOP_ACK")
    1717        .dwattr $C$DW$91, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1718        .dwattr $C$DW$91, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1719        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1721        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1722        .dwattr $C$DW$91, DW_AT_decl_line(0x72)
    1723        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1724$C$DW$92        .dwtag  DW_TAG_member
    1725        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1726        .dwattr $C$DW$92, DW_AT_name("INTC_CLK_EN")
    1727        .dwattr $C$DW$92, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1728        .dwattr $C$DW$92, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1729        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1731        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1732        .dwattr $C$DW$92, DW_AT_decl_line(0x73)
    1733        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1734$C$DW$93        .dwtag  DW_TAG_member
    1735        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1736        .dwattr $C$DW$93, DW_AT_name("UART_CLK_STOP_REQ")
    1737        .dwattr $C$DW$93, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1738        .dwattr $C$DW$93, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1739        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1741        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   33

    1742        .dwattr $C$DW$93, DW_AT_decl_line(0x74)
    1743        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1744$C$DW$94        .dwtag  DW_TAG_member
    1745        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1746        .dwattr $C$DW$94, DW_AT_name("UART_CLK_STOP_ACK")
    1747        .dwattr $C$DW$94, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1748        .dwattr $C$DW$94, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1749        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1751        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1752        .dwattr $C$DW$94, DW_AT_decl_line(0x75)
    1753        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1754$C$DW$95        .dwtag  DW_TAG_member
    1755        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1756        .dwattr $C$DW$95, DW_AT_name("UART_CLK_EN")
    1757        .dwattr $C$DW$95, DW_AT_TI_symbol_name("UART_CLK_EN")
    1758        .dwattr $C$DW$95, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1759        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1761        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1762        .dwattr $C$DW$95, DW_AT_decl_line(0x76)
    1763        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1764$C$DW$96        .dwtag  DW_TAG_member
    1765        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1766        .dwattr $C$DW$96, DW_AT_name("ECAP_CLK_STOP_REQ")
    1767        .dwattr $C$DW$96, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1768        .dwattr $C$DW$96, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1769        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1771        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1772        .dwattr $C$DW$96, DW_AT_decl_line(0x77)
    1773        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1774$C$DW$97        .dwtag  DW_TAG_member
    1775        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1776        .dwattr $C$DW$97, DW_AT_name("ECAP_CLK_STOP_ACK")
    1777        .dwattr $C$DW$97, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1778        .dwattr $C$DW$97, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1779        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1781        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1782        .dwattr $C$DW$97, DW_AT_decl_line(0x78)
    1783        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1784$C$DW$98        .dwtag  DW_TAG_member
    1785        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1786        .dwattr $C$DW$98, DW_AT_name("ECAP_CLK_EN")
    1787        .dwattr $C$DW$98, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1788        .dwattr $C$DW$98, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1789        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1790        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1791        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1792        .dwattr $C$DW$98, DW_AT_decl_line(0x79)
    1793        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1794$C$DW$99        .dwtag  DW_TAG_member
    1795        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1796        .dwattr $C$DW$99, DW_AT_name("IEP_CLK_STOP_REQ")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   34

    1797        .dwattr $C$DW$99, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1798        .dwattr $C$DW$99, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1799        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1801        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1802        .dwattr $C$DW$99, DW_AT_decl_line(0x7a)
    1803        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1804$C$DW$100       .dwtag  DW_TAG_member
    1805        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1806        .dwattr $C$DW$100, DW_AT_name("IEP_CLK_STOP_ACK")
    1807        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1808        .dwattr $C$DW$100, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1809        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1811        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1812        .dwattr $C$DW$100, DW_AT_decl_line(0x7b)
    1813        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1814$C$DW$101       .dwtag  DW_TAG_member
    1815        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1816        .dwattr $C$DW$101, DW_AT_name("IEP_CLK_EN")
    1817        .dwattr $C$DW$101, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1818        .dwattr $C$DW$101, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1819        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1821        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1822        .dwattr $C$DW$101, DW_AT_decl_line(0x7c)
    1823        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1824$C$DW$102       .dwtag  DW_TAG_member
    1825        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1826        .dwattr $C$DW$102, DW_AT_name("rsvd18")
    1827        .dwattr $C$DW$102, DW_AT_TI_symbol_name("rsvd18")
    1828        .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1829        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1831        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1832        .dwattr $C$DW$102, DW_AT_decl_line(0x7d)
    1833        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1834        .dwendtag $C$DW$T$23
    1835
    1836        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1837        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1838        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1839$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1840        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$23)
    1841
    1842$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1843        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1844$C$DW$103       .dwtag  DW_TAG_member
    1845        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1846        .dwattr $C$DW$103, DW_AT_name("PRU0_IMEM_PE_RAW")
    1847        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1848        .dwattr $C$DW$103, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1849        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1850        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1851        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   35

    1852        .dwattr $C$DW$103, DW_AT_decl_line(0x87)
    1853        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1854$C$DW$104       .dwtag  DW_TAG_member
    1855        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1856        .dwattr $C$DW$104, DW_AT_name("PRU0_DMEM_PE_RAW")
    1857        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1858        .dwattr $C$DW$104, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1859        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1861        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1862        .dwattr $C$DW$104, DW_AT_decl_line(0x88)
    1863        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1864$C$DW$105       .dwtag  DW_TAG_member
    1865        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1866        .dwattr $C$DW$105, DW_AT_name("PRU1_IMEM_PE_RAW")
    1867        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1868        .dwattr $C$DW$105, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1869        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1871        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1872        .dwattr $C$DW$105, DW_AT_decl_line(0x89)
    1873        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1874$C$DW$106       .dwtag  DW_TAG_member
    1875        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1876        .dwattr $C$DW$106, DW_AT_name("PRU1_DMEM_PE_RAW")
    1877        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1878        .dwattr $C$DW$106, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1879        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1881        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1882        .dwattr $C$DW$106, DW_AT_decl_line(0x8a)
    1883        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1884$C$DW$107       .dwtag  DW_TAG_member
    1885        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1886        .dwattr $C$DW$107, DW_AT_name("RAM_PE_RAW")
    1887        .dwattr $C$DW$107, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1888        .dwattr $C$DW$107, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1889        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1891        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1892        .dwattr $C$DW$107, DW_AT_decl_line(0x8b)
    1893        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1894$C$DW$108       .dwtag  DW_TAG_member
    1895        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1896        .dwattr $C$DW$108, DW_AT_name("rsvd20")
    1897        .dwattr $C$DW$108, DW_AT_TI_symbol_name("rsvd20")
    1898        .dwattr $C$DW$108, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1899        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1901        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1902        .dwattr $C$DW$108, DW_AT_decl_line(0x8c)
    1903        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1904        .dwendtag $C$DW$T$24
    1905
    1906        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   36

    1907        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1908        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1909$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    1910        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$24)
    1911
    1912$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1913        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1914$C$DW$109       .dwtag  DW_TAG_member
    1915        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1916        .dwattr $C$DW$109, DW_AT_name("PRU0_IMEM_PE")
    1917        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1918        .dwattr $C$DW$109, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1919        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1921        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1922        .dwattr $C$DW$109, DW_AT_decl_line(0x96)
    1923        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1924$C$DW$110       .dwtag  DW_TAG_member
    1925        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1926        .dwattr $C$DW$110, DW_AT_name("PRU0_DMEM_PE")
    1927        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1928        .dwattr $C$DW$110, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1929        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1931        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1932        .dwattr $C$DW$110, DW_AT_decl_line(0x97)
    1933        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1934$C$DW$111       .dwtag  DW_TAG_member
    1935        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1936        .dwattr $C$DW$111, DW_AT_name("PRU1_IMEM_PE")
    1937        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1938        .dwattr $C$DW$111, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1939        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1941        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1942        .dwattr $C$DW$111, DW_AT_decl_line(0x98)
    1943        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1944$C$DW$112       .dwtag  DW_TAG_member
    1945        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1946        .dwattr $C$DW$112, DW_AT_name("PRU1_DMEM_PE")
    1947        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1948        .dwattr $C$DW$112, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1949        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1951        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1952        .dwattr $C$DW$112, DW_AT_decl_line(0x99)
    1953        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1954$C$DW$113       .dwtag  DW_TAG_member
    1955        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1956        .dwattr $C$DW$113, DW_AT_name("RAM_PE")
    1957        .dwattr $C$DW$113, DW_AT_TI_symbol_name("RAM_PE")
    1958        .dwattr $C$DW$113, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1959        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1960        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1961        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   37

    1962        .dwattr $C$DW$113, DW_AT_decl_line(0x9a)
    1963        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1964$C$DW$114       .dwtag  DW_TAG_member
    1965        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1966        .dwattr $C$DW$114, DW_AT_name("rsvd20")
    1967        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd20")
    1968        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1969        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1971        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1972        .dwattr $C$DW$114, DW_AT_decl_line(0x9b)
    1973        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1974        .dwendtag $C$DW$T$25
    1975
    1976        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1977        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1978        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1979$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    1980        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$25)
    1981
    1982$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1983        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1984$C$DW$115       .dwtag  DW_TAG_member
    1985        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1986        .dwattr $C$DW$115, DW_AT_name("PRU0_IMEM_PE_SET")
    1987        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1988        .dwattr $C$DW$115, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1989        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1991        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1992        .dwattr $C$DW$115, DW_AT_decl_line(0xa4)
    1993        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1994$C$DW$116       .dwtag  DW_TAG_member
    1995        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1996        .dwattr $C$DW$116, DW_AT_name("PRU0_DMEM_PE_SET")
    1997        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1998        .dwattr $C$DW$116, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1999        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2001        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2002        .dwattr $C$DW$116, DW_AT_decl_line(0xa5)
    2003        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    2004$C$DW$117       .dwtag  DW_TAG_member
    2005        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    2006        .dwattr $C$DW$117, DW_AT_name("PRU1_IMEM_PE_SET")
    2007        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    2008        .dwattr $C$DW$117, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2009        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2011        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2012        .dwattr $C$DW$117, DW_AT_decl_line(0xa6)
    2013        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    2014$C$DW$118       .dwtag  DW_TAG_member
    2015        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    2016        .dwattr $C$DW$118, DW_AT_name("PRU1_DMEM_PE_SET")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   38

    2017        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2018        .dwattr $C$DW$118, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2019        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2020        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2021        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2022        .dwattr $C$DW$118, DW_AT_decl_line(0xa7)
    2023        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    2024$C$DW$119       .dwtag  DW_TAG_member
    2025        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    2026        .dwattr $C$DW$119, DW_AT_name("RAM_PE_SET")
    2027        .dwattr $C$DW$119, DW_AT_TI_symbol_name("RAM_PE_SET")
    2028        .dwattr $C$DW$119, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2029        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2031        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2032        .dwattr $C$DW$119, DW_AT_decl_line(0xa8)
    2033        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    2034$C$DW$120       .dwtag  DW_TAG_member
    2035        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    2036        .dwattr $C$DW$120, DW_AT_name("rsvd20")
    2037        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd20")
    2038        .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2039        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2040        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2041        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2042        .dwattr $C$DW$120, DW_AT_decl_line(0xa9)
    2043        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    2044        .dwendtag $C$DW$T$26
    2045
    2046        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2047        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2048        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2049$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    2050        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$26)
    2051
    2052$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2053        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2054$C$DW$121       .dwtag  DW_TAG_member
    2055        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2056        .dwattr $C$DW$121, DW_AT_name("PRU0_IMEM_PE_CLR")
    2057        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2058        .dwattr $C$DW$121, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2059        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2061        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2062        .dwattr $C$DW$121, DW_AT_decl_line(0xb3)
    2063        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2064$C$DW$122       .dwtag  DW_TAG_member
    2065        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2066        .dwattr $C$DW$122, DW_AT_name("PRU0_DMEM_PE_CLR")
    2067        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2068        .dwattr $C$DW$122, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2069        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2070        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2071        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   39

    2072        .dwattr $C$DW$122, DW_AT_decl_line(0xb4)
    2073        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2074$C$DW$123       .dwtag  DW_TAG_member
    2075        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2076        .dwattr $C$DW$123, DW_AT_name("PRU1_IMEM_PE_CLR")
    2077        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2078        .dwattr $C$DW$123, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2079        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2081        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2082        .dwattr $C$DW$123, DW_AT_decl_line(0xb5)
    2083        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2084$C$DW$124       .dwtag  DW_TAG_member
    2085        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2086        .dwattr $C$DW$124, DW_AT_name("PRU1_DMEM_PE_CLR")
    2087        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2088        .dwattr $C$DW$124, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2089        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2091        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2092        .dwattr $C$DW$124, DW_AT_decl_line(0xb6)
    2093        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2094$C$DW$125       .dwtag  DW_TAG_member
    2095        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2096        .dwattr $C$DW$125, DW_AT_name("rsvd16")
    2097        .dwattr $C$DW$125, DW_AT_TI_symbol_name("rsvd16")
    2098        .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2099        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2101        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2102        .dwattr $C$DW$125, DW_AT_decl_line(0xb7)
    2103        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2104        .dwendtag $C$DW$T$27
    2105
    2106        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2107        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2108        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2109$C$DW$T$147     .dwtag  DW_TAG_volatile_type
    2110        .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$27)
    2111
    2112$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2113        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2114$C$DW$126       .dwtag  DW_TAG_member
    2115        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2116        .dwattr $C$DW$126, DW_AT_name("PMAO_PRU0")
    2117        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PMAO_PRU0")
    2118        .dwattr $C$DW$126, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2119        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2121        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2122        .dwattr $C$DW$126, DW_AT_decl_line(0xc4)
    2123        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2124$C$DW$127       .dwtag  DW_TAG_member
    2125        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2126        .dwattr $C$DW$127, DW_AT_name("PMAO_PRU1")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   40

    2127        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PMAO_PRU1")
    2128        .dwattr $C$DW$127, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2129        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2130        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2131        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2132        .dwattr $C$DW$127, DW_AT_decl_line(0xc5)
    2133        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2134$C$DW$128       .dwtag  DW_TAG_member
    2135        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2136        .dwattr $C$DW$128, DW_AT_name("rsvd2")
    2137        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd2")
    2138        .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2139        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2141        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2142        .dwattr $C$DW$128, DW_AT_decl_line(0xc6)
    2143        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2144        .dwendtag $C$DW$T$28
    2145
    2146        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2147        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2148        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2149$C$DW$T$149     .dwtag  DW_TAG_volatile_type
    2150        .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$28)
    2151
    2152$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2153        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2154$C$DW$129       .dwtag  DW_TAG_member
    2155        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2156        .dwattr $C$DW$129, DW_AT_name("OCP_EN")
    2157        .dwattr $C$DW$129, DW_AT_TI_symbol_name("OCP_EN")
    2158        .dwattr $C$DW$129, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2159        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2161        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2162        .dwattr $C$DW$129, DW_AT_decl_line(0xd3)
    2163        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2164$C$DW$130       .dwtag  DW_TAG_member
    2165        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2166        .dwattr $C$DW$130, DW_AT_name("rsvd1")
    2167        .dwattr $C$DW$130, DW_AT_TI_symbol_name("rsvd1")
    2168        .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2169        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2171        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2172        .dwattr $C$DW$130, DW_AT_decl_line(0xd4)
    2173        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2174        .dwendtag $C$DW$T$29
    2175
    2176        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2177        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2178        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2179$C$DW$T$151     .dwtag  DW_TAG_volatile_type
    2180        .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$29)
    2181
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   41

    2182$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2183        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2184$C$DW$131       .dwtag  DW_TAG_member
    2185        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2186        .dwattr $C$DW$131, DW_AT_name("PRU1_PAD_HP_EN")
    2187        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2188        .dwattr $C$DW$131, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2189        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2190        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2191        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2192        .dwattr $C$DW$131, DW_AT_decl_line(0xde)
    2193        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2194$C$DW$132       .dwtag  DW_TAG_member
    2195        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2196        .dwattr $C$DW$132, DW_AT_name("XFR_SHIFT_EN")
    2197        .dwattr $C$DW$132, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2198        .dwattr $C$DW$132, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2199        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2201        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2202        .dwattr $C$DW$132, DW_AT_decl_line(0xdf)
    2203        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2204$C$DW$133       .dwtag  DW_TAG_member
    2205        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2206        .dwattr $C$DW$133, DW_AT_name("rsvd2")
    2207        .dwattr $C$DW$133, DW_AT_TI_symbol_name("rsvd2")
    2208        .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2209        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2211        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2212        .dwattr $C$DW$133, DW_AT_decl_line(0xe0)
    2213        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2214        .dwendtag $C$DW$T$30
    2215
    2216        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2217        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2218        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2219$C$DW$T$153     .dwtag  DW_TAG_volatile_type
    2220        .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$30)
    2221
    2222$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2223        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2224$C$DW$134       .dwtag  DW_TAG_member
    2225        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2226        .dwattr $C$DW$134, DW_AT_name("PIN_MUX_SEL")
    2227        .dwattr $C$DW$134, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2228        .dwattr $C$DW$134, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    2229        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2231        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2232        .dwattr $C$DW$134, DW_AT_decl_line(0xec)
    2233        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2234$C$DW$135       .dwtag  DW_TAG_member
    2235        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2236        .dwattr $C$DW$135, DW_AT_name("rsvd2")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   42

    2237        .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd2")
    2238        .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    2239        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2241        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2242        .dwattr $C$DW$135, DW_AT_decl_line(0xed)
    2243        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2244        .dwendtag $C$DW$T$31
    2245
    2246        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2247        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2248        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2249$C$DW$T$155     .dwtag  DW_TAG_volatile_type
    2250        .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$31)
    2251
    2252$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2253        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2254$C$DW$136       .dwtag  DW_TAG_member
    2255        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$132)
    2256        .dwattr $C$DW$136, DW_AT_name("$P$T0")
    2257        .dwattr $C$DW$136, DW_AT_TI_symbol_name("$P$T0")
    2258        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2259        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2260        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2261        .dwattr $C$DW$136, DW_AT_decl_line(0x29)
    2262        .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    2263$C$DW$137       .dwtag  DW_TAG_member
    2264        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$134)
    2265        .dwattr $C$DW$137, DW_AT_name("$P$T1")
    2266        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T1")
    2267        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2268        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2269        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2270        .dwattr $C$DW$137, DW_AT_decl_line(0x33)
    2271        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2272$C$DW$138       .dwtag  DW_TAG_member
    2273        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$136)
    2274        .dwattr $C$DW$138, DW_AT_name("$P$T2")
    2275        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T2")
    2276        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2277        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2278        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2279        .dwattr $C$DW$138, DW_AT_decl_line(0x41)
    2280        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    2281$C$DW$139       .dwtag  DW_TAG_member
    2282        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$138)
    2283        .dwattr $C$DW$139, DW_AT_name("$P$T3")
    2284        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T3")
    2285        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2286        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2287        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2288        .dwattr $C$DW$139, DW_AT_decl_line(0x54)
    2289        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2290$C$DW$140       .dwtag  DW_TAG_member
    2291        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$140)
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   43

    2292        .dwattr $C$DW$140, DW_AT_name("$P$T4")
    2293        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T4")
    2294        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2295        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2296        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2297        .dwattr $C$DW$140, DW_AT_decl_line(0x67)
    2298        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2299$C$DW$141       .dwtag  DW_TAG_member
    2300        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$142)
    2301        .dwattr $C$DW$141, DW_AT_name("$P$T5")
    2302        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T5")
    2303        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2304        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2305        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2306        .dwattr $C$DW$141, DW_AT_decl_line(0x83)
    2307        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2308$C$DW$142       .dwtag  DW_TAG_member
    2309        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$144)
    2310        .dwattr $C$DW$142, DW_AT_name("$P$T6")
    2311        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T6")
    2312        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2313        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2314        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2315        .dwattr $C$DW$142, DW_AT_decl_line(0x92)
    2316        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2317$C$DW$143       .dwtag  DW_TAG_member
    2318        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$146)
    2319        .dwattr $C$DW$143, DW_AT_name("$P$T7")
    2320        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T7")
    2321        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2322        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2323        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2324        .dwattr $C$DW$143, DW_AT_decl_line(0xa0)
    2325        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2326$C$DW$144       .dwtag  DW_TAG_member
    2327        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$148)
    2328        .dwattr $C$DW$144, DW_AT_name("$P$T8")
    2329        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T8")
    2330        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2331        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2332        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2333        .dwattr $C$DW$144, DW_AT_decl_line(0xaf)
    2334        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2335$C$DW$145       .dwtag  DW_TAG_member
    2336        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    2337        .dwattr $C$DW$145, DW_AT_name("rsvd24")
    2338        .dwattr $C$DW$145, DW_AT_TI_symbol_name("rsvd24")
    2339        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2340        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2341        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2342        .dwattr $C$DW$145, DW_AT_decl_line(0xbc)
    2343        .dwattr $C$DW$145, DW_AT_decl_column(0x0b)
    2344$C$DW$146       .dwtag  DW_TAG_member
    2345        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$150)
    2346        .dwattr $C$DW$146, DW_AT_name("$P$T9")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   44

    2347        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T9")
    2348        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2349        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2350        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2351        .dwattr $C$DW$146, DW_AT_decl_line(0xc0)
    2352        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2353$C$DW$147       .dwtag  DW_TAG_member
    2354        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$33)
    2355        .dwattr $C$DW$147, DW_AT_name("rsvd2c")
    2356        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd2c")
    2357        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2358        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2359        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2360        .dwattr $C$DW$147, DW_AT_decl_line(0xcb)
    2361        .dwattr $C$DW$147, DW_AT_decl_column(0x0b)
    2362$C$DW$148       .dwtag  DW_TAG_member
    2363        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$152)
    2364        .dwattr $C$DW$148, DW_AT_name("$P$T10")
    2365        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T10")
    2366        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2367        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2368        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2369        .dwattr $C$DW$148, DW_AT_decl_line(0xcf)
    2370        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2371$C$DW$149       .dwtag  DW_TAG_member
    2372        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$154)
    2373        .dwattr $C$DW$149, DW_AT_name("$P$T11")
    2374        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T11")
    2375        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2376        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2377        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2378        .dwattr $C$DW$149, DW_AT_decl_line(0xda)
    2379        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2380$C$DW$150       .dwtag  DW_TAG_member
    2381        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$34)
    2382        .dwattr $C$DW$150, DW_AT_name("rsvd38")
    2383        .dwattr $C$DW$150, DW_AT_TI_symbol_name("rsvd38")
    2384        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2385        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2386        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2387        .dwattr $C$DW$150, DW_AT_decl_line(0xe5)
    2388        .dwattr $C$DW$150, DW_AT_decl_column(0x0b)
    2389$C$DW$151       .dwtag  DW_TAG_member
    2390        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$156)
    2391        .dwattr $C$DW$151, DW_AT_name("$P$T12")
    2392        .dwattr $C$DW$151, DW_AT_TI_symbol_name("$P$T12")
    2393        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2394        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2395        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2396        .dwattr $C$DW$151, DW_AT_decl_line(0xe8)
    2397        .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2398        .dwendtag $C$DW$T$35
    2399
    2400        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2401        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   45

    2402        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2403$C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2404        .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$35)
    2405        .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    2406        .dwattr $C$DW$T$353, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2407        .dwattr $C$DW$T$353, DW_AT_decl_line(0xf0)
    2408        .dwattr $C$DW$T$353, DW_AT_decl_column(0x03)
    2409$C$DW$T$354     .dwtag  DW_TAG_volatile_type
    2410        .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
    2411
    2412$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2413        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2414$C$DW$152       .dwtag  DW_TAG_member
    2415        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2416        .dwattr $C$DW$152, DW_AT_name("REV_MINOR")
    2417        .dwattr $C$DW$152, DW_AT_TI_symbol_name("REV_MINOR")
    2418        .dwattr $C$DW$152, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2419        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2421        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2422        .dwattr $C$DW$152, DW_AT_decl_line(0x2d)
    2423        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2424$C$DW$153       .dwtag  DW_TAG_member
    2425        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2426        .dwattr $C$DW$153, DW_AT_name("REV_CUSTOM")
    2427        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_CUSTOM")
    2428        .dwattr $C$DW$153, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2429        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2431        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2432        .dwattr $C$DW$153, DW_AT_decl_line(0x2e)
    2433        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2434$C$DW$154       .dwtag  DW_TAG_member
    2435        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2436        .dwattr $C$DW$154, DW_AT_name("REV_MAJOR")
    2437        .dwattr $C$DW$154, DW_AT_TI_symbol_name("REV_MAJOR")
    2438        .dwattr $C$DW$154, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2439        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2440        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2441        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2442        .dwattr $C$DW$154, DW_AT_decl_line(0x2f)
    2443        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2444$C$DW$155       .dwtag  DW_TAG_member
    2445        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2446        .dwattr $C$DW$155, DW_AT_name("REV_RTL")
    2447        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_RTL")
    2448        .dwattr $C$DW$155, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2449        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2450        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2451        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2452        .dwattr $C$DW$155, DW_AT_decl_line(0x30)
    2453        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2454$C$DW$156       .dwtag  DW_TAG_member
    2455        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2456        .dwattr $C$DW$156, DW_AT_name("REV_MODULE")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   46

    2457        .dwattr $C$DW$156, DW_AT_TI_symbol_name("REV_MODULE")
    2458        .dwattr $C$DW$156, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2459        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2460        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2461        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2462        .dwattr $C$DW$156, DW_AT_decl_line(0x31)
    2463        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2464$C$DW$157       .dwtag  DW_TAG_member
    2465        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2466        .dwattr $C$DW$157, DW_AT_name("rsvd28")
    2467        .dwattr $C$DW$157, DW_AT_TI_symbol_name("rsvd28")
    2468        .dwattr $C$DW$157, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2469        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2471        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2472        .dwattr $C$DW$157, DW_AT_decl_line(0x32)
    2473        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2474$C$DW$158       .dwtag  DW_TAG_member
    2475        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2476        .dwattr $C$DW$158, DW_AT_name("REV_SCHEME")
    2477        .dwattr $C$DW$158, DW_AT_TI_symbol_name("REV_SCHEME")
    2478        .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2479        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2480        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2481        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2482        .dwattr $C$DW$158, DW_AT_decl_line(0x33)
    2483        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2484        .dwendtag $C$DW$T$36
    2485
    2486        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2487        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2488        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2489$C$DW$T$157     .dwtag  DW_TAG_volatile_type
    2490        .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$36)
    2491
    2492$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2493        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2494$C$DW$159       .dwtag  DW_TAG_member
    2495        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2496        .dwattr $C$DW$159, DW_AT_name("rsvd0")
    2497        .dwattr $C$DW$159, DW_AT_TI_symbol_name("rsvd0")
    2498        .dwattr $C$DW$159, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2499        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2500        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2501        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2502        .dwattr $C$DW$159, DW_AT_decl_line(0x3d)
    2503        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2504$C$DW$160       .dwtag  DW_TAG_member
    2505        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2506        .dwattr $C$DW$160, DW_AT_name("NEST_MODE")
    2507        .dwattr $C$DW$160, DW_AT_TI_symbol_name("NEST_MODE")
    2508        .dwattr $C$DW$160, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2509        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2510        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2511        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   47

    2512        .dwattr $C$DW$160, DW_AT_decl_line(0x3e)
    2513        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2514$C$DW$161       .dwtag  DW_TAG_member
    2515        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2516        .dwattr $C$DW$161, DW_AT_name("rsvd4")
    2517        .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd4")
    2518        .dwattr $C$DW$161, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2519        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2520        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2521        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2522        .dwattr $C$DW$161, DW_AT_decl_line(0x3f)
    2523        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2524        .dwendtag $C$DW$T$37
    2525
    2526        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2527        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2528        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2529$C$DW$T$159     .dwtag  DW_TAG_volatile_type
    2530        .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$37)
    2531
    2532$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2533        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2534$C$DW$162       .dwtag  DW_TAG_member
    2535        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2536        .dwattr $C$DW$162, DW_AT_name("EN_HINT_ANY")
    2537        .dwattr $C$DW$162, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2538        .dwattr $C$DW$162, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2539        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2540        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2541        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2542        .dwattr $C$DW$162, DW_AT_decl_line(0x4c)
    2543        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2544$C$DW$163       .dwtag  DW_TAG_member
    2545        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2546        .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2547        .dwattr $C$DW$163, DW_AT_TI_symbol_name("rsvd1")
    2548        .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2549        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2551        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2552        .dwattr $C$DW$163, DW_AT_decl_line(0x4d)
    2553        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2554        .dwendtag $C$DW$T$38
    2555
    2556        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2557        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2558        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2559$C$DW$T$161     .dwtag  DW_TAG_volatile_type
    2560        .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$38)
    2561
    2562$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2563        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2564$C$DW$164       .dwtag  DW_TAG_member
    2565        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2566        .dwattr $C$DW$164, DW_AT_name("GLB_NEST_LEVEL")
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   48

    2567        .dwattr $C$DW$164, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2568        .dwattr $C$DW$164, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2569        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2570        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2571        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2572        .dwattr $C$DW$164, DW_AT_decl_line(0x5a)
    2573        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2574$C$DW$165       .dwtag  DW_TAG_member
    2575        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2576        .dwattr $C$DW$165, DW_AT_name("rsvd9")
    2577        .dwattr $C$DW$165, DW_AT_TI_symbol_name("rsvd9")
    2578        .dwattr $C$DW$165, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2579        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2581        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2582        .dwattr $C$DW$165, DW_AT_decl_line(0x5b)
    2583        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2584$C$DW$166       .dwtag  DW_TAG_member
    2585        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2586        .dwattr $C$DW$166, DW_AT_name("AUTO_OVERRIDE")
    2587        .dwattr $C$DW$166, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2588        .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2589        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2591        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2592        .dwattr $C$DW$166, DW_AT_decl_line(0x5c)
    2593        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2594        .dwendtag $C$DW$T$39
    2595
    2596        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2597        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2598        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2599$C$DW$T$163     .dwtag  DW_TAG_volatile_type
    2600        .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$39)
    2601
    2602$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2603        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2604$C$DW$167       .dwtag  DW_TAG_member
    2605        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2606        .dwattr $C$DW$167, DW_AT_name("STS_SET_IDX")
    2607        .dwattr $C$DW$167, DW_AT_TI_symbol_name("STS_SET_IDX")
    2608        .dwattr $C$DW$167, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2609        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2610        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2611        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2612        .dwattr $C$DW$167, DW_AT_decl_line(0x66)
    2613        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2614$C$DW$168       .dwtag  DW_TAG_member
    2615        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2616        .dwattr $C$DW$168, DW_AT_name("rsvd10")
    2617        .dwattr $C$DW$168, DW_AT_TI_symbol_name("rsvd10")
    2618        .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2619        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2620        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2621        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 02:17:54 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   49

    2622        .dwattr $C$DW$168, DW_AT_decl_line(0x67)
    2623        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2624        .dwendtag $C$DW$T$40
    2625
    2626        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2627        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    2628        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2629$C$DW$T$165     .dwtag  DW_TAG_volatile_type
    2630        .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$40)
    2631
    2632$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2633        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2634$C$DW$169       .dwtag  DW_TAG_member
    2635        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2636        .dwattr $C$DW$169, DW_AT_name("STS_CLR_IDX")
    2637        .dwattr $C$DW$169, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2638        .dwattr $C$DW$169, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2639        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2640        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2641        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2642        .dwattr $C$DW$169, DW_AT_decl_line(0x71)
    2643        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2644$C$DW$170       .dwtag  DW_TAG_member
    2645        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2646        .dwattr $C$DW$170, DW_AT_name("rsvd10")
    2647        .dwattr $C$DW$170, DW_AT_TI_symbol_name("rsvd10")
    2648        .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2649        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2650        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2651        .dwattr $C$DW$170, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2652        .dwattr $C$DW$170, DW_AT_decl_line(0x72)
    2653        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2654        .dwendtag $C$DW$T$41
    2655
    2656        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2657        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2658        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2659$C$DW$T$167     .dwtag  DW_TAG_volatile_type
    2660        .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$41)
    2661
