PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sun Apr 15 07:02:55 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("detector.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_IEP
      15
      16$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("pru_rpmsg_init")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("pru_rpmsg_init")
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$389)
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external

    1274 00000248 0000006973000E          QBNE      ||$C$L34||, r0.b0, 0x73 ; [ALU_PRU] |284| 
    1275;* --------------------------------------------------------------------------*
    1276 0000024c 000000F1010500          LBBO      &r0.b0, r5, 1, 1      ; [ALU_PRU] |284| $O$K37
    1277 00000250 0000006974000C          QBNE      ||$C$L34||, r0.b0, 0x74 ; [ALU_PRU] |284| 
    1278;* --------------------------------------------------------------------------*
    1279 00000254 000000F1020500          LBBO      &r0.b0, r5, 2, 1      ; [ALU_PRU] |284| $O$K37
    1280 00000258 000000696F000A          QBNE      ||$C$L34||, r0.b0, 0x6f ; [ALU_PRU] |284| 
    1281;* --------------------------------------------------------------------------*
    1282 0000025c 000000F1030500          LBBO      &r0.b0, r5, 3, 1      ; [ALU_PRU] |284| $O$K37
    1283 00000260 0000005770008F          QBEQ      ||$C$L15||, r0.b0, 0x70 ; [ALU_PRU] |284| 
    1284;* --------------------------------------------------------------------------*
    1285 00000264 00000021000000!         JMP       ||$C$L34||            ; [ALU_PRU] |284| 
    1286;* --------------------------------------------------------------------------*
    1287 00000268                 ||$C$L33||:    
    1288        .dwpsn  file "detector.c",line 287,column 6,is_stmt,isa 0
    1289;----------------------------------------------------------------------
    1290; 287 | CT_INTC.SICR_bit.STS_CLR_IDX = FROM_ARM_HOST;                          
    1291; 293 | while( CT_IEP.TMR_CNT < SAMPLE_PERIOD);                                
    1292;----------------------------------------------------------------------
    1293 00000268 FC008024FFFFC0          LDI32     r0, 0xfffffc00        ; [ALU_PRU] |287| 
    1294 00000270 000000F1002681          LBBO      &r1, r6, 0, 4         ; [ALU_PRU] |287| $O$K4
    1295 00000274 00000010E0E1E0          AND       r0, r1, r0            ; [ALU_PRU] |287| 
    1296 00000278 0000001313E0E0          OR        r0, r0, 0x13          ; [ALU_PRU] |287| 
    1297 0000027c 000000E1002680          SBBO      &r0, r6, 0, 4         ; [ALU_PRU] |287| $O$K4
    1298;* --------------------------------------------------------------------------*
    1299;*   BEGIN LOOP ||$C$L34||
    1300;*
    1301;*   Loop source line                : 293
    1302;*   Loop closing brace source line  : 293
    1303;*   Known Minimum Trip Count        : 1
    1304;*   Known Maximum Trip Count        : 4294967295
    1305;*   Known Max Trip Count Factor     : 1
    1306;* --------------------------------------------------------------------------*
    1307 00000280                 ||$C$L34||:    
    1308        .dwpsn  file "detector.c",line 221,column 9,is_stmt,isa 0
    1309 00000280 0000002407D0E0          LDI       r0, 0x07d0            ; [ALU_PRU] |221| 
    1310 00000284 000000F10C2A81          LBBO      &r1, r10, 12, 4       ; [ALU_PRU] |221| $O$K159
    1311 00000288 00000076E1E0A2          QBGE      ||$C$L19||, r0, r1    ; [ALU_PRU] |221| 
    1312;* --------------------------------------------------------------------------*
    1313 0000028c 00000021000000!         JMP       ||$C$L34||            ; [ALU_PRU] |221| 
    1314;* --------------------------------------------------------------------------*
    1315        .dwattr $C$DW$44, DW_AT_TI_end_file("detector.c")
    1316        .dwattr $C$DW$44, DW_AT_TI_end_line(0x128)
    1317        .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
    1318        .dwendentry
    1319        .dwendtag $C$DW$44
    1320
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   25

    1321;******************************************************************************
    1322;* STRINGS                                                                    *
    1323;******************************************************************************
    1324 00000000                         .sect   ".rodata:.string"
    1325 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
    1326 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000031 
         00000014 00000000000000 
    1327;*****************************************************************************
    1328;* UNDEFINED EXTERNAL REFERENCES                                             *
    1329;*****************************************************************************
    1330        .global ||pru_rpmsg_init||
    1331        .global ||pru_rpmsg_receive||
    1332        .global ||pru_rpmsg_send||
    1333        .global ||pru_rpmsg_channel||
    1334
    1335;******************************************************************************
    1336;* TYPE INFORMATION                                                           *
    1337;******************************************************************************
    1338
    1339$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1340        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1341$C$DW$58        .dwtag  DW_TAG_member
    1342        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1343        .dwattr $C$DW$58, DW_AT_name("REVID")
    1344        .dwattr $C$DW$58, DW_AT_TI_symbol_name("REVID")
    1345        .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1346        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1348        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1349        .dwattr $C$DW$58, DW_AT_decl_line(0x2d)
    1350        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1351        .dwendtag $C$DW$T$19
    1352
    1353        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1354        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1355        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1356$C$DW$T$131     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   26

    1357        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    1358
    1359$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1360        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1361$C$DW$59        .dwtag  DW_TAG_member
    1362        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1363        .dwattr $C$DW$59, DW_AT_name("IDLE_MODE")
    1364        .dwattr $C$DW$59, DW_AT_TI_symbol_name("IDLE_MODE")
    1365        .dwattr $C$DW$59, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1366        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1368        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1369        .dwattr $C$DW$59, DW_AT_decl_line(0x37)
    1370        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1371$C$DW$60        .dwtag  DW_TAG_member
    1372        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1373        .dwattr $C$DW$60, DW_AT_name("STANDBY_MODE")
    1374        .dwattr $C$DW$60, DW_AT_TI_symbol_name("STANDBY_MODE")
    1375        .dwattr $C$DW$60, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1376        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1378        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1379        .dwattr $C$DW$60, DW_AT_decl_line(0x38)
    1380        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1381$C$DW$61        .dwtag  DW_TAG_member
    1382        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1383        .dwattr $C$DW$61, DW_AT_name("STANDBY_INIT")
    1384        .dwattr $C$DW$61, DW_AT_TI_symbol_name("STANDBY_INIT")
    1385        .dwattr $C$DW$61, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1386        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1388        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1389        .dwattr $C$DW$61, DW_AT_decl_line(0x39)
    1390        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1391$C$DW$62        .dwtag  DW_TAG_member
    1392        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1393        .dwattr $C$DW$62, DW_AT_name("SUB_MWAIT")
    1394        .dwattr $C$DW$62, DW_AT_TI_symbol_name("SUB_MWAIT")
    1395        .dwattr $C$DW$62, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1396        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1398        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1399        .dwattr $C$DW$62, DW_AT_decl_line(0x3a)
    1400        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1401$C$DW$63        .dwtag  DW_TAG_member
    1402        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1403        .dwattr $C$DW$63, DW_AT_name("rsvd6")
    1404        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd6")
    1405        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1406        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1408        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1409        .dwattr $C$DW$63, DW_AT_decl_line(0x3b)
    1410        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1411        .dwendtag $C$DW$T$20
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   27

    1412
    1413        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1414        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1415        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1416$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1417        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$20)
    1418
    1419$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1420        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1421$C$DW$64        .dwtag  DW_TAG_member
    1422        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1423        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_MODE")
    1424        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1425        .dwattr $C$DW$64, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1426        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1428        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1429        .dwattr $C$DW$64, DW_AT_decl_line(0x45)
    1430        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1431$C$DW$65        .dwtag  DW_TAG_member
    1432        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1433        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_CLK_MODE")
    1434        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1435        .dwattr $C$DW$65, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1436        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1438        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1439        .dwattr $C$DW$65, DW_AT_decl_line(0x46)
    1440        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1441$C$DW$66        .dwtag  DW_TAG_member
    1442        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1443        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_DIV0")
    1444        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1445        .dwattr $C$DW$66, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1446        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1448        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1449        .dwattr $C$DW$66, DW_AT_decl_line(0x47)
    1450        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1451$C$DW$67        .dwtag  DW_TAG_member
    1452        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1453        .dwattr $C$DW$67, DW_AT_name("PRU0_GPI_DIV1")
    1454        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1455        .dwattr $C$DW$67, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1456        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1458        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1459        .dwattr $C$DW$67, DW_AT_decl_line(0x48)
    1460        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1461$C$DW$68        .dwtag  DW_TAG_member
    1462        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1463        .dwattr $C$DW$68, DW_AT_name("PRU0_GPI_SB")
    1464        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1465        .dwattr $C$DW$68, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1466        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   28

    1467        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1468        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1469        .dwattr $C$DW$68, DW_AT_decl_line(0x49)
    1470        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1471$C$DW$69        .dwtag  DW_TAG_member
    1472        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1473        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_MODE")
    1474        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1475        .dwattr $C$DW$69, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1476        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1478        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1479        .dwattr $C$DW$69, DW_AT_decl_line(0x4a)
    1480        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1481$C$DW$70        .dwtag  DW_TAG_member
    1482        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1483        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_DIV0")
    1484        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1485        .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1486        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1488        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1489        .dwattr $C$DW$70, DW_AT_decl_line(0x4b)
    1490        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1491$C$DW$71        .dwtag  DW_TAG_member
    1492        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1493        .dwattr $C$DW$71, DW_AT_name("PRU0_GPO_DIV1")
    1494        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1495        .dwattr $C$DW$71, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1496        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1498        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1499        .dwattr $C$DW$71, DW_AT_decl_line(0x4c)
    1500        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1501$C$DW$72        .dwtag  DW_TAG_member
    1502        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1503        .dwattr $C$DW$72, DW_AT_name("PRU0_GPO_SH_SEL")
    1504        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1505        .dwattr $C$DW$72, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1506        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1508        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1509        .dwattr $C$DW$72, DW_AT_decl_line(0x4d)
    1510        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1511$C$DW$73        .dwtag  DW_TAG_member
    1512        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1513        .dwattr $C$DW$73, DW_AT_name("rsvd26")
    1514        .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd26")
    1515        .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1516        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1518        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1519        .dwattr $C$DW$73, DW_AT_decl_line(0x4e)
    1520        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1521        .dwendtag $C$DW$T$21
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   29

    1522
    1523        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1524        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1525        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1526$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1527        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    1528
    1529$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1530        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1531$C$DW$74        .dwtag  DW_TAG_member
    1532        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1533        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_MODE")
    1534        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1535        .dwattr $C$DW$74, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1536        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1538        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1539        .dwattr $C$DW$74, DW_AT_decl_line(0x58)
    1540        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1541$C$DW$75        .dwtag  DW_TAG_member
    1542        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1543        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_CLK_MODE")
    1544        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1545        .dwattr $C$DW$75, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1546        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1548        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1549        .dwattr $C$DW$75, DW_AT_decl_line(0x59)
    1550        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1551$C$DW$76        .dwtag  DW_TAG_member
    1552        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1553        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_DIV0")
    1554        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1555        .dwattr $C$DW$76, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1556        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1557        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1558        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1559        .dwattr $C$DW$76, DW_AT_decl_line(0x5a)
    1560        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1561$C$DW$77        .dwtag  DW_TAG_member
    1562        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1563        .dwattr $C$DW$77, DW_AT_name("PRU1_GPI_DIV1")
    1564        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1565        .dwattr $C$DW$77, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1566        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1568        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1569        .dwattr $C$DW$77, DW_AT_decl_line(0x5b)
    1570        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1571$C$DW$78        .dwtag  DW_TAG_member
    1572        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1573        .dwattr $C$DW$78, DW_AT_name("PRU1_GPI_SB")
    1574        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1575        .dwattr $C$DW$78, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1576        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   30

    1577        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1578        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1579        .dwattr $C$DW$78, DW_AT_decl_line(0x5c)
    1580        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1581$C$DW$79        .dwtag  DW_TAG_member
    1582        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1583        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_MODE")
    1584        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1585        .dwattr $C$DW$79, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1586        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1588        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1589        .dwattr $C$DW$79, DW_AT_decl_line(0x5d)
    1590        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1591$C$DW$80        .dwtag  DW_TAG_member
    1592        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1593        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_DIV0")
    1594        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1595        .dwattr $C$DW$80, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1596        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1597        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1598        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1599        .dwattr $C$DW$80, DW_AT_decl_line(0x5e)
    1600        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1601$C$DW$81        .dwtag  DW_TAG_member
    1602        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1603        .dwattr $C$DW$81, DW_AT_name("PRU1_GPO_DIV1")
    1604        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1605        .dwattr $C$DW$81, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1606        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1608        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1609        .dwattr $C$DW$81, DW_AT_decl_line(0x5f)
    1610        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1611$C$DW$82        .dwtag  DW_TAG_member
    1612        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1613        .dwattr $C$DW$82, DW_AT_name("PRU1_GPO_SH_SEL")
    1614        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1615        .dwattr $C$DW$82, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1616        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1618        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1619        .dwattr $C$DW$82, DW_AT_decl_line(0x60)
    1620        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1621$C$DW$83        .dwtag  DW_TAG_member
    1622        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1623        .dwattr $C$DW$83, DW_AT_name("rsvd26")
    1624        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd26")
    1625        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1626        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1628        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1629        .dwattr $C$DW$83, DW_AT_decl_line(0x61)
    1630        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1631        .dwendtag $C$DW$T$22
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   31

    1632
    1633        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1634        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1635        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1636$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1637        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$22)
    1638
    1639$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1640        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1641$C$DW$84        .dwtag  DW_TAG_member
    1642        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1643        .dwattr $C$DW$84, DW_AT_name("PRU0_CLK_STOP_REQ")
    1644        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1645        .dwattr $C$DW$84, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1646        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1647        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1648        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1649        .dwattr $C$DW$84, DW_AT_decl_line(0x6b)
    1650        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1651$C$DW$85        .dwtag  DW_TAG_member
    1652        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1653        .dwattr $C$DW$85, DW_AT_name("PRU0_CLK_STOP_ACK")
    1654        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1655        .dwattr $C$DW$85, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1656        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1658        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1659        .dwattr $C$DW$85, DW_AT_decl_line(0x6c)
    1660        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1661$C$DW$86        .dwtag  DW_TAG_member
    1662        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1663        .dwattr $C$DW$86, DW_AT_name("PRU0_CLK_EN")
    1664        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1665        .dwattr $C$DW$86, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1666        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1668        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1669        .dwattr $C$DW$86, DW_AT_decl_line(0x6d)
    1670        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1671$C$DW$87        .dwtag  DW_TAG_member
    1672        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1673        .dwattr $C$DW$87, DW_AT_name("PRU1_CLK_STOP_REQ")
    1674        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1675        .dwattr $C$DW$87, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1676        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1678        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1679        .dwattr $C$DW$87, DW_AT_decl_line(0x6e)
    1680        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1681$C$DW$88        .dwtag  DW_TAG_member
    1682        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1683        .dwattr $C$DW$88, DW_AT_name("PRU1_CLK_STOP_ACK")
    1684        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1685        .dwattr $C$DW$88, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1686        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   32

    1687        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1688        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1689        .dwattr $C$DW$88, DW_AT_decl_line(0x6f)
    1690        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1691$C$DW$89        .dwtag  DW_TAG_member
    1692        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1693        .dwattr $C$DW$89, DW_AT_name("PRU1_CLK_EN")
    1694        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1695        .dwattr $C$DW$89, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1696        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1698        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1699        .dwattr $C$DW$89, DW_AT_decl_line(0x70)
    1700        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1701$C$DW$90        .dwtag  DW_TAG_member
    1702        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1703        .dwattr $C$DW$90, DW_AT_name("INTC_CLK_STOP_REQ")
    1704        .dwattr $C$DW$90, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1705        .dwattr $C$DW$90, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1706        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1708        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1709        .dwattr $C$DW$90, DW_AT_decl_line(0x71)
    1710        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1711$C$DW$91        .dwtag  DW_TAG_member
    1712        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1713        .dwattr $C$DW$91, DW_AT_name("INTC_CLK_STOP_ACK")
    1714        .dwattr $C$DW$91, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1715        .dwattr $C$DW$91, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1716        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1718        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1719        .dwattr $C$DW$91, DW_AT_decl_line(0x72)
    1720        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1721$C$DW$92        .dwtag  DW_TAG_member
    1722        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1723        .dwattr $C$DW$92, DW_AT_name("INTC_CLK_EN")
    1724        .dwattr $C$DW$92, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1725        .dwattr $C$DW$92, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1726        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1728        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1729        .dwattr $C$DW$92, DW_AT_decl_line(0x73)
    1730        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1731$C$DW$93        .dwtag  DW_TAG_member
    1732        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1733        .dwattr $C$DW$93, DW_AT_name("UART_CLK_STOP_REQ")
    1734        .dwattr $C$DW$93, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1735        .dwattr $C$DW$93, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1736        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1738        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1739        .dwattr $C$DW$93, DW_AT_decl_line(0x74)
    1740        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1741$C$DW$94        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   33

    1742        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1743        .dwattr $C$DW$94, DW_AT_name("UART_CLK_STOP_ACK")
    1744        .dwattr $C$DW$94, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1745        .dwattr $C$DW$94, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1746        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1747        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1748        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1749        .dwattr $C$DW$94, DW_AT_decl_line(0x75)
    1750        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1751$C$DW$95        .dwtag  DW_TAG_member
    1752        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1753        .dwattr $C$DW$95, DW_AT_name("UART_CLK_EN")
    1754        .dwattr $C$DW$95, DW_AT_TI_symbol_name("UART_CLK_EN")
    1755        .dwattr $C$DW$95, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1756        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1758        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1759        .dwattr $C$DW$95, DW_AT_decl_line(0x76)
    1760        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1761$C$DW$96        .dwtag  DW_TAG_member
    1762        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1763        .dwattr $C$DW$96, DW_AT_name("ECAP_CLK_STOP_REQ")
    1764        .dwattr $C$DW$96, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1765        .dwattr $C$DW$96, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1766        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1768        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1769        .dwattr $C$DW$96, DW_AT_decl_line(0x77)
    1770        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1771$C$DW$97        .dwtag  DW_TAG_member
    1772        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1773        .dwattr $C$DW$97, DW_AT_name("ECAP_CLK_STOP_ACK")
    1774        .dwattr $C$DW$97, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1775        .dwattr $C$DW$97, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1776        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1778        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1779        .dwattr $C$DW$97, DW_AT_decl_line(0x78)
    1780        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1781$C$DW$98        .dwtag  DW_TAG_member
    1782        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1783        .dwattr $C$DW$98, DW_AT_name("ECAP_CLK_EN")
    1784        .dwattr $C$DW$98, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1785        .dwattr $C$DW$98, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1786        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1787        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1788        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1789        .dwattr $C$DW$98, DW_AT_decl_line(0x79)
    1790        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1791$C$DW$99        .dwtag  DW_TAG_member
    1792        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1793        .dwattr $C$DW$99, DW_AT_name("IEP_CLK_STOP_REQ")
    1794        .dwattr $C$DW$99, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1795        .dwattr $C$DW$99, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1796        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   34

    1797        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1798        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1799        .dwattr $C$DW$99, DW_AT_decl_line(0x7a)
    1800        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1801$C$DW$100       .dwtag  DW_TAG_member
    1802        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1803        .dwattr $C$DW$100, DW_AT_name("IEP_CLK_STOP_ACK")
    1804        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1805        .dwattr $C$DW$100, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1806        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1808        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1809        .dwattr $C$DW$100, DW_AT_decl_line(0x7b)
    1810        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1811$C$DW$101       .dwtag  DW_TAG_member
    1812        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1813        .dwattr $C$DW$101, DW_AT_name("IEP_CLK_EN")
    1814        .dwattr $C$DW$101, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1815        .dwattr $C$DW$101, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1816        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1817        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1818        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1819        .dwattr $C$DW$101, DW_AT_decl_line(0x7c)
    1820        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1821$C$DW$102       .dwtag  DW_TAG_member
    1822        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1823        .dwattr $C$DW$102, DW_AT_name("rsvd18")
    1824        .dwattr $C$DW$102, DW_AT_TI_symbol_name("rsvd18")
    1825        .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1826        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1828        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1829        .dwattr $C$DW$102, DW_AT_decl_line(0x7d)
    1830        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1831        .dwendtag $C$DW$T$23
    1832
    1833        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1834        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1835        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1836$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1837        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$23)
    1838
    1839$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1840        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1841$C$DW$103       .dwtag  DW_TAG_member
    1842        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1843        .dwattr $C$DW$103, DW_AT_name("PRU0_IMEM_PE_RAW")
    1844        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1845        .dwattr $C$DW$103, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1846        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1847        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1848        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1849        .dwattr $C$DW$103, DW_AT_decl_line(0x87)
    1850        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1851$C$DW$104       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   35

    1852        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1853        .dwattr $C$DW$104, DW_AT_name("PRU0_DMEM_PE_RAW")
    1854        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1855        .dwattr $C$DW$104, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1856        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1858        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1859        .dwattr $C$DW$104, DW_AT_decl_line(0x88)
    1860        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1861$C$DW$105       .dwtag  DW_TAG_member
    1862        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1863        .dwattr $C$DW$105, DW_AT_name("PRU1_IMEM_PE_RAW")
    1864        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1865        .dwattr $C$DW$105, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1866        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1868        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1869        .dwattr $C$DW$105, DW_AT_decl_line(0x89)
    1870        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1871$C$DW$106       .dwtag  DW_TAG_member
    1872        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1873        .dwattr $C$DW$106, DW_AT_name("PRU1_DMEM_PE_RAW")
    1874        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1875        .dwattr $C$DW$106, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1876        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1878        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1879        .dwattr $C$DW$106, DW_AT_decl_line(0x8a)
    1880        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1881$C$DW$107       .dwtag  DW_TAG_member
    1882        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1883        .dwattr $C$DW$107, DW_AT_name("RAM_PE_RAW")
    1884        .dwattr $C$DW$107, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1885        .dwattr $C$DW$107, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1886        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1887        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1888        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1889        .dwattr $C$DW$107, DW_AT_decl_line(0x8b)
    1890        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1891$C$DW$108       .dwtag  DW_TAG_member
    1892        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1893        .dwattr $C$DW$108, DW_AT_name("rsvd20")
    1894        .dwattr $C$DW$108, DW_AT_TI_symbol_name("rsvd20")
    1895        .dwattr $C$DW$108, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1896        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1898        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1899        .dwattr $C$DW$108, DW_AT_decl_line(0x8c)
    1900        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1901        .dwendtag $C$DW$T$24
    1902
    1903        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1904        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1905        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1906$C$DW$T$141     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   36

    1907        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$24)
    1908
    1909$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1910        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1911$C$DW$109       .dwtag  DW_TAG_member
    1912        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1913        .dwattr $C$DW$109, DW_AT_name("PRU0_IMEM_PE")
    1914        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1915        .dwattr $C$DW$109, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1916        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1918        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1919        .dwattr $C$DW$109, DW_AT_decl_line(0x96)
    1920        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1921$C$DW$110       .dwtag  DW_TAG_member
    1922        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1923        .dwattr $C$DW$110, DW_AT_name("PRU0_DMEM_PE")
    1924        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1925        .dwattr $C$DW$110, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1926        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1928        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1929        .dwattr $C$DW$110, DW_AT_decl_line(0x97)
    1930        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1931$C$DW$111       .dwtag  DW_TAG_member
    1932        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1933        .dwattr $C$DW$111, DW_AT_name("PRU1_IMEM_PE")
    1934        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1935        .dwattr $C$DW$111, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1936        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1938        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1939        .dwattr $C$DW$111, DW_AT_decl_line(0x98)
    1940        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1941$C$DW$112       .dwtag  DW_TAG_member
    1942        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1943        .dwattr $C$DW$112, DW_AT_name("PRU1_DMEM_PE")
    1944        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1945        .dwattr $C$DW$112, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1946        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1948        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1949        .dwattr $C$DW$112, DW_AT_decl_line(0x99)
    1950        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1951$C$DW$113       .dwtag  DW_TAG_member
    1952        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1953        .dwattr $C$DW$113, DW_AT_name("RAM_PE")
    1954        .dwattr $C$DW$113, DW_AT_TI_symbol_name("RAM_PE")
    1955        .dwattr $C$DW$113, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1956        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1958        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1959        .dwattr $C$DW$113, DW_AT_decl_line(0x9a)
    1960        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1961$C$DW$114       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   37

    1962        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1963        .dwattr $C$DW$114, DW_AT_name("rsvd20")
    1964        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd20")
    1965        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1966        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1967        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1968        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1969        .dwattr $C$DW$114, DW_AT_decl_line(0x9b)
    1970        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1971        .dwendtag $C$DW$T$25
    1972
    1973        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1974        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1975        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1976$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    1977        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$25)
    1978
    1979$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1980        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1981$C$DW$115       .dwtag  DW_TAG_member
    1982        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1983        .dwattr $C$DW$115, DW_AT_name("PRU0_IMEM_PE_SET")
    1984        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1985        .dwattr $C$DW$115, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1986        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1988        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1989        .dwattr $C$DW$115, DW_AT_decl_line(0xa4)
    1990        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1991$C$DW$116       .dwtag  DW_TAG_member
    1992        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1993        .dwattr $C$DW$116, DW_AT_name("PRU0_DMEM_PE_SET")
    1994        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1995        .dwattr $C$DW$116, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1996        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1997        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1998        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1999        .dwattr $C$DW$116, DW_AT_decl_line(0xa5)
    2000        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    2001$C$DW$117       .dwtag  DW_TAG_member
    2002        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    2003        .dwattr $C$DW$117, DW_AT_name("PRU1_IMEM_PE_SET")
    2004        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    2005        .dwattr $C$DW$117, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2006        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2007        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2008        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2009        .dwattr $C$DW$117, DW_AT_decl_line(0xa6)
    2010        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    2011$C$DW$118       .dwtag  DW_TAG_member
    2012        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    2013        .dwattr $C$DW$118, DW_AT_name("PRU1_DMEM_PE_SET")
    2014        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2015        .dwattr $C$DW$118, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2016        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   38

    2017        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2018        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2019        .dwattr $C$DW$118, DW_AT_decl_line(0xa7)
    2020        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    2021$C$DW$119       .dwtag  DW_TAG_member
    2022        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    2023        .dwattr $C$DW$119, DW_AT_name("RAM_PE_SET")
    2024        .dwattr $C$DW$119, DW_AT_TI_symbol_name("RAM_PE_SET")
    2025        .dwattr $C$DW$119, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2026        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2027        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2028        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2029        .dwattr $C$DW$119, DW_AT_decl_line(0xa8)
    2030        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    2031$C$DW$120       .dwtag  DW_TAG_member
    2032        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    2033        .dwattr $C$DW$120, DW_AT_name("rsvd20")
    2034        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd20")
    2035        .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2036        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2038        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2039        .dwattr $C$DW$120, DW_AT_decl_line(0xa9)
    2040        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    2041        .dwendtag $C$DW$T$26
    2042
    2043        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2044        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2045        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2046$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    2047        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$26)
    2048
    2049$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2050        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2051$C$DW$121       .dwtag  DW_TAG_member
    2052        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2053        .dwattr $C$DW$121, DW_AT_name("PRU0_IMEM_PE_CLR")
    2054        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2055        .dwattr $C$DW$121, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2056        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2058        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2059        .dwattr $C$DW$121, DW_AT_decl_line(0xb3)
    2060        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2061$C$DW$122       .dwtag  DW_TAG_member
    2062        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2063        .dwattr $C$DW$122, DW_AT_name("PRU0_DMEM_PE_CLR")
    2064        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2065        .dwattr $C$DW$122, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2066        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2068        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2069        .dwattr $C$DW$122, DW_AT_decl_line(0xb4)
    2070        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2071$C$DW$123       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   39

    2072        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2073        .dwattr $C$DW$123, DW_AT_name("PRU1_IMEM_PE_CLR")
    2074        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2075        .dwattr $C$DW$123, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2076        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2078        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2079        .dwattr $C$DW$123, DW_AT_decl_line(0xb5)
    2080        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2081$C$DW$124       .dwtag  DW_TAG_member
    2082        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2083        .dwattr $C$DW$124, DW_AT_name("PRU1_DMEM_PE_CLR")
    2084        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2085        .dwattr $C$DW$124, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2086        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2088        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2089        .dwattr $C$DW$124, DW_AT_decl_line(0xb6)
    2090        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2091$C$DW$125       .dwtag  DW_TAG_member
    2092        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2093        .dwattr $C$DW$125, DW_AT_name("rsvd16")
    2094        .dwattr $C$DW$125, DW_AT_TI_symbol_name("rsvd16")
    2095        .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2096        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2097        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2098        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2099        .dwattr $C$DW$125, DW_AT_decl_line(0xb7)
    2100        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2101        .dwendtag $C$DW$T$27
    2102
    2103        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2104        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2105        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2106$C$DW$T$147     .dwtag  DW_TAG_volatile_type
    2107        .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$27)
    2108
    2109$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2110        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2111$C$DW$126       .dwtag  DW_TAG_member
    2112        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2113        .dwattr $C$DW$126, DW_AT_name("PMAO_PRU0")
    2114        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PMAO_PRU0")
    2115        .dwattr $C$DW$126, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2116        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2118        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2119        .dwattr $C$DW$126, DW_AT_decl_line(0xc4)
    2120        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2121$C$DW$127       .dwtag  DW_TAG_member
    2122        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2123        .dwattr $C$DW$127, DW_AT_name("PMAO_PRU1")
    2124        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PMAO_PRU1")
    2125        .dwattr $C$DW$127, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2126        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   40

    2127        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2128        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2129        .dwattr $C$DW$127, DW_AT_decl_line(0xc5)
    2130        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2131$C$DW$128       .dwtag  DW_TAG_member
    2132        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2133        .dwattr $C$DW$128, DW_AT_name("rsvd2")
    2134        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd2")
    2135        .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2136        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2137        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2138        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2139        .dwattr $C$DW$128, DW_AT_decl_line(0xc6)
    2140        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2141        .dwendtag $C$DW$T$28
    2142
    2143        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2144        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2145        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2146$C$DW$T$149     .dwtag  DW_TAG_volatile_type
    2147        .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$28)
    2148
    2149$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2150        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2151$C$DW$129       .dwtag  DW_TAG_member
    2152        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2153        .dwattr $C$DW$129, DW_AT_name("OCP_EN")
    2154        .dwattr $C$DW$129, DW_AT_TI_symbol_name("OCP_EN")
    2155        .dwattr $C$DW$129, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2156        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2158        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2159        .dwattr $C$DW$129, DW_AT_decl_line(0xd3)
    2160        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2161$C$DW$130       .dwtag  DW_TAG_member
    2162        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2163        .dwattr $C$DW$130, DW_AT_name("rsvd1")
    2164        .dwattr $C$DW$130, DW_AT_TI_symbol_name("rsvd1")
    2165        .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2166        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2168        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2169        .dwattr $C$DW$130, DW_AT_decl_line(0xd4)
    2170        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2171        .dwendtag $C$DW$T$29
    2172
    2173        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2174        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2175        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2176$C$DW$T$151     .dwtag  DW_TAG_volatile_type
    2177        .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$29)
    2178
    2179$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2180        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2181$C$DW$131       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   41

    2182        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2183        .dwattr $C$DW$131, DW_AT_name("PRU1_PAD_HP_EN")
    2184        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2185        .dwattr $C$DW$131, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2186        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2188        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2189        .dwattr $C$DW$131, DW_AT_decl_line(0xde)
    2190        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2191$C$DW$132       .dwtag  DW_TAG_member
    2192        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2193        .dwattr $C$DW$132, DW_AT_name("XFR_SHIFT_EN")
    2194        .dwattr $C$DW$132, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2195        .dwattr $C$DW$132, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2196        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2197        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2198        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2199        .dwattr $C$DW$132, DW_AT_decl_line(0xdf)
    2200        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2201$C$DW$133       .dwtag  DW_TAG_member
    2202        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2203        .dwattr $C$DW$133, DW_AT_name("rsvd2")
    2204        .dwattr $C$DW$133, DW_AT_TI_symbol_name("rsvd2")
    2205        .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2206        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2208        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2209        .dwattr $C$DW$133, DW_AT_decl_line(0xe0)
    2210        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2211        .dwendtag $C$DW$T$30
    2212
    2213        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2214        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2215        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2216$C$DW$T$153     .dwtag  DW_TAG_volatile_type
    2217        .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$30)
    2218
    2219$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2220        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2221$C$DW$134       .dwtag  DW_TAG_member
    2222        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2223        .dwattr $C$DW$134, DW_AT_name("PIN_MUX_SEL")
    2224        .dwattr $C$DW$134, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2225        .dwattr $C$DW$134, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    2226        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2228        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2229        .dwattr $C$DW$134, DW_AT_decl_line(0xec)
    2230        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2231$C$DW$135       .dwtag  DW_TAG_member
    2232        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2233        .dwattr $C$DW$135, DW_AT_name("rsvd2")
    2234        .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd2")
    2235        .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    2236        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   42

    2237        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2238        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2239        .dwattr $C$DW$135, DW_AT_decl_line(0xed)
    2240        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2241        .dwendtag $C$DW$T$31
    2242
    2243        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2244        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2245        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2246$C$DW$T$155     .dwtag  DW_TAG_volatile_type
    2247        .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$31)
    2248
    2249$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2250        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2251$C$DW$136       .dwtag  DW_TAG_member
    2252        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$132)
    2253        .dwattr $C$DW$136, DW_AT_name("$P$T0")
    2254        .dwattr $C$DW$136, DW_AT_TI_symbol_name("$P$T0")
    2255        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2257        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2258        .dwattr $C$DW$136, DW_AT_decl_line(0x29)
    2259        .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    2260$C$DW$137       .dwtag  DW_TAG_member
    2261        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$134)
    2262        .dwattr $C$DW$137, DW_AT_name("$P$T1")
    2263        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T1")
    2264        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2265        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2266        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2267        .dwattr $C$DW$137, DW_AT_decl_line(0x33)
    2268        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2269$C$DW$138       .dwtag  DW_TAG_member
    2270        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$136)
    2271        .dwattr $C$DW$138, DW_AT_name("$P$T2")
    2272        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T2")
    2273        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2274        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2275        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2276        .dwattr $C$DW$138, DW_AT_decl_line(0x41)
    2277        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    2278$C$DW$139       .dwtag  DW_TAG_member
    2279        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$138)
    2280        .dwattr $C$DW$139, DW_AT_name("$P$T3")
    2281        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T3")
    2282        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2283        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2284        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2285        .dwattr $C$DW$139, DW_AT_decl_line(0x54)
    2286        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2287$C$DW$140       .dwtag  DW_TAG_member
    2288        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$140)
    2289        .dwattr $C$DW$140, DW_AT_name("$P$T4")
    2290        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T4")
    2291        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   43

    2292        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2293        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2294        .dwattr $C$DW$140, DW_AT_decl_line(0x67)
    2295        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2296$C$DW$141       .dwtag  DW_TAG_member
    2297        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$142)
    2298        .dwattr $C$DW$141, DW_AT_name("$P$T5")
    2299        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T5")
    2300        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2301        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2302        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2303        .dwattr $C$DW$141, DW_AT_decl_line(0x83)
    2304        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2305$C$DW$142       .dwtag  DW_TAG_member
    2306        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$144)
    2307        .dwattr $C$DW$142, DW_AT_name("$P$T6")
    2308        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T6")
    2309        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2310        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2311        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2312        .dwattr $C$DW$142, DW_AT_decl_line(0x92)
    2313        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2314$C$DW$143       .dwtag  DW_TAG_member
    2315        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$146)
    2316        .dwattr $C$DW$143, DW_AT_name("$P$T7")
    2317        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T7")
    2318        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2319        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2320        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2321        .dwattr $C$DW$143, DW_AT_decl_line(0xa0)
    2322        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2323$C$DW$144       .dwtag  DW_TAG_member
    2324        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$148)
    2325        .dwattr $C$DW$144, DW_AT_name("$P$T8")
    2326        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T8")
    2327        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2328        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2329        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2330        .dwattr $C$DW$144, DW_AT_decl_line(0xaf)
    2331        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2332$C$DW$145       .dwtag  DW_TAG_member
    2333        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    2334        .dwattr $C$DW$145, DW_AT_name("rsvd24")
    2335        .dwattr $C$DW$145, DW_AT_TI_symbol_name("rsvd24")
    2336        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2337        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2338        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2339        .dwattr $C$DW$145, DW_AT_decl_line(0xbc)
    2340        .dwattr $C$DW$145, DW_AT_decl_column(0x0b)
    2341$C$DW$146       .dwtag  DW_TAG_member
    2342        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$150)
    2343        .dwattr $C$DW$146, DW_AT_name("$P$T9")
    2344        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T9")
    2345        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2346        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   44

    2347        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2348        .dwattr $C$DW$146, DW_AT_decl_line(0xc0)
    2349        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2350$C$DW$147       .dwtag  DW_TAG_member
    2351        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$33)
    2352        .dwattr $C$DW$147, DW_AT_name("rsvd2c")
    2353        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd2c")
    2354        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2355        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2356        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2357        .dwattr $C$DW$147, DW_AT_decl_line(0xcb)
    2358        .dwattr $C$DW$147, DW_AT_decl_column(0x0b)
    2359$C$DW$148       .dwtag  DW_TAG_member
    2360        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$152)
    2361        .dwattr $C$DW$148, DW_AT_name("$P$T10")
    2362        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T10")
    2363        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2364        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2365        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2366        .dwattr $C$DW$148, DW_AT_decl_line(0xcf)
    2367        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2368$C$DW$149       .dwtag  DW_TAG_member
    2369        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$154)
    2370        .dwattr $C$DW$149, DW_AT_name("$P$T11")
    2371        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T11")
    2372        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2373        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2374        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2375        .dwattr $C$DW$149, DW_AT_decl_line(0xda)
    2376        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2377$C$DW$150       .dwtag  DW_TAG_member
    2378        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$34)
    2379        .dwattr $C$DW$150, DW_AT_name("rsvd38")
    2380        .dwattr $C$DW$150, DW_AT_TI_symbol_name("rsvd38")
    2381        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2382        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2383        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2384        .dwattr $C$DW$150, DW_AT_decl_line(0xe5)
    2385        .dwattr $C$DW$150, DW_AT_decl_column(0x0b)
    2386$C$DW$151       .dwtag  DW_TAG_member
    2387        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$156)
    2388        .dwattr $C$DW$151, DW_AT_name("$P$T12")
    2389        .dwattr $C$DW$151, DW_AT_TI_symbol_name("$P$T12")
    2390        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2391        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2392        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2393        .dwattr $C$DW$151, DW_AT_decl_line(0xe8)
    2394        .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2395        .dwendtag $C$DW$T$35
    2396
    2397        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2398        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2399        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2400$C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2401        .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$35)
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   45

    2402        .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    2403        .dwattr $C$DW$T$353, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2404        .dwattr $C$DW$T$353, DW_AT_decl_line(0xf0)
    2405        .dwattr $C$DW$T$353, DW_AT_decl_column(0x03)
    2406$C$DW$T$354     .dwtag  DW_TAG_volatile_type
    2407        .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
    2408
    2409$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2410        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2411$C$DW$152       .dwtag  DW_TAG_member
    2412        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2413        .dwattr $C$DW$152, DW_AT_name("REV_MINOR")
    2414        .dwattr $C$DW$152, DW_AT_TI_symbol_name("REV_MINOR")
    2415        .dwattr $C$DW$152, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2416        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2418        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2419        .dwattr $C$DW$152, DW_AT_decl_line(0x2d)
    2420        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2421$C$DW$153       .dwtag  DW_TAG_member
    2422        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2423        .dwattr $C$DW$153, DW_AT_name("REV_CUSTOM")
    2424        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_CUSTOM")
    2425        .dwattr $C$DW$153, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2426        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2428        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2429        .dwattr $C$DW$153, DW_AT_decl_line(0x2e)
    2430        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2431$C$DW$154       .dwtag  DW_TAG_member
    2432        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2433        .dwattr $C$DW$154, DW_AT_name("REV_MAJOR")
    2434        .dwattr $C$DW$154, DW_AT_TI_symbol_name("REV_MAJOR")
    2435        .dwattr $C$DW$154, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2436        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2438        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2439        .dwattr $C$DW$154, DW_AT_decl_line(0x2f)
    2440        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2441$C$DW$155       .dwtag  DW_TAG_member
    2442        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2443        .dwattr $C$DW$155, DW_AT_name("REV_RTL")
    2444        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_RTL")
    2445        .dwattr $C$DW$155, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2446        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2448        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2449        .dwattr $C$DW$155, DW_AT_decl_line(0x30)
    2450        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2451$C$DW$156       .dwtag  DW_TAG_member
    2452        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2453        .dwattr $C$DW$156, DW_AT_name("REV_MODULE")
    2454        .dwattr $C$DW$156, DW_AT_TI_symbol_name("REV_MODULE")
    2455        .dwattr $C$DW$156, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2456        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   46

    2457        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2458        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2459        .dwattr $C$DW$156, DW_AT_decl_line(0x31)
    2460        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2461$C$DW$157       .dwtag  DW_TAG_member
    2462        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2463        .dwattr $C$DW$157, DW_AT_name("rsvd28")
    2464        .dwattr $C$DW$157, DW_AT_TI_symbol_name("rsvd28")
    2465        .dwattr $C$DW$157, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2466        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2468        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2469        .dwattr $C$DW$157, DW_AT_decl_line(0x32)
    2470        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2471$C$DW$158       .dwtag  DW_TAG_member
    2472        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2473        .dwattr $C$DW$158, DW_AT_name("REV_SCHEME")
    2474        .dwattr $C$DW$158, DW_AT_TI_symbol_name("REV_SCHEME")
    2475        .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2476        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2477        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2478        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2479        .dwattr $C$DW$158, DW_AT_decl_line(0x33)
    2480        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2481        .dwendtag $C$DW$T$36
    2482
    2483        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2484        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2485        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2486$C$DW$T$157     .dwtag  DW_TAG_volatile_type
    2487        .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$36)
    2488
    2489$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2490        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2491$C$DW$159       .dwtag  DW_TAG_member
    2492        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2493        .dwattr $C$DW$159, DW_AT_name("rsvd0")
    2494        .dwattr $C$DW$159, DW_AT_TI_symbol_name("rsvd0")
    2495        .dwattr $C$DW$159, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2496        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2497        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2498        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2499        .dwattr $C$DW$159, DW_AT_decl_line(0x3d)
    2500        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2501$C$DW$160       .dwtag  DW_TAG_member
    2502        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2503        .dwattr $C$DW$160, DW_AT_name("NEST_MODE")
    2504        .dwattr $C$DW$160, DW_AT_TI_symbol_name("NEST_MODE")
    2505        .dwattr $C$DW$160, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2506        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2507        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2508        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2509        .dwattr $C$DW$160, DW_AT_decl_line(0x3e)
    2510        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2511$C$DW$161       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   47

    2512        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2513        .dwattr $C$DW$161, DW_AT_name("rsvd4")
    2514        .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd4")
    2515        .dwattr $C$DW$161, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2516        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2518        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2519        .dwattr $C$DW$161, DW_AT_decl_line(0x3f)
    2520        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2521        .dwendtag $C$DW$T$37
    2522
    2523        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2524        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2525        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2526$C$DW$T$159     .dwtag  DW_TAG_volatile_type
    2527        .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$37)
    2528
    2529$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2530        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2531$C$DW$162       .dwtag  DW_TAG_member
    2532        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2533        .dwattr $C$DW$162, DW_AT_name("EN_HINT_ANY")
    2534        .dwattr $C$DW$162, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2535        .dwattr $C$DW$162, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2536        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2537        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2538        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2539        .dwattr $C$DW$162, DW_AT_decl_line(0x4c)
    2540        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2541$C$DW$163       .dwtag  DW_TAG_member
    2542        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2543        .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2544        .dwattr $C$DW$163, DW_AT_TI_symbol_name("rsvd1")
    2545        .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2546        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2548        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2549        .dwattr $C$DW$163, DW_AT_decl_line(0x4d)
    2550        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2551        .dwendtag $C$DW$T$38
    2552
    2553        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2554        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2555        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2556$C$DW$T$161     .dwtag  DW_TAG_volatile_type
    2557        .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$38)
    2558
    2559$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2560        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2561$C$DW$164       .dwtag  DW_TAG_member
    2562        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2563        .dwattr $C$DW$164, DW_AT_name("GLB_NEST_LEVEL")
    2564        .dwattr $C$DW$164, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2565        .dwattr $C$DW$164, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2566        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   48

    2567        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2568        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2569        .dwattr $C$DW$164, DW_AT_decl_line(0x5a)
    2570        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2571$C$DW$165       .dwtag  DW_TAG_member
    2572        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2573        .dwattr $C$DW$165, DW_AT_name("rsvd9")
    2574        .dwattr $C$DW$165, DW_AT_TI_symbol_name("rsvd9")
    2575        .dwattr $C$DW$165, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2576        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2578        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2579        .dwattr $C$DW$165, DW_AT_decl_line(0x5b)
    2580        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2581$C$DW$166       .dwtag  DW_TAG_member
    2582        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2583        .dwattr $C$DW$166, DW_AT_name("AUTO_OVERRIDE")
    2584        .dwattr $C$DW$166, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2585        .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2586        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2588        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2589        .dwattr $C$DW$166, DW_AT_decl_line(0x5c)
    2590        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2591        .dwendtag $C$DW$T$39
    2592
    2593        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2594        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2595        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2596$C$DW$T$163     .dwtag  DW_TAG_volatile_type
    2597        .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$39)
    2598
    2599$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2600        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2601$C$DW$167       .dwtag  DW_TAG_member
    2602        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2603        .dwattr $C$DW$167, DW_AT_name("STS_SET_IDX")
    2604        .dwattr $C$DW$167, DW_AT_TI_symbol_name("STS_SET_IDX")
    2605        .dwattr $C$DW$167, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2606        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2607        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2608        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2609        .dwattr $C$DW$167, DW_AT_decl_line(0x66)
    2610        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2611$C$DW$168       .dwtag  DW_TAG_member
    2612        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2613        .dwattr $C$DW$168, DW_AT_name("rsvd10")
    2614        .dwattr $C$DW$168, DW_AT_TI_symbol_name("rsvd10")
    2615        .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2616        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2618        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2619        .dwattr $C$DW$168, DW_AT_decl_line(0x67)
    2620        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2621        .dwendtag $C$DW$T$40
PRU Assembler Unix v2.1.4 Sun Apr 15 07:02:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
detector.asm                                                         PAGE   49

    2622
    2623        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2624        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    2625        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2626$C$DW$T$165     .dwtag  DW_TAG_volatile_type
    2627        .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$40)
    2628
    2629$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2630        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2631$C$DW$169       .dwtag  DW_TAG_member
    2632        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2633        .dwattr $C$DW$169, DW_AT_name("STS_CLR_IDX")
    2634        .dwattr $C$DW$169, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2635        .dwattr $C$DW$169, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2636        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2638        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2639        .dwattr $C$DW$169, DW_AT_decl_line(0x71)
    2640        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2641$C$DW$170       .dwtag  DW_TAG_member
    2642        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2643        .dwattr $C$DW$170, DW_AT_name("rsvd10")
    2644        .dwattr $C$DW$170, DW_AT_TI_symbol_name("rsvd10")
    2645        .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2646        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2647        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2648        .dwattr $C$DW$170, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2649        .dwattr $C$DW$170, DW_AT_decl_line(0x72)
    2650        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2651        .dwendtag $C$DW$T$41
    2652
    2653        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2654        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2655        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2656$C$DW$T$167     .dwtag  DW_TAG_volatile_type
    2657        .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$41)
    2658
