PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Thu Apr 12 07:14:39 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("hello-pru.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_beacon")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18
      19$C$DW$2 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      20        .dwattr $C$DW$2, DW_AT_TI_symbol_name("__delay_cycles")

     472;* FUNCTION PROPERTIES                                         *
     473;*                            0 Auto,  0 SOE     *
     474;***************************************************************
     475
     476 00000000                 ||main||:
     477;* --------------------------------------------------------------------------*
     478        .dwcfi  cfa_offset, 0
     479        .dwpsn  file "hello-pru.c",line 148,column 5,is_stmt,isa 0
     480;----------------------------------------------------------------------
     481; 148 | __R30 &= ~PRU0_GPIO;                                                   
     482; 150 | while(1){                                                              
     483;----------------------------------------------------------------------
     484 00000000 0000001D02FEFE          CLR       r30, r30, 0x00000002  ; [ALU_PRU] |148| 
     485;* --------------------------------------------------------------------------*
     486;*   BEGIN LOOP ||$C$L9||
     487;*
     488;*   Loop source line                : 150
     489;*   Loop closing brace source line  : 155
     490;*   Known Minimum Trip Count        : 1
     491;*   Known Maximum Trip Count        : 4294967295
     492;*   Known Max Trip Count Factor     : 1
     493;* --------------------------------------------------------------------------*
     494 00000004                 ||$C$L9||:    
     495        .dwpsn  file "hello-pru.c",line 151,column 6,is_stmt,isa 0
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   10

     496;----------------------------------------------------------------------
     497; 151 | mark(171);                                                             
     498;----------------------------------------------------------------------
     499 00000004 0000002400ABEE          LDI       r14, 0x00ab           ; [ALU_PRU] |151| 
     500$C$DW$27        .dwtag  DW_TAG_TI_branch
     501        .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     502        .dwattr $C$DW$27, DW_AT_name("mark")
     503        .dwattr $C$DW$27, DW_AT_TI_call
     504 00000008 000000230000C3!         JAL       r3.w2, ||mark||       ; [ALU_PRU] |151| mark
     505        .dwpsn  file "hello-pru.c",line 152,column 6,is_stmt,isa 0
     506;----------------------------------------------------------------------
     507; 152 | space(171);                                                            
     508;----------------------------------------------------------------------
     509 0000000c 0000002400ABEE          LDI       r14, 0x00ab           ; [ALU_PRU] |152| 
     510$C$DW$28        .dwtag  DW_TAG_TI_branch
     511        .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     512        .dwattr $C$DW$28, DW_AT_name("space")
     513        .dwattr $C$DW$28, DW_AT_TI_call
     514 00000010 000000230000C3!         JAL       r3.w2, ||space||      ; [ALU_PRU] |152| space
     515        .dwpsn  file "hello-pru.c",line 153,column 6,is_stmt,isa 0
     516;----------------------------------------------------------------------
     517; 153 | putBits(0x00006b96, 16);                                               
     518;----------------------------------------------------------------------
     519 00000014 0000002400100F          LDI       r15.b0, 0x10          ; [ALU_PRU] |153| 
     520 00000018 000000246B96EE          LDI       r14, 0x6b96           ; [ALU_PRU] |153| 
     521$C$DW$29        .dwtag  DW_TAG_TI_branch
     522        .dwattr $C$DW$29, DW_AT_low_pc(0x00)
     523        .dwattr $C$DW$29, DW_AT_name("putBits")
     524        .dwattr $C$DW$29, DW_AT_TI_call
     525 0000001c 000000230000C3!         JAL       r3.w2, ||putBits||    ; [ALU_PRU] |153| putBits
     526        .dwpsn  file "hello-pru.c",line 154,column 6,is_stmt,isa 0
     527;----------------------------------------------------------------------
     528; 154 | __delay_cycles(200000000);                                             
     529; 161 | //CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                  
     530; 199 | __halt();                                                              
     531;----------------------------------------------------------------------
     532        .newblock
     533 00000020 E0FF912405F5D1          LDI32    r17, 99999999
     534 00000028 0000000501F1F1  $1:     SUB      r17, r17, 1
     535 0000002c 0000006F00F1FF          QBNE     $1, r17, 0            ; [ALU_PRU] |154| 
     536        .dwpsn  file "hello-pru.c",line 150,column 11,is_stmt,isa 0
     537 00000030 00000021000000!         JMP       ||$C$L9||             ; [ALU_PRU] |150| 
     538;* --------------------------------------------------------------------------*
     539        .dwattr $C$DW$26, DW_AT_TI_end_file("hello-pru.c")
     540        .dwattr $C$DW$26, DW_AT_TI_end_line(0xc8)
     541        .dwattr $C$DW$26, DW_AT_TI_end_column(0x01)
     542        .dwendentry
     543        .dwendtag $C$DW$26
     544
     545
     546;******************************************************************************
     547;* TYPE INFORMATION                                                           *
     548;******************************************************************************
     549
     550$C$DW$T$19      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   11

     551        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     552$C$DW$30        .dwtag  DW_TAG_member
     553        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     554        .dwattr $C$DW$30, DW_AT_name("REVID")
     555        .dwattr $C$DW$30, DW_AT_TI_symbol_name("REVID")
     556        .dwattr $C$DW$30, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     557        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     558        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     559        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     560        .dwattr $C$DW$30, DW_AT_decl_line(0x2d)
     561        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     562        .dwendtag $C$DW$T$19
     563
     564        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     565        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     566        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     567$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     568        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     569
     570$C$DW$T$20      .dwtag  DW_TAG_structure_type
     571        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     572$C$DW$31        .dwtag  DW_TAG_member
     573        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     574        .dwattr $C$DW$31, DW_AT_name("IDLE_MODE")
     575        .dwattr $C$DW$31, DW_AT_TI_symbol_name("IDLE_MODE")
     576        .dwattr $C$DW$31, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     577        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     579        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     580        .dwattr $C$DW$31, DW_AT_decl_line(0x37)
     581        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     582$C$DW$32        .dwtag  DW_TAG_member
     583        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     584        .dwattr $C$DW$32, DW_AT_name("STANDBY_MODE")
     585        .dwattr $C$DW$32, DW_AT_TI_symbol_name("STANDBY_MODE")
     586        .dwattr $C$DW$32, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     587        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     589        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     590        .dwattr $C$DW$32, DW_AT_decl_line(0x38)
     591        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     592$C$DW$33        .dwtag  DW_TAG_member
     593        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     594        .dwattr $C$DW$33, DW_AT_name("STANDBY_INIT")
     595        .dwattr $C$DW$33, DW_AT_TI_symbol_name("STANDBY_INIT")
     596        .dwattr $C$DW$33, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     597        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     599        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     600        .dwattr $C$DW$33, DW_AT_decl_line(0x39)
     601        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     602$C$DW$34        .dwtag  DW_TAG_member
     603        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     604        .dwattr $C$DW$34, DW_AT_name("SUB_MWAIT")
     605        .dwattr $C$DW$34, DW_AT_TI_symbol_name("SUB_MWAIT")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   12

     606        .dwattr $C$DW$34, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     607        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     609        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     610        .dwattr $C$DW$34, DW_AT_decl_line(0x3a)
     611        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     612$C$DW$35        .dwtag  DW_TAG_member
     613        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     614        .dwattr $C$DW$35, DW_AT_name("rsvd6")
     615        .dwattr $C$DW$35, DW_AT_TI_symbol_name("rsvd6")
     616        .dwattr $C$DW$35, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     617        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     619        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     620        .dwattr $C$DW$35, DW_AT_decl_line(0x3b)
     621        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     622        .dwendtag $C$DW$T$20
     623
     624        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     625        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     626        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     627$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     628        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     629
     630$C$DW$T$21      .dwtag  DW_TAG_structure_type
     631        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     632$C$DW$36        .dwtag  DW_TAG_member
     633        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     634        .dwattr $C$DW$36, DW_AT_name("PRU0_GPI_MODE")
     635        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     636        .dwattr $C$DW$36, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     637        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     639        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     640        .dwattr $C$DW$36, DW_AT_decl_line(0x45)
     641        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     642$C$DW$37        .dwtag  DW_TAG_member
     643        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     644        .dwattr $C$DW$37, DW_AT_name("PRU0_GPI_CLK_MODE")
     645        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     646        .dwattr $C$DW$37, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     647        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     649        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     650        .dwattr $C$DW$37, DW_AT_decl_line(0x46)
     651        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     652$C$DW$38        .dwtag  DW_TAG_member
     653        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     654        .dwattr $C$DW$38, DW_AT_name("PRU0_GPI_DIV0")
     655        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     656        .dwattr $C$DW$38, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     657        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     659        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     660        .dwattr $C$DW$38, DW_AT_decl_line(0x47)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   13

     661        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     662$C$DW$39        .dwtag  DW_TAG_member
     663        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     664        .dwattr $C$DW$39, DW_AT_name("PRU0_GPI_DIV1")
     665        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     666        .dwattr $C$DW$39, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     667        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     669        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     670        .dwattr $C$DW$39, DW_AT_decl_line(0x48)
     671        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     672$C$DW$40        .dwtag  DW_TAG_member
     673        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     674        .dwattr $C$DW$40, DW_AT_name("PRU0_GPI_SB")
     675        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     676        .dwattr $C$DW$40, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     677        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     679        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     680        .dwattr $C$DW$40, DW_AT_decl_line(0x49)
     681        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     682$C$DW$41        .dwtag  DW_TAG_member
     683        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     684        .dwattr $C$DW$41, DW_AT_name("PRU0_GPO_MODE")
     685        .dwattr $C$DW$41, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     686        .dwattr $C$DW$41, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     687        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     689        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     690        .dwattr $C$DW$41, DW_AT_decl_line(0x4a)
     691        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     692$C$DW$42        .dwtag  DW_TAG_member
     693        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     694        .dwattr $C$DW$42, DW_AT_name("PRU0_GPO_DIV0")
     695        .dwattr $C$DW$42, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     696        .dwattr $C$DW$42, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     697        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     699        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     700        .dwattr $C$DW$42, DW_AT_decl_line(0x4b)
     701        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     702$C$DW$43        .dwtag  DW_TAG_member
     703        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     704        .dwattr $C$DW$43, DW_AT_name("PRU0_GPO_DIV1")
     705        .dwattr $C$DW$43, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     706        .dwattr $C$DW$43, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     707        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     708        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     709        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     710        .dwattr $C$DW$43, DW_AT_decl_line(0x4c)
     711        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     712$C$DW$44        .dwtag  DW_TAG_member
     713        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     714        .dwattr $C$DW$44, DW_AT_name("PRU0_GPO_SH_SEL")
     715        .dwattr $C$DW$44, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   14

     716        .dwattr $C$DW$44, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     717        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     718        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     719        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     720        .dwattr $C$DW$44, DW_AT_decl_line(0x4d)
     721        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     722$C$DW$45        .dwtag  DW_TAG_member
     723        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     724        .dwattr $C$DW$45, DW_AT_name("rsvd26")
     725        .dwattr $C$DW$45, DW_AT_TI_symbol_name("rsvd26")
     726        .dwattr $C$DW$45, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     727        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     729        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     730        .dwattr $C$DW$45, DW_AT_decl_line(0x4e)
     731        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     732        .dwendtag $C$DW$T$21
     733
     734        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     735        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     736        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     737$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     738        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     739
     740$C$DW$T$22      .dwtag  DW_TAG_structure_type
     741        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     742$C$DW$46        .dwtag  DW_TAG_member
     743        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     744        .dwattr $C$DW$46, DW_AT_name("PRU1_GPI_MODE")
     745        .dwattr $C$DW$46, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     746        .dwattr $C$DW$46, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     747        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     749        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     750        .dwattr $C$DW$46, DW_AT_decl_line(0x58)
     751        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     752$C$DW$47        .dwtag  DW_TAG_member
     753        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     754        .dwattr $C$DW$47, DW_AT_name("PRU1_GPI_CLK_MODE")
     755        .dwattr $C$DW$47, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     756        .dwattr $C$DW$47, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     757        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     759        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     760        .dwattr $C$DW$47, DW_AT_decl_line(0x59)
     761        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     762$C$DW$48        .dwtag  DW_TAG_member
     763        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     764        .dwattr $C$DW$48, DW_AT_name("PRU1_GPI_DIV0")
     765        .dwattr $C$DW$48, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     766        .dwattr $C$DW$48, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     767        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     768        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     769        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     770        .dwattr $C$DW$48, DW_AT_decl_line(0x5a)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   15

     771        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     772$C$DW$49        .dwtag  DW_TAG_member
     773        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     774        .dwattr $C$DW$49, DW_AT_name("PRU1_GPI_DIV1")
     775        .dwattr $C$DW$49, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     776        .dwattr $C$DW$49, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     777        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     779        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     780        .dwattr $C$DW$49, DW_AT_decl_line(0x5b)
     781        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     782$C$DW$50        .dwtag  DW_TAG_member
     783        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     784        .dwattr $C$DW$50, DW_AT_name("PRU1_GPI_SB")
     785        .dwattr $C$DW$50, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     786        .dwattr $C$DW$50, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     787        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     789        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     790        .dwattr $C$DW$50, DW_AT_decl_line(0x5c)
     791        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     792$C$DW$51        .dwtag  DW_TAG_member
     793        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     794        .dwattr $C$DW$51, DW_AT_name("PRU1_GPO_MODE")
     795        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     796        .dwattr $C$DW$51, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     797        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     799        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     800        .dwattr $C$DW$51, DW_AT_decl_line(0x5d)
     801        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     802$C$DW$52        .dwtag  DW_TAG_member
     803        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     804        .dwattr $C$DW$52, DW_AT_name("PRU1_GPO_DIV0")
     805        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     806        .dwattr $C$DW$52, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     807        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     809        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     810        .dwattr $C$DW$52, DW_AT_decl_line(0x5e)
     811        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     812$C$DW$53        .dwtag  DW_TAG_member
     813        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     814        .dwattr $C$DW$53, DW_AT_name("PRU1_GPO_DIV1")
     815        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     816        .dwattr $C$DW$53, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     817        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     819        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     820        .dwattr $C$DW$53, DW_AT_decl_line(0x5f)
     821        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     822$C$DW$54        .dwtag  DW_TAG_member
     823        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     824        .dwattr $C$DW$54, DW_AT_name("PRU1_GPO_SH_SEL")
     825        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   16

     826        .dwattr $C$DW$54, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     827        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     828        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     829        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     830        .dwattr $C$DW$54, DW_AT_decl_line(0x60)
     831        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     832$C$DW$55        .dwtag  DW_TAG_member
     833        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     834        .dwattr $C$DW$55, DW_AT_name("rsvd26")
     835        .dwattr $C$DW$55, DW_AT_TI_symbol_name("rsvd26")
     836        .dwattr $C$DW$55, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     837        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     839        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     840        .dwattr $C$DW$55, DW_AT_decl_line(0x61)
     841        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     842        .dwendtag $C$DW$T$22
     843
     844        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     845        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     846        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     847$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     848        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     849
     850$C$DW$T$23      .dwtag  DW_TAG_structure_type
     851        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     852$C$DW$56        .dwtag  DW_TAG_member
     853        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     854        .dwattr $C$DW$56, DW_AT_name("PRU0_CLK_STOP_REQ")
     855        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     856        .dwattr $C$DW$56, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     857        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     859        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     860        .dwattr $C$DW$56, DW_AT_decl_line(0x6b)
     861        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     862$C$DW$57        .dwtag  DW_TAG_member
     863        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     864        .dwattr $C$DW$57, DW_AT_name("PRU0_CLK_STOP_ACK")
     865        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     866        .dwattr $C$DW$57, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     867        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     869        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     870        .dwattr $C$DW$57, DW_AT_decl_line(0x6c)
     871        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     872$C$DW$58        .dwtag  DW_TAG_member
     873        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     874        .dwattr $C$DW$58, DW_AT_name("PRU0_CLK_EN")
     875        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     876        .dwattr $C$DW$58, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     877        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     878        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     879        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     880        .dwattr $C$DW$58, DW_AT_decl_line(0x6d)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   17

     881        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     882$C$DW$59        .dwtag  DW_TAG_member
     883        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     884        .dwattr $C$DW$59, DW_AT_name("PRU1_CLK_STOP_REQ")
     885        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     886        .dwattr $C$DW$59, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     887        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     889        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     890        .dwattr $C$DW$59, DW_AT_decl_line(0x6e)
     891        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     892$C$DW$60        .dwtag  DW_TAG_member
     893        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     894        .dwattr $C$DW$60, DW_AT_name("PRU1_CLK_STOP_ACK")
     895        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     896        .dwattr $C$DW$60, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     897        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     899        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     900        .dwattr $C$DW$60, DW_AT_decl_line(0x6f)
     901        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     902$C$DW$61        .dwtag  DW_TAG_member
     903        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     904        .dwattr $C$DW$61, DW_AT_name("PRU1_CLK_EN")
     905        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     906        .dwattr $C$DW$61, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     907        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     909        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     910        .dwattr $C$DW$61, DW_AT_decl_line(0x70)
     911        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     912$C$DW$62        .dwtag  DW_TAG_member
     913        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     914        .dwattr $C$DW$62, DW_AT_name("INTC_CLK_STOP_REQ")
     915        .dwattr $C$DW$62, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     916        .dwattr $C$DW$62, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     917        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     918        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     919        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     920        .dwattr $C$DW$62, DW_AT_decl_line(0x71)
     921        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     922$C$DW$63        .dwtag  DW_TAG_member
     923        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     924        .dwattr $C$DW$63, DW_AT_name("INTC_CLK_STOP_ACK")
     925        .dwattr $C$DW$63, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     926        .dwattr $C$DW$63, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     927        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     929        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     930        .dwattr $C$DW$63, DW_AT_decl_line(0x72)
     931        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     932$C$DW$64        .dwtag  DW_TAG_member
     933        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     934        .dwattr $C$DW$64, DW_AT_name("INTC_CLK_EN")
     935        .dwattr $C$DW$64, DW_AT_TI_symbol_name("INTC_CLK_EN")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   18

     936        .dwattr $C$DW$64, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     937        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     938        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     939        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     940        .dwattr $C$DW$64, DW_AT_decl_line(0x73)
     941        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     942$C$DW$65        .dwtag  DW_TAG_member
     943        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     944        .dwattr $C$DW$65, DW_AT_name("UART_CLK_STOP_REQ")
     945        .dwattr $C$DW$65, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     946        .dwattr $C$DW$65, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     947        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     949        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     950        .dwattr $C$DW$65, DW_AT_decl_line(0x74)
     951        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     952$C$DW$66        .dwtag  DW_TAG_member
     953        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     954        .dwattr $C$DW$66, DW_AT_name("UART_CLK_STOP_ACK")
     955        .dwattr $C$DW$66, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     956        .dwattr $C$DW$66, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     957        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     958        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     959        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     960        .dwattr $C$DW$66, DW_AT_decl_line(0x75)
     961        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     962$C$DW$67        .dwtag  DW_TAG_member
     963        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     964        .dwattr $C$DW$67, DW_AT_name("UART_CLK_EN")
     965        .dwattr $C$DW$67, DW_AT_TI_symbol_name("UART_CLK_EN")
     966        .dwattr $C$DW$67, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     967        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     969        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     970        .dwattr $C$DW$67, DW_AT_decl_line(0x76)
     971        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     972$C$DW$68        .dwtag  DW_TAG_member
     973        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     974        .dwattr $C$DW$68, DW_AT_name("ECAP_CLK_STOP_REQ")
     975        .dwattr $C$DW$68, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     976        .dwattr $C$DW$68, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     977        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     979        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     980        .dwattr $C$DW$68, DW_AT_decl_line(0x77)
     981        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     982$C$DW$69        .dwtag  DW_TAG_member
     983        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     984        .dwattr $C$DW$69, DW_AT_name("ECAP_CLK_STOP_ACK")
     985        .dwattr $C$DW$69, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     986        .dwattr $C$DW$69, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     987        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     989        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     990        .dwattr $C$DW$69, DW_AT_decl_line(0x78)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   19

     991        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     992$C$DW$70        .dwtag  DW_TAG_member
     993        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     994        .dwattr $C$DW$70, DW_AT_name("ECAP_CLK_EN")
     995        .dwattr $C$DW$70, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     996        .dwattr $C$DW$70, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     997        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     999        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1000        .dwattr $C$DW$70, DW_AT_decl_line(0x79)
    1001        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1002$C$DW$71        .dwtag  DW_TAG_member
    1003        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1004        .dwattr $C$DW$71, DW_AT_name("IEP_CLK_STOP_REQ")
    1005        .dwattr $C$DW$71, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1006        .dwattr $C$DW$71, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1007        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1009        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1010        .dwattr $C$DW$71, DW_AT_decl_line(0x7a)
    1011        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1012$C$DW$72        .dwtag  DW_TAG_member
    1013        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1014        .dwattr $C$DW$72, DW_AT_name("IEP_CLK_STOP_ACK")
    1015        .dwattr $C$DW$72, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1016        .dwattr $C$DW$72, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1017        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1019        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1020        .dwattr $C$DW$72, DW_AT_decl_line(0x7b)
    1021        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1022$C$DW$73        .dwtag  DW_TAG_member
    1023        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1024        .dwattr $C$DW$73, DW_AT_name("IEP_CLK_EN")
    1025        .dwattr $C$DW$73, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1026        .dwattr $C$DW$73, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1027        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1029        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1030        .dwattr $C$DW$73, DW_AT_decl_line(0x7c)
    1031        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1032$C$DW$74        .dwtag  DW_TAG_member
    1033        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1034        .dwattr $C$DW$74, DW_AT_name("rsvd18")
    1035        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd18")
    1036        .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1037        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1039        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1040        .dwattr $C$DW$74, DW_AT_decl_line(0x7d)
    1041        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1042        .dwendtag $C$DW$T$23
    1043
    1044        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1045        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   20

    1046        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1047$C$DW$T$45      .dwtag  DW_TAG_volatile_type
    1048        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
    1049
    1050$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1051        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1052$C$DW$75        .dwtag  DW_TAG_member
    1053        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1054        .dwattr $C$DW$75, DW_AT_name("PRU0_IMEM_PE_RAW")
    1055        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1056        .dwattr $C$DW$75, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1057        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1059        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1060        .dwattr $C$DW$75, DW_AT_decl_line(0x87)
    1061        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1062$C$DW$76        .dwtag  DW_TAG_member
    1063        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1064        .dwattr $C$DW$76, DW_AT_name("PRU0_DMEM_PE_RAW")
    1065        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1066        .dwattr $C$DW$76, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1067        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1069        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1070        .dwattr $C$DW$76, DW_AT_decl_line(0x88)
    1071        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1072$C$DW$77        .dwtag  DW_TAG_member
    1073        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1074        .dwattr $C$DW$77, DW_AT_name("PRU1_IMEM_PE_RAW")
    1075        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1076        .dwattr $C$DW$77, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1077        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1079        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1080        .dwattr $C$DW$77, DW_AT_decl_line(0x89)
    1081        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1082$C$DW$78        .dwtag  DW_TAG_member
    1083        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1084        .dwattr $C$DW$78, DW_AT_name("PRU1_DMEM_PE_RAW")
    1085        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1086        .dwattr $C$DW$78, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1087        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1089        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1090        .dwattr $C$DW$78, DW_AT_decl_line(0x8a)
    1091        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1092$C$DW$79        .dwtag  DW_TAG_member
    1093        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1094        .dwattr $C$DW$79, DW_AT_name("RAM_PE_RAW")
    1095        .dwattr $C$DW$79, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1096        .dwattr $C$DW$79, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1097        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1099        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1100        .dwattr $C$DW$79, DW_AT_decl_line(0x8b)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   21

    1101        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1102$C$DW$80        .dwtag  DW_TAG_member
    1103        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1104        .dwattr $C$DW$80, DW_AT_name("rsvd20")
    1105        .dwattr $C$DW$80, DW_AT_TI_symbol_name("rsvd20")
    1106        .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1107        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1109        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1110        .dwattr $C$DW$80, DW_AT_decl_line(0x8c)
    1111        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1112        .dwendtag $C$DW$T$24
    1113
    1114        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1115        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1116        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1117$C$DW$T$47      .dwtag  DW_TAG_volatile_type
    1118        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
    1119
    1120$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1121        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1122$C$DW$81        .dwtag  DW_TAG_member
    1123        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1124        .dwattr $C$DW$81, DW_AT_name("PRU0_IMEM_PE")
    1125        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1126        .dwattr $C$DW$81, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1127        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1129        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1130        .dwattr $C$DW$81, DW_AT_decl_line(0x96)
    1131        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1132$C$DW$82        .dwtag  DW_TAG_member
    1133        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1134        .dwattr $C$DW$82, DW_AT_name("PRU0_DMEM_PE")
    1135        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1136        .dwattr $C$DW$82, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1137        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1139        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1140        .dwattr $C$DW$82, DW_AT_decl_line(0x97)
    1141        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1142$C$DW$83        .dwtag  DW_TAG_member
    1143        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1144        .dwattr $C$DW$83, DW_AT_name("PRU1_IMEM_PE")
    1145        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1146        .dwattr $C$DW$83, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1147        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1149        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1150        .dwattr $C$DW$83, DW_AT_decl_line(0x98)
    1151        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1152$C$DW$84        .dwtag  DW_TAG_member
    1153        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1154        .dwattr $C$DW$84, DW_AT_name("PRU1_DMEM_PE")
    1155        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   22

    1156        .dwattr $C$DW$84, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1157        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1159        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1160        .dwattr $C$DW$84, DW_AT_decl_line(0x99)
    1161        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1162$C$DW$85        .dwtag  DW_TAG_member
    1163        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1164        .dwattr $C$DW$85, DW_AT_name("RAM_PE")
    1165        .dwattr $C$DW$85, DW_AT_TI_symbol_name("RAM_PE")
    1166        .dwattr $C$DW$85, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1167        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1169        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1170        .dwattr $C$DW$85, DW_AT_decl_line(0x9a)
    1171        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1172$C$DW$86        .dwtag  DW_TAG_member
    1173        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1174        .dwattr $C$DW$86, DW_AT_name("rsvd20")
    1175        .dwattr $C$DW$86, DW_AT_TI_symbol_name("rsvd20")
    1176        .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1177        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1179        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1180        .dwattr $C$DW$86, DW_AT_decl_line(0x9b)
    1181        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1182        .dwendtag $C$DW$T$25
    1183
    1184        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1185        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1186        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1187$C$DW$T$49      .dwtag  DW_TAG_volatile_type
    1188        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    1189
    1190$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1191        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1192$C$DW$87        .dwtag  DW_TAG_member
    1193        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1194        .dwattr $C$DW$87, DW_AT_name("PRU0_IMEM_PE_SET")
    1195        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1196        .dwattr $C$DW$87, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1197        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1199        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1200        .dwattr $C$DW$87, DW_AT_decl_line(0xa4)
    1201        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1202$C$DW$88        .dwtag  DW_TAG_member
    1203        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1204        .dwattr $C$DW$88, DW_AT_name("PRU0_DMEM_PE_SET")
    1205        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1206        .dwattr $C$DW$88, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1207        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1209        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1210        .dwattr $C$DW$88, DW_AT_decl_line(0xa5)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   23

    1211        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1212$C$DW$89        .dwtag  DW_TAG_member
    1213        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1214        .dwattr $C$DW$89, DW_AT_name("PRU1_IMEM_PE_SET")
    1215        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1216        .dwattr $C$DW$89, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1217        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1219        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1220        .dwattr $C$DW$89, DW_AT_decl_line(0xa6)
    1221        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1222$C$DW$90        .dwtag  DW_TAG_member
    1223        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1224        .dwattr $C$DW$90, DW_AT_name("PRU1_DMEM_PE_SET")
    1225        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1226        .dwattr $C$DW$90, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1227        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1229        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1230        .dwattr $C$DW$90, DW_AT_decl_line(0xa7)
    1231        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1232$C$DW$91        .dwtag  DW_TAG_member
    1233        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1234        .dwattr $C$DW$91, DW_AT_name("RAM_PE_SET")
    1235        .dwattr $C$DW$91, DW_AT_TI_symbol_name("RAM_PE_SET")
    1236        .dwattr $C$DW$91, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1237        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1239        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1240        .dwattr $C$DW$91, DW_AT_decl_line(0xa8)
    1241        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1242$C$DW$92        .dwtag  DW_TAG_member
    1243        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1244        .dwattr $C$DW$92, DW_AT_name("rsvd20")
    1245        .dwattr $C$DW$92, DW_AT_TI_symbol_name("rsvd20")
    1246        .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1247        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1249        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1250        .dwattr $C$DW$92, DW_AT_decl_line(0xa9)
    1251        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1252        .dwendtag $C$DW$T$26
    1253
    1254        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1255        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1256        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1257$C$DW$T$51      .dwtag  DW_TAG_volatile_type
    1258        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
    1259
    1260$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1261        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1262$C$DW$93        .dwtag  DW_TAG_member
    1263        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1264        .dwattr $C$DW$93, DW_AT_name("PRU0_IMEM_PE_CLR")
    1265        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   24

    1266        .dwattr $C$DW$93, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1267        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1269        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1270        .dwattr $C$DW$93, DW_AT_decl_line(0xb3)
    1271        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1272$C$DW$94        .dwtag  DW_TAG_member
    1273        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1274        .dwattr $C$DW$94, DW_AT_name("PRU0_DMEM_PE_CLR")
    1275        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1276        .dwattr $C$DW$94, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1277        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1279        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1280        .dwattr $C$DW$94, DW_AT_decl_line(0xb4)
    1281        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1282$C$DW$95        .dwtag  DW_TAG_member
    1283        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1284        .dwattr $C$DW$95, DW_AT_name("PRU1_IMEM_PE_CLR")
    1285        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1286        .dwattr $C$DW$95, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1287        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1289        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1290        .dwattr $C$DW$95, DW_AT_decl_line(0xb5)
    1291        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1292$C$DW$96        .dwtag  DW_TAG_member
    1293        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1294        .dwattr $C$DW$96, DW_AT_name("PRU1_DMEM_PE_CLR")
    1295        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1296        .dwattr $C$DW$96, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1297        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1299        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1300        .dwattr $C$DW$96, DW_AT_decl_line(0xb6)
    1301        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1302$C$DW$97        .dwtag  DW_TAG_member
    1303        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1304        .dwattr $C$DW$97, DW_AT_name("rsvd16")
    1305        .dwattr $C$DW$97, DW_AT_TI_symbol_name("rsvd16")
    1306        .dwattr $C$DW$97, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1307        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1309        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1310        .dwattr $C$DW$97, DW_AT_decl_line(0xb7)
    1311        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1312        .dwendtag $C$DW$T$27
    1313
    1314        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1315        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1316        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1317$C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1318        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
    1319
    1320$C$DW$T$28      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   25

    1321        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1322$C$DW$98        .dwtag  DW_TAG_member
    1323        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1324        .dwattr $C$DW$98, DW_AT_name("PMAO_PRU0")
    1325        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PMAO_PRU0")
    1326        .dwattr $C$DW$98, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1327        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1329        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1330        .dwattr $C$DW$98, DW_AT_decl_line(0xc4)
    1331        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1332$C$DW$99        .dwtag  DW_TAG_member
    1333        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1334        .dwattr $C$DW$99, DW_AT_name("PMAO_PRU1")
    1335        .dwattr $C$DW$99, DW_AT_TI_symbol_name("PMAO_PRU1")
    1336        .dwattr $C$DW$99, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1337        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1339        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1340        .dwattr $C$DW$99, DW_AT_decl_line(0xc5)
    1341        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1342$C$DW$100       .dwtag  DW_TAG_member
    1343        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1344        .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1345        .dwattr $C$DW$100, DW_AT_TI_symbol_name("rsvd2")
    1346        .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1347        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1349        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1350        .dwattr $C$DW$100, DW_AT_decl_line(0xc6)
    1351        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1352        .dwendtag $C$DW$T$28
    1353
    1354        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1355        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1356        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1357$C$DW$T$55      .dwtag  DW_TAG_volatile_type
    1358        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
    1359
    1360$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1361        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1362$C$DW$101       .dwtag  DW_TAG_member
    1363        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1364        .dwattr $C$DW$101, DW_AT_name("OCP_EN")
    1365        .dwattr $C$DW$101, DW_AT_TI_symbol_name("OCP_EN")
    1366        .dwattr $C$DW$101, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1367        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1369        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1370        .dwattr $C$DW$101, DW_AT_decl_line(0xd3)
    1371        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1372$C$DW$102       .dwtag  DW_TAG_member
    1373        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1374        .dwattr $C$DW$102, DW_AT_name("rsvd1")
    1375        .dwattr $C$DW$102, DW_AT_TI_symbol_name("rsvd1")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   26

    1376        .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1377        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1379        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1380        .dwattr $C$DW$102, DW_AT_decl_line(0xd4)
    1381        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1382        .dwendtag $C$DW$T$29
    1383
    1384        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1385        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1386        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1387$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1388        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
    1389
    1390$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1391        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1392$C$DW$103       .dwtag  DW_TAG_member
    1393        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1394        .dwattr $C$DW$103, DW_AT_name("PRU1_PAD_HP_EN")
    1395        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1396        .dwattr $C$DW$103, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1397        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1399        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1400        .dwattr $C$DW$103, DW_AT_decl_line(0xde)
    1401        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1402$C$DW$104       .dwtag  DW_TAG_member
    1403        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1404        .dwattr $C$DW$104, DW_AT_name("XFR_SHIFT_EN")
    1405        .dwattr $C$DW$104, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1406        .dwattr $C$DW$104, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1407        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1409        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1410        .dwattr $C$DW$104, DW_AT_decl_line(0xdf)
    1411        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1412$C$DW$105       .dwtag  DW_TAG_member
    1413        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1414        .dwattr $C$DW$105, DW_AT_name("rsvd2")
    1415        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd2")
    1416        .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1417        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1419        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1420        .dwattr $C$DW$105, DW_AT_decl_line(0xe0)
    1421        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1422        .dwendtag $C$DW$T$30
    1423
    1424        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1425        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1426        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1427$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1428        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1429
    1430$C$DW$T$31      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   27

    1431        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1432$C$DW$106       .dwtag  DW_TAG_member
    1433        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1434        .dwattr $C$DW$106, DW_AT_name("PIN_MUX_SEL")
    1435        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1436        .dwattr $C$DW$106, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1437        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1439        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1440        .dwattr $C$DW$106, DW_AT_decl_line(0xec)
    1441        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1442$C$DW$107       .dwtag  DW_TAG_member
    1443        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1444        .dwattr $C$DW$107, DW_AT_name("rsvd2")
    1445        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd2")
    1446        .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1447        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1449        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1450        .dwattr $C$DW$107, DW_AT_decl_line(0xed)
    1451        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1452        .dwendtag $C$DW$T$31
    1453
    1454        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1455        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1456        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1457$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1458        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1459
    1460$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1461        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1462$C$DW$108       .dwtag  DW_TAG_member
    1463        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$38)
    1464        .dwattr $C$DW$108, DW_AT_name("$P$T0")
    1465        .dwattr $C$DW$108, DW_AT_TI_symbol_name("$P$T0")
    1466        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1468        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1469        .dwattr $C$DW$108, DW_AT_decl_line(0x29)
    1470        .dwattr $C$DW$108, DW_AT_decl_column(0x02)
    1471$C$DW$109       .dwtag  DW_TAG_member
    1472        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$40)
    1473        .dwattr $C$DW$109, DW_AT_name("$P$T1")
    1474        .dwattr $C$DW$109, DW_AT_TI_symbol_name("$P$T1")
    1475        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1476        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1477        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1478        .dwattr $C$DW$109, DW_AT_decl_line(0x33)
    1479        .dwattr $C$DW$109, DW_AT_decl_column(0x02)
    1480$C$DW$110       .dwtag  DW_TAG_member
    1481        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$42)
    1482        .dwattr $C$DW$110, DW_AT_name("$P$T2")
    1483        .dwattr $C$DW$110, DW_AT_TI_symbol_name("$P$T2")
    1484        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1485        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   28

    1486        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1487        .dwattr $C$DW$110, DW_AT_decl_line(0x41)
    1488        .dwattr $C$DW$110, DW_AT_decl_column(0x02)
    1489$C$DW$111       .dwtag  DW_TAG_member
    1490        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$44)
    1491        .dwattr $C$DW$111, DW_AT_name("$P$T3")
    1492        .dwattr $C$DW$111, DW_AT_TI_symbol_name("$P$T3")
    1493        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1494        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1495        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1496        .dwattr $C$DW$111, DW_AT_decl_line(0x54)
    1497        .dwattr $C$DW$111, DW_AT_decl_column(0x02)
    1498$C$DW$112       .dwtag  DW_TAG_member
    1499        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$46)
    1500        .dwattr $C$DW$112, DW_AT_name("$P$T4")
    1501        .dwattr $C$DW$112, DW_AT_TI_symbol_name("$P$T4")
    1502        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1503        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1504        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1505        .dwattr $C$DW$112, DW_AT_decl_line(0x67)
    1506        .dwattr $C$DW$112, DW_AT_decl_column(0x02)
    1507$C$DW$113       .dwtag  DW_TAG_member
    1508        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$48)
    1509        .dwattr $C$DW$113, DW_AT_name("$P$T5")
    1510        .dwattr $C$DW$113, DW_AT_TI_symbol_name("$P$T5")
    1511        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1512        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1513        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1514        .dwattr $C$DW$113, DW_AT_decl_line(0x83)
    1515        .dwattr $C$DW$113, DW_AT_decl_column(0x02)
    1516$C$DW$114       .dwtag  DW_TAG_member
    1517        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$50)
    1518        .dwattr $C$DW$114, DW_AT_name("$P$T6")
    1519        .dwattr $C$DW$114, DW_AT_TI_symbol_name("$P$T6")
    1520        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1521        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1522        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1523        .dwattr $C$DW$114, DW_AT_decl_line(0x92)
    1524        .dwattr $C$DW$114, DW_AT_decl_column(0x02)
    1525$C$DW$115       .dwtag  DW_TAG_member
    1526        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$52)
    1527        .dwattr $C$DW$115, DW_AT_name("$P$T7")
    1528        .dwattr $C$DW$115, DW_AT_TI_symbol_name("$P$T7")
    1529        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1530        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1531        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1532        .dwattr $C$DW$115, DW_AT_decl_line(0xa0)
    1533        .dwattr $C$DW$115, DW_AT_decl_column(0x02)
    1534$C$DW$116       .dwtag  DW_TAG_member
    1535        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$54)
    1536        .dwattr $C$DW$116, DW_AT_name("$P$T8")
    1537        .dwattr $C$DW$116, DW_AT_TI_symbol_name("$P$T8")
    1538        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1539        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1540        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   29

    1541        .dwattr $C$DW$116, DW_AT_decl_line(0xaf)
    1542        .dwattr $C$DW$116, DW_AT_decl_column(0x02)
    1543$C$DW$117       .dwtag  DW_TAG_member
    1544        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$32)
    1545        .dwattr $C$DW$117, DW_AT_name("rsvd24")
    1546        .dwattr $C$DW$117, DW_AT_TI_symbol_name("rsvd24")
    1547        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1548        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1549        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1550        .dwattr $C$DW$117, DW_AT_decl_line(0xbc)
    1551        .dwattr $C$DW$117, DW_AT_decl_column(0x0b)
    1552$C$DW$118       .dwtag  DW_TAG_member
    1553        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$56)
    1554        .dwattr $C$DW$118, DW_AT_name("$P$T9")
    1555        .dwattr $C$DW$118, DW_AT_TI_symbol_name("$P$T9")
    1556        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1557        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1558        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1559        .dwattr $C$DW$118, DW_AT_decl_line(0xc0)
    1560        .dwattr $C$DW$118, DW_AT_decl_column(0x02)
    1561$C$DW$119       .dwtag  DW_TAG_member
    1562        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$33)
    1563        .dwattr $C$DW$119, DW_AT_name("rsvd2c")
    1564        .dwattr $C$DW$119, DW_AT_TI_symbol_name("rsvd2c")
    1565        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1566        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1567        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1568        .dwattr $C$DW$119, DW_AT_decl_line(0xcb)
    1569        .dwattr $C$DW$119, DW_AT_decl_column(0x0b)
    1570$C$DW$120       .dwtag  DW_TAG_member
    1571        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$58)
    1572        .dwattr $C$DW$120, DW_AT_name("$P$T10")
    1573        .dwattr $C$DW$120, DW_AT_TI_symbol_name("$P$T10")
    1574        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1575        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1576        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1577        .dwattr $C$DW$120, DW_AT_decl_line(0xcf)
    1578        .dwattr $C$DW$120, DW_AT_decl_column(0x02)
    1579$C$DW$121       .dwtag  DW_TAG_member
    1580        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$60)
    1581        .dwattr $C$DW$121, DW_AT_name("$P$T11")
    1582        .dwattr $C$DW$121, DW_AT_TI_symbol_name("$P$T11")
    1583        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1584        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1585        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1586        .dwattr $C$DW$121, DW_AT_decl_line(0xda)
    1587        .dwattr $C$DW$121, DW_AT_decl_column(0x02)
    1588$C$DW$122       .dwtag  DW_TAG_member
    1589        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$34)
    1590        .dwattr $C$DW$122, DW_AT_name("rsvd38")
    1591        .dwattr $C$DW$122, DW_AT_TI_symbol_name("rsvd38")
    1592        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1593        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1594        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1595        .dwattr $C$DW$122, DW_AT_decl_line(0xe5)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   30

    1596        .dwattr $C$DW$122, DW_AT_decl_column(0x0b)
    1597$C$DW$123       .dwtag  DW_TAG_member
    1598        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$62)
    1599        .dwattr $C$DW$123, DW_AT_name("$P$T12")
    1600        .dwattr $C$DW$123, DW_AT_TI_symbol_name("$P$T12")
    1601        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1602        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1603        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1604        .dwattr $C$DW$123, DW_AT_decl_line(0xe8)
    1605        .dwattr $C$DW$123, DW_AT_decl_column(0x02)
    1606        .dwendtag $C$DW$T$35
    1607
    1608        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1609        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1610        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1611$C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1612        .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$35)
    1613        .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1614        .dwattr $C$DW$T$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1615        .dwattr $C$DW$T$65, DW_AT_decl_line(0xf0)
    1616        .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    1617$C$DW$T$66      .dwtag  DW_TAG_volatile_type
    1618        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1619
    1620$C$DW$T$38      .dwtag  DW_TAG_union_type
    1621        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1622$C$DW$124       .dwtag  DW_TAG_member
    1623        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$36)
    1624        .dwattr $C$DW$124, DW_AT_name("REVID")
    1625        .dwattr $C$DW$124, DW_AT_TI_symbol_name("REVID")
    1626        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1628        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1629        .dwattr $C$DW$124, DW_AT_decl_line(0x2a)
    1630        .dwattr $C$DW$124, DW_AT_decl_column(0x15)
    1631$C$DW$125       .dwtag  DW_TAG_member
    1632        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$37)
    1633        .dwattr $C$DW$125, DW_AT_name("REVID_bit")
    1634        .dwattr $C$DW$125, DW_AT_TI_symbol_name("REVID_bit")
    1635        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1637        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1638        .dwattr $C$DW$125, DW_AT_decl_line(0x2e)
    1639        .dwattr $C$DW$125, DW_AT_decl_column(0x05)
    1640        .dwendtag $C$DW$T$38
    1641
    1642        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1643        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1644        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1645
    1646$C$DW$T$40      .dwtag  DW_TAG_union_type
    1647        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1648$C$DW$126       .dwtag  DW_TAG_member
    1649        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$36)
    1650        .dwattr $C$DW$126, DW_AT_name("SYSCFG")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   31

    1651        .dwattr $C$DW$126, DW_AT_TI_symbol_name("SYSCFG")
    1652        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1654        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1655        .dwattr $C$DW$126, DW_AT_decl_line(0x34)
    1656        .dwattr $C$DW$126, DW_AT_decl_column(0x15)
    1657$C$DW$127       .dwtag  DW_TAG_member
    1658        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$39)
    1659        .dwattr $C$DW$127, DW_AT_name("SYSCFG_bit")
    1660        .dwattr $C$DW$127, DW_AT_TI_symbol_name("SYSCFG_bit")
    1661        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1663        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1664        .dwattr $C$DW$127, DW_AT_decl_line(0x3c)
    1665        .dwattr $C$DW$127, DW_AT_decl_column(0x05)
    1666        .dwendtag $C$DW$T$40
    1667
    1668        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1669        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1670        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1671
    1672$C$DW$T$42      .dwtag  DW_TAG_union_type
    1673        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1674$C$DW$128       .dwtag  DW_TAG_member
    1675        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$36)
    1676        .dwattr $C$DW$128, DW_AT_name("GPCFG0")
    1677        .dwattr $C$DW$128, DW_AT_TI_symbol_name("GPCFG0")
    1678        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1680        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1681        .dwattr $C$DW$128, DW_AT_decl_line(0x42)
    1682        .dwattr $C$DW$128, DW_AT_decl_column(0x15)
    1683$C$DW$129       .dwtag  DW_TAG_member
    1684        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$41)
    1685        .dwattr $C$DW$129, DW_AT_name("GPCFG0_bit")
    1686        .dwattr $C$DW$129, DW_AT_TI_symbol_name("GPCFG0_bit")
    1687        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1689        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1690        .dwattr $C$DW$129, DW_AT_decl_line(0x4f)
    1691        .dwattr $C$DW$129, DW_AT_decl_column(0x05)
    1692        .dwendtag $C$DW$T$42
    1693
    1694        .dwattr $C$DW$T$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1695        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1696        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1697
    1698$C$DW$T$44      .dwtag  DW_TAG_union_type
    1699        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1700$C$DW$130       .dwtag  DW_TAG_member
    1701        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$36)
    1702        .dwattr $C$DW$130, DW_AT_name("GPCFG1")
    1703        .dwattr $C$DW$130, DW_AT_TI_symbol_name("GPCFG1")
    1704        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   32

    1706        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1707        .dwattr $C$DW$130, DW_AT_decl_line(0x55)
    1708        .dwattr $C$DW$130, DW_AT_decl_column(0x15)
    1709$C$DW$131       .dwtag  DW_TAG_member
    1710        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$43)
    1711        .dwattr $C$DW$131, DW_AT_name("GPCFG1_bit")
    1712        .dwattr $C$DW$131, DW_AT_TI_symbol_name("GPCFG1_bit")
    1713        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1715        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1716        .dwattr $C$DW$131, DW_AT_decl_line(0x62)
    1717        .dwattr $C$DW$131, DW_AT_decl_column(0x05)
    1718        .dwendtag $C$DW$T$44
    1719
    1720        .dwattr $C$DW$T$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1721        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1722        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1723
    1724$C$DW$T$46      .dwtag  DW_TAG_union_type
    1725        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1726$C$DW$132       .dwtag  DW_TAG_member
    1727        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$36)
    1728        .dwattr $C$DW$132, DW_AT_name("CGR")
    1729        .dwattr $C$DW$132, DW_AT_TI_symbol_name("CGR")
    1730        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1732        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1733        .dwattr $C$DW$132, DW_AT_decl_line(0x68)
    1734        .dwattr $C$DW$132, DW_AT_decl_column(0x15)
    1735$C$DW$133       .dwtag  DW_TAG_member
    1736        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$45)
    1737        .dwattr $C$DW$133, DW_AT_name("CGR_bit")
    1738        .dwattr $C$DW$133, DW_AT_TI_symbol_name("CGR_bit")
    1739        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1741        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1742        .dwattr $C$DW$133, DW_AT_decl_line(0x7e)
    1743        .dwattr $C$DW$133, DW_AT_decl_column(0x05)
    1744        .dwendtag $C$DW$T$46
    1745
    1746        .dwattr $C$DW$T$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1747        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1748        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1749
    1750$C$DW$T$48      .dwtag  DW_TAG_union_type
    1751        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1752$C$DW$134       .dwtag  DW_TAG_member
    1753        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$36)
    1754        .dwattr $C$DW$134, DW_AT_name("ISRP")
    1755        .dwattr $C$DW$134, DW_AT_TI_symbol_name("ISRP")
    1756        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1758        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1759        .dwattr $C$DW$134, DW_AT_decl_line(0x84)
    1760        .dwattr $C$DW$134, DW_AT_decl_column(0x15)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   33

    1761$C$DW$135       .dwtag  DW_TAG_member
    1762        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$47)
    1763        .dwattr $C$DW$135, DW_AT_name("ISRP_bit")
    1764        .dwattr $C$DW$135, DW_AT_TI_symbol_name("ISRP_bit")
    1765        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1766        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1767        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1768        .dwattr $C$DW$135, DW_AT_decl_line(0x8d)
    1769        .dwattr $C$DW$135, DW_AT_decl_column(0x05)
    1770        .dwendtag $C$DW$T$48
    1771
    1772        .dwattr $C$DW$T$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1773        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1774        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1775
    1776$C$DW$T$50      .dwtag  DW_TAG_union_type
    1777        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1778$C$DW$136       .dwtag  DW_TAG_member
    1779        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$36)
    1780        .dwattr $C$DW$136, DW_AT_name("ISP")
    1781        .dwattr $C$DW$136, DW_AT_TI_symbol_name("ISP")
    1782        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1784        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1785        .dwattr $C$DW$136, DW_AT_decl_line(0x93)
    1786        .dwattr $C$DW$136, DW_AT_decl_column(0x15)
    1787$C$DW$137       .dwtag  DW_TAG_member
    1788        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$49)
    1789        .dwattr $C$DW$137, DW_AT_name("ISP_bit")
    1790        .dwattr $C$DW$137, DW_AT_TI_symbol_name("ISP_bit")
    1791        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1793        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1794        .dwattr $C$DW$137, DW_AT_decl_line(0x9c)
    1795        .dwattr $C$DW$137, DW_AT_decl_column(0x05)
    1796        .dwendtag $C$DW$T$50
    1797
    1798        .dwattr $C$DW$T$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1799        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1800        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1801
    1802$C$DW$T$52      .dwtag  DW_TAG_union_type
    1803        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1804$C$DW$138       .dwtag  DW_TAG_member
    1805        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$36)
    1806        .dwattr $C$DW$138, DW_AT_name("IESP")
    1807        .dwattr $C$DW$138, DW_AT_TI_symbol_name("IESP")
    1808        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1809        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1810        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1811        .dwattr $C$DW$138, DW_AT_decl_line(0xa1)
    1812        .dwattr $C$DW$138, DW_AT_decl_column(0x15)
    1813$C$DW$139       .dwtag  DW_TAG_member
    1814        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$51)
    1815        .dwattr $C$DW$139, DW_AT_name("IESP_bit")
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   34

    1816        .dwattr $C$DW$139, DW_AT_TI_symbol_name("IESP_bit")
    1817        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1819        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1820        .dwattr $C$DW$139, DW_AT_decl_line(0xaa)
    1821        .dwattr $C$DW$139, DW_AT_decl_column(0x05)
    1822        .dwendtag $C$DW$T$52
    1823
    1824        .dwattr $C$DW$T$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1825        .dwattr $C$DW$T$52, DW_AT_decl_line(0xa0)
    1826        .dwattr $C$DW$T$52, DW_AT_decl_column(0x08)
    1827
    1828$C$DW$T$54      .dwtag  DW_TAG_union_type
    1829        .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    1830$C$DW$140       .dwtag  DW_TAG_member
    1831        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$36)
    1832        .dwattr $C$DW$140, DW_AT_name("IECP")
    1833        .dwattr $C$DW$140, DW_AT_TI_symbol_name("IECP")
    1834        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1836        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1837        .dwattr $C$DW$140, DW_AT_decl_line(0xb0)
    1838        .dwattr $C$DW$140, DW_AT_decl_column(0x15)
    1839$C$DW$141       .dwtag  DW_TAG_member
    1840        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$53)
    1841        .dwattr $C$DW$141, DW_AT_name("IECP_bit")
    1842        .dwattr $C$DW$141, DW_AT_TI_symbol_name("IECP_bit")
    1843        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1845        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1846        .dwattr $C$DW$141, DW_AT_decl_line(0xb8)
    1847        .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    1848        .dwendtag $C$DW$T$54
    1849
    1850        .dwattr $C$DW$T$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1851        .dwattr $C$DW$T$54, DW_AT_decl_line(0xaf)
    1852        .dwattr $C$DW$T$54, DW_AT_decl_column(0x08)
    1853
    1854$C$DW$T$56      .dwtag  DW_TAG_union_type
    1855        .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    1856$C$DW$142       .dwtag  DW_TAG_member
    1857        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$36)
    1858        .dwattr $C$DW$142, DW_AT_name("PMAO")
    1859        .dwattr $C$DW$142, DW_AT_TI_symbol_name("PMAO")
    1860        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1862        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1863        .dwattr $C$DW$142, DW_AT_decl_line(0xc1)
    1864        .dwattr $C$DW$142, DW_AT_decl_column(0x15)
    1865$C$DW$143       .dwtag  DW_TAG_member
    1866        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$55)
    1867        .dwattr $C$DW$143, DW_AT_name("PMAO_bit")
    1868        .dwattr $C$DW$143, DW_AT_TI_symbol_name("PMAO_bit")
    1869        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Thu Apr 12 07:14:39 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   35

    1871        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1872        .dwattr $C$DW$143, DW_AT_decl_line(0xc7)
    1873        .dwattr $C$DW$143, DW_AT_decl_column(0x05)
    1874        .dwendtag $C$DW$T$56
    1875
    1876        .dwattr $C$DW$T$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1877        .dwattr $C$DW$T$56, DW_AT_decl_line(0xc0)
    1878        .dwattr $C$DW$T$56, DW_AT_decl_column(0x08)
    1879
    1880$C$DW$T$58      .dwtag  DW_TAG_union_type
    1881        .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    1882$C$DW$144       .dwtag  DW_TAG_member
    1883        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$36)
    1884        .dwattr $C$DW$144, DW_AT_name("IEPCLK")
    1885        .dwattr $C$DW$144, DW_AT_TI_symbol_name("IEPCLK")
