PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Fri Apr 13 22:36:01 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14
      15$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__delay_cycles")
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external
      19$C$DW$2 .dwtag  DW_TAG_formal_parameter
      20        .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$11)
      21        .dwendtag $C$DW$1

     951; 231 | // payload[4] = '\n';                                                  
     952; 232 | // payload[5] = 0;                                                     
     953; 233 | //len = 6;                                                             
     954; 234 | // pru_rpmsg_send(&transport, dst, src, payload, len);                 
     955; 237 | // }                                                                   
     956; 238 | // /*                                                                  
     957; 239 | // payload[0] = 'H';                                                   
     958; 240 | // payload[1] = 'I';                                                   
     959; 241 | // payload[2] = '\n';                                                  
     960; 242 | // payload[3] = 0;                                                     
     961; 243 | // len = 4;                                                            
     962; 249 | // */                                                                  
     963; 250 | //      __delay_cycles(200000000);                                     
     964;----------------------------------------------------------------------
     965 00000120 000000F1020280          LBBO      &r0.w0, r2, 2, 2      ; [ALU_PRU] |222| dst
     966 00000124 000000108080EF          MOV       r15, r0.w0            ; [ALU_PRU] |222| 
     967 00000128 000000F1000280          LBBO      &r0.w0, r2, 0, 2      ; [ALU_PRU] |222| src
     968 0000012c 000000108080F0          MOV       r16, r0.w0            ; [ALU_PRU] |222| 
     969$C$DW$54        .dwtag  DW_TAG_TI_branch
     970        .dwattr $C$DW$54, DW_AT_low_pc(0x00)
     971        .dwattr $C$DW$54, DW_AT_name("pru_rpmsg_send")
     972        .dwattr $C$DW$54, DW_AT_TI_call
     973 00000130 000000230000C3!         JAL       r3.w2, ||pru_rpmsg_send|| ; [ALU_PRU] |222| pru_rpmsg_send
     974;* --------------------------------------------------------------------------*
     975 00000134                 ||$C$L20||:    
     976        .dwpsn  file "main1.c",line 252,column 3,is_stmt,isa 0
     977;----------------------------------------------------------------------
     978; 252 | __delay_cycles(2000000);                                               
     979;----------------------------------------------------------------------
     980        .newblock
     981 00000134 423F8024000FC0          LDI32    r0, 999999
     982 0000013c 0000000501E0E0  $1:     SUB      r0, r0, 1
     983 00000140 0000006F00E0FF          QBNE     $1, r0, 0             ; [ALU_PRU] |252| 
     984        .dwpsn  file "main1.c",line 253,column 3,is_stmt,isa 0
     985;----------------------------------------------------------------------
     986; 253 | count++;                                                               
     987;----------------------------------------------------------------------
     988 00000144 0000000101E4E4          ADD       r4, r4, 0x01          ; [ALU_PRU] |253| count,count
     989        .dwpsn  file "main1.c",line 193,column 9,is_stmt,isa 0
     990 00000148 00000021000000!         JMP       ||$C$L15||            ; [ALU_PRU] |193| 
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   19

     991;* --------------------------------------------------------------------------*
     992        .dwattr $C$DW$43, DW_AT_TI_end_file("main1.c")
     993        .dwattr $C$DW$43, DW_AT_TI_end_line(0xff)
     994        .dwattr $C$DW$43, DW_AT_TI_end_column(0x01)
     995        .dwendentry
     996        .dwendtag $C$DW$43
     997
     998;******************************************************************************
     999;* STRINGS                                                                    *
    1000;******************************************************************************
    1001 00000000                         .sect   ".rodata:.string"
    1002 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
    1003 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000031 
         00000014 00000000000000 
    1004;*****************************************************************************
    1005;* UNDEFINED EXTERNAL REFERENCES                                             *
    1006;*****************************************************************************
    1007        .global ||pru_rpmsg_init||
    1008        .global ||pru_rpmsg_receive||
    1009        .global ||pru_rpmsg_send||
    1010        .global ||pru_rpmsg_channel||
    1011
    1012;******************************************************************************
    1013;* TYPE INFORMATION                                                           *
    1014;******************************************************************************
    1015
    1016$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1017        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1018$C$DW$55        .dwtag  DW_TAG_member
    1019        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
    1020        .dwattr $C$DW$55, DW_AT_name("REVID")
    1021        .dwattr $C$DW$55, DW_AT_TI_symbol_name("REVID")
    1022        .dwattr $C$DW$55, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1023        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1025        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1026        .dwattr $C$DW$55, DW_AT_decl_line(0x2d)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   20

    1027        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1028        .dwendtag $C$DW$T$19
    1029
    1030        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1031        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1032        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1033$C$DW$T$108     .dwtag  DW_TAG_volatile_type
    1034        .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$19)
    1035
    1036$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1037        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1038$C$DW$56        .dwtag  DW_TAG_member
    1039        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
    1040        .dwattr $C$DW$56, DW_AT_name("IDLE_MODE")
    1041        .dwattr $C$DW$56, DW_AT_TI_symbol_name("IDLE_MODE")
    1042        .dwattr $C$DW$56, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1043        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1045        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1046        .dwattr $C$DW$56, DW_AT_decl_line(0x37)
    1047        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1048$C$DW$57        .dwtag  DW_TAG_member
    1049        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
    1050        .dwattr $C$DW$57, DW_AT_name("STANDBY_MODE")
    1051        .dwattr $C$DW$57, DW_AT_TI_symbol_name("STANDBY_MODE")
    1052        .dwattr $C$DW$57, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1053        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1055        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1056        .dwattr $C$DW$57, DW_AT_decl_line(0x38)
    1057        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1058$C$DW$58        .dwtag  DW_TAG_member
    1059        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1060        .dwattr $C$DW$58, DW_AT_name("STANDBY_INIT")
    1061        .dwattr $C$DW$58, DW_AT_TI_symbol_name("STANDBY_INIT")
    1062        .dwattr $C$DW$58, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1063        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1065        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1066        .dwattr $C$DW$58, DW_AT_decl_line(0x39)
    1067        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1068$C$DW$59        .dwtag  DW_TAG_member
    1069        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1070        .dwattr $C$DW$59, DW_AT_name("SUB_MWAIT")
    1071        .dwattr $C$DW$59, DW_AT_TI_symbol_name("SUB_MWAIT")
    1072        .dwattr $C$DW$59, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1073        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1075        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1076        .dwattr $C$DW$59, DW_AT_decl_line(0x3a)
    1077        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1078$C$DW$60        .dwtag  DW_TAG_member
    1079        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1080        .dwattr $C$DW$60, DW_AT_name("rsvd6")
    1081        .dwattr $C$DW$60, DW_AT_TI_symbol_name("rsvd6")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   21

    1082        .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1083        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1085        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1086        .dwattr $C$DW$60, DW_AT_decl_line(0x3b)
    1087        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1088        .dwendtag $C$DW$T$20
    1089
    1090        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1091        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1092        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1093$C$DW$T$110     .dwtag  DW_TAG_volatile_type
    1094        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$20)
    1095
    1096$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1097        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1098$C$DW$61        .dwtag  DW_TAG_member
    1099        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1100        .dwattr $C$DW$61, DW_AT_name("PRU0_GPI_MODE")
    1101        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1102        .dwattr $C$DW$61, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1103        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1105        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1106        .dwattr $C$DW$61, DW_AT_decl_line(0x45)
    1107        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1108$C$DW$62        .dwtag  DW_TAG_member
    1109        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1110        .dwattr $C$DW$62, DW_AT_name("PRU0_GPI_CLK_MODE")
    1111        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1112        .dwattr $C$DW$62, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1113        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1114        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1115        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1116        .dwattr $C$DW$62, DW_AT_decl_line(0x46)
    1117        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1118$C$DW$63        .dwtag  DW_TAG_member
    1119        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1120        .dwattr $C$DW$63, DW_AT_name("PRU0_GPI_DIV0")
    1121        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1122        .dwattr $C$DW$63, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1123        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1125        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1126        .dwattr $C$DW$63, DW_AT_decl_line(0x47)
    1127        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1128$C$DW$64        .dwtag  DW_TAG_member
    1129        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1130        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_DIV1")
    1131        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1132        .dwattr $C$DW$64, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1133        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1135        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1136        .dwattr $C$DW$64, DW_AT_decl_line(0x48)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   22

    1137        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1138$C$DW$65        .dwtag  DW_TAG_member
    1139        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1140        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_SB")
    1141        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1142        .dwattr $C$DW$65, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1143        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1145        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1146        .dwattr $C$DW$65, DW_AT_decl_line(0x49)
    1147        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1148$C$DW$66        .dwtag  DW_TAG_member
    1149        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1150        .dwattr $C$DW$66, DW_AT_name("PRU0_GPO_MODE")
    1151        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1152        .dwattr $C$DW$66, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1153        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1155        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1156        .dwattr $C$DW$66, DW_AT_decl_line(0x4a)
    1157        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1158$C$DW$67        .dwtag  DW_TAG_member
    1159        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1160        .dwattr $C$DW$67, DW_AT_name("PRU0_GPO_DIV0")
    1161        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1162        .dwattr $C$DW$67, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1163        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1165        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1166        .dwattr $C$DW$67, DW_AT_decl_line(0x4b)
    1167        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1168$C$DW$68        .dwtag  DW_TAG_member
    1169        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1170        .dwattr $C$DW$68, DW_AT_name("PRU0_GPO_DIV1")
    1171        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1172        .dwattr $C$DW$68, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1173        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1175        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1176        .dwattr $C$DW$68, DW_AT_decl_line(0x4c)
    1177        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1178$C$DW$69        .dwtag  DW_TAG_member
    1179        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1180        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_SH_SEL")
    1181        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1182        .dwattr $C$DW$69, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1183        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1184        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1185        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1186        .dwattr $C$DW$69, DW_AT_decl_line(0x4d)
    1187        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1188$C$DW$70        .dwtag  DW_TAG_member
    1189        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1190        .dwattr $C$DW$70, DW_AT_name("rsvd26")
    1191        .dwattr $C$DW$70, DW_AT_TI_symbol_name("rsvd26")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   23

    1192        .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1193        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1195        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1196        .dwattr $C$DW$70, DW_AT_decl_line(0x4e)
    1197        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1198        .dwendtag $C$DW$T$21
    1199
    1200        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1201        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1202        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1203$C$DW$T$112     .dwtag  DW_TAG_volatile_type
    1204        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$21)
    1205
    1206$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1207        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1208$C$DW$71        .dwtag  DW_TAG_member
    1209        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1210        .dwattr $C$DW$71, DW_AT_name("PRU1_GPI_MODE")
    1211        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1212        .dwattr $C$DW$71, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1213        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1215        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1216        .dwattr $C$DW$71, DW_AT_decl_line(0x58)
    1217        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1218$C$DW$72        .dwtag  DW_TAG_member
    1219        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1220        .dwattr $C$DW$72, DW_AT_name("PRU1_GPI_CLK_MODE")
    1221        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1222        .dwattr $C$DW$72, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1223        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1224        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1225        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1226        .dwattr $C$DW$72, DW_AT_decl_line(0x59)
    1227        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1228$C$DW$73        .dwtag  DW_TAG_member
    1229        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1230        .dwattr $C$DW$73, DW_AT_name("PRU1_GPI_DIV0")
    1231        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1232        .dwattr $C$DW$73, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1233        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1235        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1236        .dwattr $C$DW$73, DW_AT_decl_line(0x5a)
    1237        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1238$C$DW$74        .dwtag  DW_TAG_member
    1239        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1240        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_DIV1")
    1241        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1242        .dwattr $C$DW$74, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1243        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1245        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1246        .dwattr $C$DW$74, DW_AT_decl_line(0x5b)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   24

    1247        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1248$C$DW$75        .dwtag  DW_TAG_member
    1249        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1250        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_SB")
    1251        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1252        .dwattr $C$DW$75, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1253        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1255        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1256        .dwattr $C$DW$75, DW_AT_decl_line(0x5c)
    1257        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1258$C$DW$76        .dwtag  DW_TAG_member
    1259        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1260        .dwattr $C$DW$76, DW_AT_name("PRU1_GPO_MODE")
    1261        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1262        .dwattr $C$DW$76, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1263        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1265        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1266        .dwattr $C$DW$76, DW_AT_decl_line(0x5d)
    1267        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1268$C$DW$77        .dwtag  DW_TAG_member
    1269        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1270        .dwattr $C$DW$77, DW_AT_name("PRU1_GPO_DIV0")
    1271        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1272        .dwattr $C$DW$77, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1273        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1275        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1276        .dwattr $C$DW$77, DW_AT_decl_line(0x5e)
    1277        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1278$C$DW$78        .dwtag  DW_TAG_member
    1279        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1280        .dwattr $C$DW$78, DW_AT_name("PRU1_GPO_DIV1")
    1281        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1282        .dwattr $C$DW$78, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1283        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1285        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1286        .dwattr $C$DW$78, DW_AT_decl_line(0x5f)
    1287        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1288$C$DW$79        .dwtag  DW_TAG_member
    1289        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1290        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_SH_SEL")
    1291        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1292        .dwattr $C$DW$79, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1293        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1295        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1296        .dwattr $C$DW$79, DW_AT_decl_line(0x60)
    1297        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1298$C$DW$80        .dwtag  DW_TAG_member
    1299        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1300        .dwattr $C$DW$80, DW_AT_name("rsvd26")
    1301        .dwattr $C$DW$80, DW_AT_TI_symbol_name("rsvd26")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   25

    1302        .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1303        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1305        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1306        .dwattr $C$DW$80, DW_AT_decl_line(0x61)
    1307        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1308        .dwendtag $C$DW$T$22
    1309
    1310        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1311        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1312        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1313$C$DW$T$114     .dwtag  DW_TAG_volatile_type
    1314        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$22)
    1315
    1316$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1317        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1318$C$DW$81        .dwtag  DW_TAG_member
    1319        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1320        .dwattr $C$DW$81, DW_AT_name("PRU0_CLK_STOP_REQ")
    1321        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1322        .dwattr $C$DW$81, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1323        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1325        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1326        .dwattr $C$DW$81, DW_AT_decl_line(0x6b)
    1327        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1328$C$DW$82        .dwtag  DW_TAG_member
    1329        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1330        .dwattr $C$DW$82, DW_AT_name("PRU0_CLK_STOP_ACK")
    1331        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1332        .dwattr $C$DW$82, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1333        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1335        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1336        .dwattr $C$DW$82, DW_AT_decl_line(0x6c)
    1337        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1338$C$DW$83        .dwtag  DW_TAG_member
    1339        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1340        .dwattr $C$DW$83, DW_AT_name("PRU0_CLK_EN")
    1341        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1342        .dwattr $C$DW$83, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1343        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1345        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1346        .dwattr $C$DW$83, DW_AT_decl_line(0x6d)
    1347        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1348$C$DW$84        .dwtag  DW_TAG_member
    1349        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1350        .dwattr $C$DW$84, DW_AT_name("PRU1_CLK_STOP_REQ")
    1351        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1352        .dwattr $C$DW$84, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1353        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1355        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1356        .dwattr $C$DW$84, DW_AT_decl_line(0x6e)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   26

    1357        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1358$C$DW$85        .dwtag  DW_TAG_member
    1359        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1360        .dwattr $C$DW$85, DW_AT_name("PRU1_CLK_STOP_ACK")
    1361        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1362        .dwattr $C$DW$85, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1363        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1365        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1366        .dwattr $C$DW$85, DW_AT_decl_line(0x6f)
    1367        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1368$C$DW$86        .dwtag  DW_TAG_member
    1369        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1370        .dwattr $C$DW$86, DW_AT_name("PRU1_CLK_EN")
    1371        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1372        .dwattr $C$DW$86, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1373        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1375        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1376        .dwattr $C$DW$86, DW_AT_decl_line(0x70)
    1377        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1378$C$DW$87        .dwtag  DW_TAG_member
    1379        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1380        .dwattr $C$DW$87, DW_AT_name("INTC_CLK_STOP_REQ")
    1381        .dwattr $C$DW$87, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1382        .dwattr $C$DW$87, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1383        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1385        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1386        .dwattr $C$DW$87, DW_AT_decl_line(0x71)
    1387        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1388$C$DW$88        .dwtag  DW_TAG_member
    1389        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1390        .dwattr $C$DW$88, DW_AT_name("INTC_CLK_STOP_ACK")
    1391        .dwattr $C$DW$88, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1392        .dwattr $C$DW$88, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1393        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1395        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1396        .dwattr $C$DW$88, DW_AT_decl_line(0x72)
    1397        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1398$C$DW$89        .dwtag  DW_TAG_member
    1399        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1400        .dwattr $C$DW$89, DW_AT_name("INTC_CLK_EN")
    1401        .dwattr $C$DW$89, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1402        .dwattr $C$DW$89, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1403        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1405        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1406        .dwattr $C$DW$89, DW_AT_decl_line(0x73)
    1407        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1408$C$DW$90        .dwtag  DW_TAG_member
    1409        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1410        .dwattr $C$DW$90, DW_AT_name("UART_CLK_STOP_REQ")
    1411        .dwattr $C$DW$90, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   27

    1412        .dwattr $C$DW$90, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1413        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1415        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1416        .dwattr $C$DW$90, DW_AT_decl_line(0x74)
    1417        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1418$C$DW$91        .dwtag  DW_TAG_member
    1419        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1420        .dwattr $C$DW$91, DW_AT_name("UART_CLK_STOP_ACK")
    1421        .dwattr $C$DW$91, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1422        .dwattr $C$DW$91, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1423        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1425        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1426        .dwattr $C$DW$91, DW_AT_decl_line(0x75)
    1427        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1428$C$DW$92        .dwtag  DW_TAG_member
    1429        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1430        .dwattr $C$DW$92, DW_AT_name("UART_CLK_EN")
    1431        .dwattr $C$DW$92, DW_AT_TI_symbol_name("UART_CLK_EN")
    1432        .dwattr $C$DW$92, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1433        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1435        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1436        .dwattr $C$DW$92, DW_AT_decl_line(0x76)
    1437        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1438$C$DW$93        .dwtag  DW_TAG_member
    1439        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1440        .dwattr $C$DW$93, DW_AT_name("ECAP_CLK_STOP_REQ")
    1441        .dwattr $C$DW$93, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1442        .dwattr $C$DW$93, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1443        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1445        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1446        .dwattr $C$DW$93, DW_AT_decl_line(0x77)
    1447        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1448$C$DW$94        .dwtag  DW_TAG_member
    1449        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1450        .dwattr $C$DW$94, DW_AT_name("ECAP_CLK_STOP_ACK")
    1451        .dwattr $C$DW$94, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1452        .dwattr $C$DW$94, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1453        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1455        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1456        .dwattr $C$DW$94, DW_AT_decl_line(0x78)
    1457        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1458$C$DW$95        .dwtag  DW_TAG_member
    1459        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1460        .dwattr $C$DW$95, DW_AT_name("ECAP_CLK_EN")
    1461        .dwattr $C$DW$95, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1462        .dwattr $C$DW$95, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1463        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1465        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1466        .dwattr $C$DW$95, DW_AT_decl_line(0x79)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   28

    1467        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1468$C$DW$96        .dwtag  DW_TAG_member
    1469        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1470        .dwattr $C$DW$96, DW_AT_name("IEP_CLK_STOP_REQ")
    1471        .dwattr $C$DW$96, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1472        .dwattr $C$DW$96, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1473        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1475        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1476        .dwattr $C$DW$96, DW_AT_decl_line(0x7a)
    1477        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1478$C$DW$97        .dwtag  DW_TAG_member
    1479        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1480        .dwattr $C$DW$97, DW_AT_name("IEP_CLK_STOP_ACK")
    1481        .dwattr $C$DW$97, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1482        .dwattr $C$DW$97, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1483        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1485        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1486        .dwattr $C$DW$97, DW_AT_decl_line(0x7b)
    1487        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1488$C$DW$98        .dwtag  DW_TAG_member
    1489        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1490        .dwattr $C$DW$98, DW_AT_name("IEP_CLK_EN")
    1491        .dwattr $C$DW$98, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1492        .dwattr $C$DW$98, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1493        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1495        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1496        .dwattr $C$DW$98, DW_AT_decl_line(0x7c)
    1497        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1498$C$DW$99        .dwtag  DW_TAG_member
    1499        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1500        .dwattr $C$DW$99, DW_AT_name("rsvd18")
    1501        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd18")
    1502        .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1503        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1505        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1506        .dwattr $C$DW$99, DW_AT_decl_line(0x7d)
    1507        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1508        .dwendtag $C$DW$T$23
    1509
    1510        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1511        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1512        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1513$C$DW$T$116     .dwtag  DW_TAG_volatile_type
    1514        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
    1515
    1516$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1517        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1518$C$DW$100       .dwtag  DW_TAG_member
    1519        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1520        .dwattr $C$DW$100, DW_AT_name("PRU0_IMEM_PE_RAW")
    1521        .dwattr $C$DW$100, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   29

    1522        .dwattr $C$DW$100, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1523        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1525        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1526        .dwattr $C$DW$100, DW_AT_decl_line(0x87)
    1527        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1528$C$DW$101       .dwtag  DW_TAG_member
    1529        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1530        .dwattr $C$DW$101, DW_AT_name("PRU0_DMEM_PE_RAW")
    1531        .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1532        .dwattr $C$DW$101, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1533        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1535        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1536        .dwattr $C$DW$101, DW_AT_decl_line(0x88)
    1537        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1538$C$DW$102       .dwtag  DW_TAG_member
    1539        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1540        .dwattr $C$DW$102, DW_AT_name("PRU1_IMEM_PE_RAW")
    1541        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1542        .dwattr $C$DW$102, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1543        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1545        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1546        .dwattr $C$DW$102, DW_AT_decl_line(0x89)
    1547        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1548$C$DW$103       .dwtag  DW_TAG_member
    1549        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1550        .dwattr $C$DW$103, DW_AT_name("PRU1_DMEM_PE_RAW")
    1551        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1552        .dwattr $C$DW$103, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1553        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1555        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1556        .dwattr $C$DW$103, DW_AT_decl_line(0x8a)
    1557        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1558$C$DW$104       .dwtag  DW_TAG_member
    1559        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1560        .dwattr $C$DW$104, DW_AT_name("RAM_PE_RAW")
    1561        .dwattr $C$DW$104, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1562        .dwattr $C$DW$104, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1563        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1564        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1565        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1566        .dwattr $C$DW$104, DW_AT_decl_line(0x8b)
    1567        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1568$C$DW$105       .dwtag  DW_TAG_member
    1569        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1570        .dwattr $C$DW$105, DW_AT_name("rsvd20")
    1571        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd20")
    1572        .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1573        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1575        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1576        .dwattr $C$DW$105, DW_AT_decl_line(0x8c)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   30

    1577        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1578        .dwendtag $C$DW$T$24
    1579
    1580        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1581        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1582        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1583$C$DW$T$118     .dwtag  DW_TAG_volatile_type
    1584        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$24)
    1585
    1586$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1587        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1588$C$DW$106       .dwtag  DW_TAG_member
    1589        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1590        .dwattr $C$DW$106, DW_AT_name("PRU0_IMEM_PE")
    1591        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1592        .dwattr $C$DW$106, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1593        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1595        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1596        .dwattr $C$DW$106, DW_AT_decl_line(0x96)
    1597        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1598$C$DW$107       .dwtag  DW_TAG_member
    1599        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1600        .dwattr $C$DW$107, DW_AT_name("PRU0_DMEM_PE")
    1601        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1602        .dwattr $C$DW$107, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1603        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1605        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1606        .dwattr $C$DW$107, DW_AT_decl_line(0x97)
    1607        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1608$C$DW$108       .dwtag  DW_TAG_member
    1609        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1610        .dwattr $C$DW$108, DW_AT_name("PRU1_IMEM_PE")
    1611        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1612        .dwattr $C$DW$108, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1613        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1615        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1616        .dwattr $C$DW$108, DW_AT_decl_line(0x98)
    1617        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1618$C$DW$109       .dwtag  DW_TAG_member
    1619        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1620        .dwattr $C$DW$109, DW_AT_name("PRU1_DMEM_PE")
    1621        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1622        .dwattr $C$DW$109, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1623        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1625        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1626        .dwattr $C$DW$109, DW_AT_decl_line(0x99)
    1627        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1628$C$DW$110       .dwtag  DW_TAG_member
    1629        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1630        .dwattr $C$DW$110, DW_AT_name("RAM_PE")
    1631        .dwattr $C$DW$110, DW_AT_TI_symbol_name("RAM_PE")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   31

    1632        .dwattr $C$DW$110, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1633        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1635        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1636        .dwattr $C$DW$110, DW_AT_decl_line(0x9a)
    1637        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1638$C$DW$111       .dwtag  DW_TAG_member
    1639        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1640        .dwattr $C$DW$111, DW_AT_name("rsvd20")
    1641        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd20")
    1642        .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1643        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1644        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1645        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1646        .dwattr $C$DW$111, DW_AT_decl_line(0x9b)
    1647        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1648        .dwendtag $C$DW$T$25
    1649
    1650        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1651        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1652        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1653$C$DW$T$120     .dwtag  DW_TAG_volatile_type
    1654        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    1655
    1656$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1657        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1658$C$DW$112       .dwtag  DW_TAG_member
    1659        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1660        .dwattr $C$DW$112, DW_AT_name("PRU0_IMEM_PE_SET")
    1661        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1662        .dwattr $C$DW$112, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1663        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1665        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1666        .dwattr $C$DW$112, DW_AT_decl_line(0xa4)
    1667        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1668$C$DW$113       .dwtag  DW_TAG_member
    1669        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1670        .dwattr $C$DW$113, DW_AT_name("PRU0_DMEM_PE_SET")
    1671        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1672        .dwattr $C$DW$113, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1673        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1675        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1676        .dwattr $C$DW$113, DW_AT_decl_line(0xa5)
    1677        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1678$C$DW$114       .dwtag  DW_TAG_member
    1679        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1680        .dwattr $C$DW$114, DW_AT_name("PRU1_IMEM_PE_SET")
    1681        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1682        .dwattr $C$DW$114, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1683        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1685        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1686        .dwattr $C$DW$114, DW_AT_decl_line(0xa6)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   32

    1687        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1688$C$DW$115       .dwtag  DW_TAG_member
    1689        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1690        .dwattr $C$DW$115, DW_AT_name("PRU1_DMEM_PE_SET")
    1691        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1692        .dwattr $C$DW$115, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1693        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1695        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1696        .dwattr $C$DW$115, DW_AT_decl_line(0xa7)
    1697        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1698$C$DW$116       .dwtag  DW_TAG_member
    1699        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1700        .dwattr $C$DW$116, DW_AT_name("RAM_PE_SET")
    1701        .dwattr $C$DW$116, DW_AT_TI_symbol_name("RAM_PE_SET")
    1702        .dwattr $C$DW$116, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1703        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1705        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1706        .dwattr $C$DW$116, DW_AT_decl_line(0xa8)
    1707        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1708$C$DW$117       .dwtag  DW_TAG_member
    1709        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1710        .dwattr $C$DW$117, DW_AT_name("rsvd20")
    1711        .dwattr $C$DW$117, DW_AT_TI_symbol_name("rsvd20")
    1712        .dwattr $C$DW$117, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1713        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1715        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1716        .dwattr $C$DW$117, DW_AT_decl_line(0xa9)
    1717        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1718        .dwendtag $C$DW$T$26
    1719
    1720        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1721        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1722        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1723$C$DW$T$122     .dwtag  DW_TAG_volatile_type
    1724        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$26)
    1725
    1726$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1727        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1728$C$DW$118       .dwtag  DW_TAG_member
    1729        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1730        .dwattr $C$DW$118, DW_AT_name("PRU0_IMEM_PE_CLR")
    1731        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1732        .dwattr $C$DW$118, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1733        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1734        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1735        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1736        .dwattr $C$DW$118, DW_AT_decl_line(0xb3)
    1737        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1738$C$DW$119       .dwtag  DW_TAG_member
    1739        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1740        .dwattr $C$DW$119, DW_AT_name("PRU0_DMEM_PE_CLR")
    1741        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   33

    1742        .dwattr $C$DW$119, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1743        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1745        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1746        .dwattr $C$DW$119, DW_AT_decl_line(0xb4)
    1747        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1748$C$DW$120       .dwtag  DW_TAG_member
    1749        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1750        .dwattr $C$DW$120, DW_AT_name("PRU1_IMEM_PE_CLR")
    1751        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1752        .dwattr $C$DW$120, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1753        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1754        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1755        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1756        .dwattr $C$DW$120, DW_AT_decl_line(0xb5)
    1757        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1758$C$DW$121       .dwtag  DW_TAG_member
    1759        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1760        .dwattr $C$DW$121, DW_AT_name("PRU1_DMEM_PE_CLR")
    1761        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1762        .dwattr $C$DW$121, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1763        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1765        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1766        .dwattr $C$DW$121, DW_AT_decl_line(0xb6)
    1767        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1768$C$DW$122       .dwtag  DW_TAG_member
    1769        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1770        .dwattr $C$DW$122, DW_AT_name("rsvd16")
    1771        .dwattr $C$DW$122, DW_AT_TI_symbol_name("rsvd16")
    1772        .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1773        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1774        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1775        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1776        .dwattr $C$DW$122, DW_AT_decl_line(0xb7)
    1777        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1778        .dwendtag $C$DW$T$27
    1779
    1780        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1781        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1782        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1783$C$DW$T$124     .dwtag  DW_TAG_volatile_type
    1784        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$27)
    1785
    1786$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1787        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1788$C$DW$123       .dwtag  DW_TAG_member
    1789        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1790        .dwattr $C$DW$123, DW_AT_name("PMAO_PRU0")
    1791        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PMAO_PRU0")
    1792        .dwattr $C$DW$123, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1793        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1795        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1796        .dwattr $C$DW$123, DW_AT_decl_line(0xc4)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   34

    1797        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1798$C$DW$124       .dwtag  DW_TAG_member
    1799        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1800        .dwattr $C$DW$124, DW_AT_name("PMAO_PRU1")
    1801        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PMAO_PRU1")
    1802        .dwattr $C$DW$124, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1803        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1805        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1806        .dwattr $C$DW$124, DW_AT_decl_line(0xc5)
    1807        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1808$C$DW$125       .dwtag  DW_TAG_member
    1809        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1810        .dwattr $C$DW$125, DW_AT_name("rsvd2")
    1811        .dwattr $C$DW$125, DW_AT_TI_symbol_name("rsvd2")
    1812        .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1813        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1815        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1816        .dwattr $C$DW$125, DW_AT_decl_line(0xc6)
    1817        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1818        .dwendtag $C$DW$T$28
    1819
    1820        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1821        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1822        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1823$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1824        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$28)
    1825
    1826$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1827        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1828$C$DW$126       .dwtag  DW_TAG_member
    1829        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1830        .dwattr $C$DW$126, DW_AT_name("OCP_EN")
    1831        .dwattr $C$DW$126, DW_AT_TI_symbol_name("OCP_EN")
    1832        .dwattr $C$DW$126, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1833        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1835        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1836        .dwattr $C$DW$126, DW_AT_decl_line(0xd3)
    1837        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1838$C$DW$127       .dwtag  DW_TAG_member
    1839        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1840        .dwattr $C$DW$127, DW_AT_name("rsvd1")
    1841        .dwattr $C$DW$127, DW_AT_TI_symbol_name("rsvd1")
    1842        .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1843        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1845        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1846        .dwattr $C$DW$127, DW_AT_decl_line(0xd4)
    1847        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1848        .dwendtag $C$DW$T$29
    1849
    1850        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1851        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   35

    1852        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1853$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1854        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$29)
    1855
    1856$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1857        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1858$C$DW$128       .dwtag  DW_TAG_member
    1859        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1860        .dwattr $C$DW$128, DW_AT_name("PRU1_PAD_HP_EN")
    1861        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1862        .dwattr $C$DW$128, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1863        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1865        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1866        .dwattr $C$DW$128, DW_AT_decl_line(0xde)
    1867        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1868$C$DW$129       .dwtag  DW_TAG_member
    1869        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1870        .dwattr $C$DW$129, DW_AT_name("XFR_SHIFT_EN")
    1871        .dwattr $C$DW$129, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1872        .dwattr $C$DW$129, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1873        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1875        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1876        .dwattr $C$DW$129, DW_AT_decl_line(0xdf)
    1877        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1878$C$DW$130       .dwtag  DW_TAG_member
    1879        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1880        .dwattr $C$DW$130, DW_AT_name("rsvd2")
    1881        .dwattr $C$DW$130, DW_AT_TI_symbol_name("rsvd2")
    1882        .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1883        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1885        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1886        .dwattr $C$DW$130, DW_AT_decl_line(0xe0)
    1887        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1888        .dwendtag $C$DW$T$30
    1889
    1890        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1891        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1892        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1893$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    1894        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$30)
    1895
    1896$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1897        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1898$C$DW$131       .dwtag  DW_TAG_member
    1899        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1900        .dwattr $C$DW$131, DW_AT_name("PIN_MUX_SEL")
    1901        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1902        .dwattr $C$DW$131, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1903        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1904        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1905        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1906        .dwattr $C$DW$131, DW_AT_decl_line(0xec)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   36

    1907        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1908$C$DW$132       .dwtag  DW_TAG_member
    1909        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1910        .dwattr $C$DW$132, DW_AT_name("rsvd2")
    1911        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd2")
    1912        .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1913        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1915        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1916        .dwattr $C$DW$132, DW_AT_decl_line(0xed)
    1917        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1918        .dwendtag $C$DW$T$31
    1919
    1920        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1921        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1922        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1923$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    1924        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    1925
    1926$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1927        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1928$C$DW$133       .dwtag  DW_TAG_member
    1929        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$109)
    1930        .dwattr $C$DW$133, DW_AT_name("$P$T0")
    1931        .dwattr $C$DW$133, DW_AT_TI_symbol_name("$P$T0")
    1932        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1934        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1935        .dwattr $C$DW$133, DW_AT_decl_line(0x29)
    1936        .dwattr $C$DW$133, DW_AT_decl_column(0x02)
    1937$C$DW$134       .dwtag  DW_TAG_member
    1938        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$111)
    1939        .dwattr $C$DW$134, DW_AT_name("$P$T1")
    1940        .dwattr $C$DW$134, DW_AT_TI_symbol_name("$P$T1")
    1941        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1942        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1943        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1944        .dwattr $C$DW$134, DW_AT_decl_line(0x33)
    1945        .dwattr $C$DW$134, DW_AT_decl_column(0x02)
    1946$C$DW$135       .dwtag  DW_TAG_member
    1947        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$113)
    1948        .dwattr $C$DW$135, DW_AT_name("$P$T2")
    1949        .dwattr $C$DW$135, DW_AT_TI_symbol_name("$P$T2")
    1950        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1951        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1952        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1953        .dwattr $C$DW$135, DW_AT_decl_line(0x41)
    1954        .dwattr $C$DW$135, DW_AT_decl_column(0x02)
    1955$C$DW$136       .dwtag  DW_TAG_member
    1956        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$115)
    1957        .dwattr $C$DW$136, DW_AT_name("$P$T3")
    1958        .dwattr $C$DW$136, DW_AT_TI_symbol_name("$P$T3")
    1959        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1960        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1961        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   37

    1962        .dwattr $C$DW$136, DW_AT_decl_line(0x54)
    1963        .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    1964$C$DW$137       .dwtag  DW_TAG_member
    1965        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$117)
    1966        .dwattr $C$DW$137, DW_AT_name("$P$T4")
    1967        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T4")
    1968        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1969        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1970        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1971        .dwattr $C$DW$137, DW_AT_decl_line(0x67)
    1972        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    1973$C$DW$138       .dwtag  DW_TAG_member
    1974        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$119)
    1975        .dwattr $C$DW$138, DW_AT_name("$P$T5")
    1976        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T5")
    1977        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1978        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1979        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1980        .dwattr $C$DW$138, DW_AT_decl_line(0x83)
    1981        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    1982$C$DW$139       .dwtag  DW_TAG_member
    1983        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$121)
    1984        .dwattr $C$DW$139, DW_AT_name("$P$T6")
    1985        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T6")
    1986        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1987        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1988        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1989        .dwattr $C$DW$139, DW_AT_decl_line(0x92)
    1990        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    1991$C$DW$140       .dwtag  DW_TAG_member
    1992        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$123)
    1993        .dwattr $C$DW$140, DW_AT_name("$P$T7")
    1994        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T7")
    1995        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1996        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1997        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1998        .dwattr $C$DW$140, DW_AT_decl_line(0xa0)
    1999        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2000$C$DW$141       .dwtag  DW_TAG_member
    2001        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$125)
    2002        .dwattr $C$DW$141, DW_AT_name("$P$T8")
    2003        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T8")
    2004        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2005        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2006        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2007        .dwattr $C$DW$141, DW_AT_decl_line(0xaf)
    2008        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2009$C$DW$142       .dwtag  DW_TAG_member
    2010        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$32)
    2011        .dwattr $C$DW$142, DW_AT_name("rsvd24")
    2012        .dwattr $C$DW$142, DW_AT_TI_symbol_name("rsvd24")
    2013        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2014        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2015        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2016        .dwattr $C$DW$142, DW_AT_decl_line(0xbc)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   38

    2017        .dwattr $C$DW$142, DW_AT_decl_column(0x0b)
    2018$C$DW$143       .dwtag  DW_TAG_member
    2019        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$127)
    2020        .dwattr $C$DW$143, DW_AT_name("$P$T9")
    2021        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T9")
    2022        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2023        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2024        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2025        .dwattr $C$DW$143, DW_AT_decl_line(0xc0)
    2026        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2027$C$DW$144       .dwtag  DW_TAG_member
    2028        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$33)
    2029        .dwattr $C$DW$144, DW_AT_name("rsvd2c")
    2030        .dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd2c")
    2031        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2032        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2033        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2034        .dwattr $C$DW$144, DW_AT_decl_line(0xcb)
    2035        .dwattr $C$DW$144, DW_AT_decl_column(0x0b)
    2036$C$DW$145       .dwtag  DW_TAG_member
    2037        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$129)
    2038        .dwattr $C$DW$145, DW_AT_name("$P$T10")
    2039        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T10")
    2040        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2041        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2042        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2043        .dwattr $C$DW$145, DW_AT_decl_line(0xcf)
    2044        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2045$C$DW$146       .dwtag  DW_TAG_member
    2046        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$131)
    2047        .dwattr $C$DW$146, DW_AT_name("$P$T11")
    2048        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T11")
    2049        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2050        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2051        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2052        .dwattr $C$DW$146, DW_AT_decl_line(0xda)
    2053        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2054$C$DW$147       .dwtag  DW_TAG_member
    2055        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$34)
    2056        .dwattr $C$DW$147, DW_AT_name("rsvd38")
    2057        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd38")
    2058        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2059        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2060        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2061        .dwattr $C$DW$147, DW_AT_decl_line(0xe5)
    2062        .dwattr $C$DW$147, DW_AT_decl_column(0x0b)
    2063$C$DW$148       .dwtag  DW_TAG_member
    2064        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$133)
    2065        .dwattr $C$DW$148, DW_AT_name("$P$T12")
    2066        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T12")
    2067        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2068        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2069        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2070        .dwattr $C$DW$148, DW_AT_decl_line(0xe8)
    2071        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   39

    2072        .dwendtag $C$DW$T$35
    2073
    2074        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2075        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2076        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2077$C$DW$T$290     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2078        .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$35)
    2079        .dwattr $C$DW$T$290, DW_AT_language(DW_LANG_C)
    2080        .dwattr $C$DW$T$290, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2081        .dwattr $C$DW$T$290, DW_AT_decl_line(0xf0)
    2082        .dwattr $C$DW$T$290, DW_AT_decl_column(0x03)
    2083$C$DW$T$291     .dwtag  DW_TAG_volatile_type
    2084        .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    2085
    2086$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2087        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2088$C$DW$149       .dwtag  DW_TAG_member
    2089        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    2090        .dwattr $C$DW$149, DW_AT_name("REV_MINOR")
    2091        .dwattr $C$DW$149, DW_AT_TI_symbol_name("REV_MINOR")
    2092        .dwattr $C$DW$149, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2093        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2095        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2096        .dwattr $C$DW$149, DW_AT_decl_line(0x2d)
    2097        .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    2098$C$DW$150       .dwtag  DW_TAG_member
    2099        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
    2100        .dwattr $C$DW$150, DW_AT_name("REV_CUSTOM")
    2101        .dwattr $C$DW$150, DW_AT_TI_symbol_name("REV_CUSTOM")
    2102        .dwattr $C$DW$150, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2103        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2105        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2106        .dwattr $C$DW$150, DW_AT_decl_line(0x2e)
    2107        .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
    2108$C$DW$151       .dwtag  DW_TAG_member
    2109        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    2110        .dwattr $C$DW$151, DW_AT_name("REV_MAJOR")
    2111        .dwattr $C$DW$151, DW_AT_TI_symbol_name("REV_MAJOR")
    2112        .dwattr $C$DW$151, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2113        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2115        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2116        .dwattr $C$DW$151, DW_AT_decl_line(0x2f)
    2117        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2118$C$DW$152       .dwtag  DW_TAG_member
    2119        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2120        .dwattr $C$DW$152, DW_AT_name("REV_RTL")
    2121        .dwattr $C$DW$152, DW_AT_TI_symbol_name("REV_RTL")
    2122        .dwattr $C$DW$152, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2123        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2124        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2125        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2126        .dwattr $C$DW$152, DW_AT_decl_line(0x30)
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   40

    2127        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2128$C$DW$153       .dwtag  DW_TAG_member
    2129        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2130        .dwattr $C$DW$153, DW_AT_name("REV_MODULE")
    2131        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_MODULE")
    2132        .dwattr $C$DW$153, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2133        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2134        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2135        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2136        .dwattr $C$DW$153, DW_AT_decl_line(0x31)
    2137        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2138$C$DW$154       .dwtag  DW_TAG_member
    2139        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2140        .dwattr $C$DW$154, DW_AT_name("rsvd28")
    2141        .dwattr $C$DW$154, DW_AT_TI_symbol_name("rsvd28")
    2142        .dwattr $C$DW$154, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2143        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2145        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2146        .dwattr $C$DW$154, DW_AT_decl_line(0x32)
    2147        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2148$C$DW$155       .dwtag  DW_TAG_member
    2149        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2150        .dwattr $C$DW$155, DW_AT_name("REV_SCHEME")
    2151        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_SCHEME")
    2152        .dwattr $C$DW$155, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2153        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2155        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2156        .dwattr $C$DW$155, DW_AT_decl_line(0x33)
    2157        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2158        .dwendtag $C$DW$T$36
    2159
    2160        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2161        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2162        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2163$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    2164        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$36)
    2165
    2166$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2167        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2168$C$DW$156       .dwtag  DW_TAG_member
    2169        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2170        .dwattr $C$DW$156, DW_AT_name("rsvd0")
    2171        .dwattr $C$DW$156, DW_AT_TI_symbol_name("rsvd0")
    2172        .dwattr $C$DW$156, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2173        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2175        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2176        .dwattr $C$DW$156, DW_AT_decl_line(0x3d)
    2177        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2178$C$DW$157       .dwtag  DW_TAG_member
    2179        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2180        .dwattr $C$DW$157, DW_AT_name("NEST_MODE")
    2181        .dwattr $C$DW$157, DW_AT_TI_symbol_name("NEST_MODE")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   41

    2182        .dwattr $C$DW$157, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2183        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2185        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2186        .dwattr $C$DW$157, DW_AT_decl_line(0x3e)
    2187        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2188$C$DW$158       .dwtag  DW_TAG_member
    2189        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2190        .dwattr $C$DW$158, DW_AT_name("rsvd4")
    2191        .dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd4")
    2192        .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2193        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2195        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2196        .dwattr $C$DW$158, DW_AT_decl_line(0x3f)
    2197        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2198        .dwendtag $C$DW$T$37
    2199
    2200        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2201        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2202        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2203$C$DW$T$136     .dwtag  DW_TAG_volatile_type
    2204        .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$37)
    2205
    2206$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2207        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2208$C$DW$159       .dwtag  DW_TAG_member
    2209        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2210        .dwattr $C$DW$159, DW_AT_name("EN_HINT_ANY")
    2211        .dwattr $C$DW$159, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2212        .dwattr $C$DW$159, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2213        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2214        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2215        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2216        .dwattr $C$DW$159, DW_AT_decl_line(0x4c)
    2217        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2218$C$DW$160       .dwtag  DW_TAG_member
    2219        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2220        .dwattr $C$DW$160, DW_AT_name("rsvd1")
    2221        .dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd1")
    2222        .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2223        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2225        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2226        .dwattr $C$DW$160, DW_AT_decl_line(0x4d)
    2227        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2228        .dwendtag $C$DW$T$38
    2229
    2230        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2231        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2232        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2233$C$DW$T$138     .dwtag  DW_TAG_volatile_type
    2234        .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$38)
    2235
    2236$C$DW$T$39      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   42

    2237        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2238$C$DW$161       .dwtag  DW_TAG_member
    2239        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2240        .dwattr $C$DW$161, DW_AT_name("GLB_NEST_LEVEL")
    2241        .dwattr $C$DW$161, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2242        .dwattr $C$DW$161, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2243        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2245        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2246        .dwattr $C$DW$161, DW_AT_decl_line(0x5a)
    2247        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2248$C$DW$162       .dwtag  DW_TAG_member
    2249        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2250        .dwattr $C$DW$162, DW_AT_name("rsvd9")
    2251        .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd9")
    2252        .dwattr $C$DW$162, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2253        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2255        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2256        .dwattr $C$DW$162, DW_AT_decl_line(0x5b)
    2257        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2258$C$DW$163       .dwtag  DW_TAG_member
    2259        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2260        .dwattr $C$DW$163, DW_AT_name("AUTO_OVERRIDE")
    2261        .dwattr $C$DW$163, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2262        .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2263        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2265        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2266        .dwattr $C$DW$163, DW_AT_decl_line(0x5c)
    2267        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2268        .dwendtag $C$DW$T$39
    2269
    2270        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2271        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2272        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2273$C$DW$T$140     .dwtag  DW_TAG_volatile_type
    2274        .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$39)
    2275
    2276$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2277        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2278$C$DW$164       .dwtag  DW_TAG_member
    2279        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2280        .dwattr $C$DW$164, DW_AT_name("STS_SET_IDX")
    2281        .dwattr $C$DW$164, DW_AT_TI_symbol_name("STS_SET_IDX")
    2282        .dwattr $C$DW$164, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2283        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2285        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2286        .dwattr $C$DW$164, DW_AT_decl_line(0x66)
    2287        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2288$C$DW$165       .dwtag  DW_TAG_member
    2289        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2290        .dwattr $C$DW$165, DW_AT_name("rsvd10")
    2291        .dwattr $C$DW$165, DW_AT_TI_symbol_name("rsvd10")
PRU Assembler Unix v2.1.4 Fri Apr 13 22:36:03 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   43

    2292        .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2293        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2295        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2296        .dwattr $C$DW$165, DW_AT_decl_line(0x67)
    2297        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2298        .dwendtag $C$DW$T$40
    2299
    2300        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2301        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    2302        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2303$C$DW$T$142     .dwtag  DW_TAG_volatile_type
    2304        .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$40)
    2305
    2306$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2307        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2308$C$DW$166       .dwtag  DW_TAG_member
    2309        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2310        .dwattr $C$DW$166, DW_AT_name("STS_CLR_IDX")
    2311        .dwattr $C$DW$166, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2312        .dwattr $C$DW$166, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2313        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2315        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2316        .dwattr $C$DW$166, DW_AT_decl_line(0x71)
    2317        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2318$C$DW$167       .dwtag  DW_TAG_member
    2319        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2320        .dwattr $C$DW$167, DW_AT_name("rsvd10")
    2321        .dwattr $C$DW$167, DW_AT_TI_symbol_name("rsvd10")
    2322        .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2323        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2324        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2325        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2326        .dwattr $C$DW$167, DW_AT_decl_line(0x72)
    2327        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2328        .dwendtag $C$DW$T$41
    2329
    2330        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2331        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2332        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2333$C$DW$T$144     .dwtag  DW_TAG_volatile_type
    2334        .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$41)
    2335
