PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sat Apr 14 22:56:00 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_IEP
      15
      16$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("pru_rpmsg_init")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("pru_rpmsg_init")
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$389)
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external

    1159 000001b0 0000000104E8E8          ADD       r8, r8, 0x04          ; [ALU_PRU] |234| $O$U78,$O$U78
    1160 000001b4 00000001012B2B          ADD       r11.b1, r11.b1, 0x01  ; [ALU_PRU] |234| i,i
    1161 000001b8 0000000104E7E7          ADD       r7, r7, 0x04          ; [ALU_PRU] |234| $O$U81,$O$U81
    1162 000001bc 00000067042BDD          QBGT      ||$C$L20||, r11.b1, 0x04 ; [ALU_PRU] |234| i
    1163;* --------------------------------------------------------------------------*
    1164        .dwpsn  file "main1.c",line 254,column 4,is_stmt,isa 0
    1165;----------------------------------------------------------------------
    1166; 254 | printFlag = 0;                                                         
    1167; 256 | //     else{  //print "no" if seen nothing in 10 seconds to confirm sti
    1168;     | l running                                                              
    1169; 257 | //          noPrint += RESOLUTION;                                     
    1170; 258 | //          if(noPrint > 10000000){                                    
    1171; 259 | //                  payload[0] = 'n' ;                                 
    1172; 260 |         // payload[1] = 'o';                                           
    1173; 261 |         // payload[2] = '\n';                                          
    1174; 262 |         // payload[3] = 0;                                             
    1175; 263 |         // len = 4;                                                    
    1176; 264 |         // pru_rpmsg_send(&transport, dst, src, payload, len);         
    1177; 265 | //                  noPrint = 0;                                       
    1178; 266 | //          }                                                          
    1179; 268 | //     }                                                               
    1180; 269 | while( CT_IEP.TMR_CNT < SAMPLE_PERIOD);                                
    1181;----------------------------------------------------------------------
    1182 000001c0 000000E1002486          SBBO      &r6, r4, 0, 4         ; [ALU_PRU] |254| $O$K72,$O$K56
    1183;* --------------------------------------------------------------------------*
    1184;*   BEGIN LOOP ||$C$L26||
    1185;*
    1186;*   Loop source line                : 269
    1187;*   Loop closing brace source line  : 269
    1188;*   Known Minimum Trip Count        : 1
    1189;*   Known Maximum Trip Count        : 4294967295
    1190;*   Known Max Trip Count Factor     : 1
    1191;* --------------------------------------------------------------------------*
    1192 000001c4                 ||$C$L26||:    
    1193        .dwpsn  file "main1.c",line 225,column 9,is_stmt,isa 0
    1194 000001c4 0000002407D0E0          LDI       r0, 0x07d0            ; [ALU_PRU] |225| 
    1195 000001c8 000000F10C2A81          LBBO      &r1, r10, 12, 4       ; [ALU_PRU] |225| $O$K117
    1196 000001cc 00000076E1E0D2          QBGE      ||$C$L19||, r0, r1    ; [ALU_PRU] |225| 
    1197;* --------------------------------------------------------------------------*
    1198 000001d0 00000021000000!         JMP       ||$C$L26||            ; [ALU_PRU] |225| 
    1199;* --------------------------------------------------------------------------*
    1200        .dwattr $C$DW$44, DW_AT_TI_end_file("main1.c")
    1201        .dwattr $C$DW$44, DW_AT_TI_end_line(0x110)
    1202        .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
    1203        .dwendentry
    1204        .dwendtag $C$DW$44
    1205
    1206;******************************************************************************
    1207;* STRINGS                                                                    *
    1208;******************************************************************************
    1209 00000000                         .sect   ".rodata:.string"
    1210 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   23

         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
    1211 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000031 
         00000014 00000000000000 
    1212;*****************************************************************************
    1213;* UNDEFINED EXTERNAL REFERENCES                                             *
    1214;*****************************************************************************
    1215        .global ||pru_rpmsg_init||
    1216        .global ||pru_rpmsg_receive||
    1217        .global ||pru_rpmsg_send||
    1218        .global ||pru_rpmsg_channel||
    1219
    1220;******************************************************************************
    1221;* TYPE INFORMATION                                                           *
    1222;******************************************************************************
    1223
    1224$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1225        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1226$C$DW$57        .dwtag  DW_TAG_member
    1227        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
    1228        .dwattr $C$DW$57, DW_AT_name("REVID")
    1229        .dwattr $C$DW$57, DW_AT_TI_symbol_name("REVID")
    1230        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1231        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1233        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1234        .dwattr $C$DW$57, DW_AT_decl_line(0x2d)
    1235        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1236        .dwendtag $C$DW$T$19
    1237
    1238        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1239        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1240        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1241$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1242        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    1243
    1244$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1245        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1246$C$DW$58        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   24

    1247        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1248        .dwattr $C$DW$58, DW_AT_name("IDLE_MODE")
    1249        .dwattr $C$DW$58, DW_AT_TI_symbol_name("IDLE_MODE")
    1250        .dwattr $C$DW$58, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1251        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1253        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1254        .dwattr $C$DW$58, DW_AT_decl_line(0x37)
    1255        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1256$C$DW$59        .dwtag  DW_TAG_member
    1257        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1258        .dwattr $C$DW$59, DW_AT_name("STANDBY_MODE")
    1259        .dwattr $C$DW$59, DW_AT_TI_symbol_name("STANDBY_MODE")
    1260        .dwattr $C$DW$59, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1261        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1263        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1264        .dwattr $C$DW$59, DW_AT_decl_line(0x38)
    1265        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1266$C$DW$60        .dwtag  DW_TAG_member
    1267        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1268        .dwattr $C$DW$60, DW_AT_name("STANDBY_INIT")
    1269        .dwattr $C$DW$60, DW_AT_TI_symbol_name("STANDBY_INIT")
    1270        .dwattr $C$DW$60, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1271        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1273        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1274        .dwattr $C$DW$60, DW_AT_decl_line(0x39)
    1275        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1276$C$DW$61        .dwtag  DW_TAG_member
    1277        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1278        .dwattr $C$DW$61, DW_AT_name("SUB_MWAIT")
    1279        .dwattr $C$DW$61, DW_AT_TI_symbol_name("SUB_MWAIT")
    1280        .dwattr $C$DW$61, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1281        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1283        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1284        .dwattr $C$DW$61, DW_AT_decl_line(0x3a)
    1285        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1286$C$DW$62        .dwtag  DW_TAG_member
    1287        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1288        .dwattr $C$DW$62, DW_AT_name("rsvd6")
    1289        .dwattr $C$DW$62, DW_AT_TI_symbol_name("rsvd6")
    1290        .dwattr $C$DW$62, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1291        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1293        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1294        .dwattr $C$DW$62, DW_AT_decl_line(0x3b)
    1295        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1296        .dwendtag $C$DW$T$20
    1297
    1298        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1299        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1300        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1301$C$DW$T$133     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   25

    1302        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$20)
    1303
    1304$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1305        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1306$C$DW$63        .dwtag  DW_TAG_member
    1307        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1308        .dwattr $C$DW$63, DW_AT_name("PRU0_GPI_MODE")
    1309        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1310        .dwattr $C$DW$63, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1311        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1313        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1314        .dwattr $C$DW$63, DW_AT_decl_line(0x45)
    1315        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1316$C$DW$64        .dwtag  DW_TAG_member
    1317        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1318        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_CLK_MODE")
    1319        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1320        .dwattr $C$DW$64, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1321        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1323        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1324        .dwattr $C$DW$64, DW_AT_decl_line(0x46)
    1325        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1326$C$DW$65        .dwtag  DW_TAG_member
    1327        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1328        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_DIV0")
    1329        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1330        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1331        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1333        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1334        .dwattr $C$DW$65, DW_AT_decl_line(0x47)
    1335        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1336$C$DW$66        .dwtag  DW_TAG_member
    1337        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1338        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_DIV1")
    1339        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1340        .dwattr $C$DW$66, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1341        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1343        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1344        .dwattr $C$DW$66, DW_AT_decl_line(0x48)
    1345        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1346$C$DW$67        .dwtag  DW_TAG_member
    1347        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1348        .dwattr $C$DW$67, DW_AT_name("PRU0_GPI_SB")
    1349        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1350        .dwattr $C$DW$67, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1351        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1353        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1354        .dwattr $C$DW$67, DW_AT_decl_line(0x49)
    1355        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1356$C$DW$68        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   26

    1357        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1358        .dwattr $C$DW$68, DW_AT_name("PRU0_GPO_MODE")
    1359        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1360        .dwattr $C$DW$68, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1361        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1363        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1364        .dwattr $C$DW$68, DW_AT_decl_line(0x4a)
    1365        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1366$C$DW$69        .dwtag  DW_TAG_member
    1367        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1368        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_DIV0")
    1369        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1370        .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1371        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1373        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1374        .dwattr $C$DW$69, DW_AT_decl_line(0x4b)
    1375        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1376$C$DW$70        .dwtag  DW_TAG_member
    1377        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1378        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_DIV1")
    1379        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1380        .dwattr $C$DW$70, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1381        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1383        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1384        .dwattr $C$DW$70, DW_AT_decl_line(0x4c)
    1385        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1386$C$DW$71        .dwtag  DW_TAG_member
    1387        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1388        .dwattr $C$DW$71, DW_AT_name("PRU0_GPO_SH_SEL")
    1389        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1390        .dwattr $C$DW$71, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1391        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1393        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1394        .dwattr $C$DW$71, DW_AT_decl_line(0x4d)
    1395        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1396$C$DW$72        .dwtag  DW_TAG_member
    1397        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1398        .dwattr $C$DW$72, DW_AT_name("rsvd26")
    1399        .dwattr $C$DW$72, DW_AT_TI_symbol_name("rsvd26")
    1400        .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1401        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1403        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1404        .dwattr $C$DW$72, DW_AT_decl_line(0x4e)
    1405        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1406        .dwendtag $C$DW$T$21
    1407
    1408        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1409        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1410        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1411$C$DW$T$135     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   27

    1412        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    1413
    1414$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1415        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1416$C$DW$73        .dwtag  DW_TAG_member
    1417        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1418        .dwattr $C$DW$73, DW_AT_name("PRU1_GPI_MODE")
    1419        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1420        .dwattr $C$DW$73, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1421        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1423        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1424        .dwattr $C$DW$73, DW_AT_decl_line(0x58)
    1425        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1426$C$DW$74        .dwtag  DW_TAG_member
    1427        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1428        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_CLK_MODE")
    1429        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1430        .dwattr $C$DW$74, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1431        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1433        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1434        .dwattr $C$DW$74, DW_AT_decl_line(0x59)
    1435        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1436$C$DW$75        .dwtag  DW_TAG_member
    1437        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1438        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_DIV0")
    1439        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1440        .dwattr $C$DW$75, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1441        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1443        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1444        .dwattr $C$DW$75, DW_AT_decl_line(0x5a)
    1445        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1446$C$DW$76        .dwtag  DW_TAG_member
    1447        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1448        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_DIV1")
    1449        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1450        .dwattr $C$DW$76, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1451        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1453        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1454        .dwattr $C$DW$76, DW_AT_decl_line(0x5b)
    1455        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1456$C$DW$77        .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1458        .dwattr $C$DW$77, DW_AT_name("PRU1_GPI_SB")
    1459        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1460        .dwattr $C$DW$77, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1461        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1463        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1464        .dwattr $C$DW$77, DW_AT_decl_line(0x5c)
    1465        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1466$C$DW$78        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   28

    1467        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1468        .dwattr $C$DW$78, DW_AT_name("PRU1_GPO_MODE")
    1469        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1470        .dwattr $C$DW$78, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1471        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1473        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1474        .dwattr $C$DW$78, DW_AT_decl_line(0x5d)
    1475        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1476$C$DW$79        .dwtag  DW_TAG_member
    1477        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1478        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_DIV0")
    1479        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1480        .dwattr $C$DW$79, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1481        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1483        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1484        .dwattr $C$DW$79, DW_AT_decl_line(0x5e)
    1485        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1486$C$DW$80        .dwtag  DW_TAG_member
    1487        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1488        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_DIV1")
    1489        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1490        .dwattr $C$DW$80, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1491        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1493        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1494        .dwattr $C$DW$80, DW_AT_decl_line(0x5f)
    1495        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1496$C$DW$81        .dwtag  DW_TAG_member
    1497        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1498        .dwattr $C$DW$81, DW_AT_name("PRU1_GPO_SH_SEL")
    1499        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1500        .dwattr $C$DW$81, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1501        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1503        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1504        .dwattr $C$DW$81, DW_AT_decl_line(0x60)
    1505        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1506$C$DW$82        .dwtag  DW_TAG_member
    1507        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1508        .dwattr $C$DW$82, DW_AT_name("rsvd26")
    1509        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd26")
    1510        .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1511        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1513        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1514        .dwattr $C$DW$82, DW_AT_decl_line(0x61)
    1515        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1516        .dwendtag $C$DW$T$22
    1517
    1518        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1519        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1520        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1521$C$DW$T$137     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   29

    1522        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$22)
    1523
    1524$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1525        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1526$C$DW$83        .dwtag  DW_TAG_member
    1527        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1528        .dwattr $C$DW$83, DW_AT_name("PRU0_CLK_STOP_REQ")
    1529        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1530        .dwattr $C$DW$83, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1531        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1533        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1534        .dwattr $C$DW$83, DW_AT_decl_line(0x6b)
    1535        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1536$C$DW$84        .dwtag  DW_TAG_member
    1537        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1538        .dwattr $C$DW$84, DW_AT_name("PRU0_CLK_STOP_ACK")
    1539        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1540        .dwattr $C$DW$84, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1541        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1543        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1544        .dwattr $C$DW$84, DW_AT_decl_line(0x6c)
    1545        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1546$C$DW$85        .dwtag  DW_TAG_member
    1547        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1548        .dwattr $C$DW$85, DW_AT_name("PRU0_CLK_EN")
    1549        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1550        .dwattr $C$DW$85, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1551        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1553        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1554        .dwattr $C$DW$85, DW_AT_decl_line(0x6d)
    1555        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1556$C$DW$86        .dwtag  DW_TAG_member
    1557        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1558        .dwattr $C$DW$86, DW_AT_name("PRU1_CLK_STOP_REQ")
    1559        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1560        .dwattr $C$DW$86, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1561        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1563        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1564        .dwattr $C$DW$86, DW_AT_decl_line(0x6e)
    1565        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1566$C$DW$87        .dwtag  DW_TAG_member
    1567        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1568        .dwattr $C$DW$87, DW_AT_name("PRU1_CLK_STOP_ACK")
    1569        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1570        .dwattr $C$DW$87, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1571        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1573        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1574        .dwattr $C$DW$87, DW_AT_decl_line(0x6f)
    1575        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1576$C$DW$88        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   30

    1577        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1578        .dwattr $C$DW$88, DW_AT_name("PRU1_CLK_EN")
    1579        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1580        .dwattr $C$DW$88, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1581        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1584        .dwattr $C$DW$88, DW_AT_decl_line(0x70)
    1585        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1586$C$DW$89        .dwtag  DW_TAG_member
    1587        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1588        .dwattr $C$DW$89, DW_AT_name("INTC_CLK_STOP_REQ")
    1589        .dwattr $C$DW$89, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1590        .dwattr $C$DW$89, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1591        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1592        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1593        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1594        .dwattr $C$DW$89, DW_AT_decl_line(0x71)
    1595        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1596$C$DW$90        .dwtag  DW_TAG_member
    1597        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1598        .dwattr $C$DW$90, DW_AT_name("INTC_CLK_STOP_ACK")
    1599        .dwattr $C$DW$90, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1600        .dwattr $C$DW$90, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1601        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1603        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1604        .dwattr $C$DW$90, DW_AT_decl_line(0x72)
    1605        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1606$C$DW$91        .dwtag  DW_TAG_member
    1607        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1608        .dwattr $C$DW$91, DW_AT_name("INTC_CLK_EN")
    1609        .dwattr $C$DW$91, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1610        .dwattr $C$DW$91, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1611        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1613        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1614        .dwattr $C$DW$91, DW_AT_decl_line(0x73)
    1615        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1616$C$DW$92        .dwtag  DW_TAG_member
    1617        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1618        .dwattr $C$DW$92, DW_AT_name("UART_CLK_STOP_REQ")
    1619        .dwattr $C$DW$92, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1620        .dwattr $C$DW$92, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1621        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1623        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1624        .dwattr $C$DW$92, DW_AT_decl_line(0x74)
    1625        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1626$C$DW$93        .dwtag  DW_TAG_member
    1627        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1628        .dwattr $C$DW$93, DW_AT_name("UART_CLK_STOP_ACK")
    1629        .dwattr $C$DW$93, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1630        .dwattr $C$DW$93, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1631        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   31

    1632        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1633        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1634        .dwattr $C$DW$93, DW_AT_decl_line(0x75)
    1635        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1636$C$DW$94        .dwtag  DW_TAG_member
    1637        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1638        .dwattr $C$DW$94, DW_AT_name("UART_CLK_EN")
    1639        .dwattr $C$DW$94, DW_AT_TI_symbol_name("UART_CLK_EN")
    1640        .dwattr $C$DW$94, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1641        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1643        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1644        .dwattr $C$DW$94, DW_AT_decl_line(0x76)
    1645        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1646$C$DW$95        .dwtag  DW_TAG_member
    1647        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1648        .dwattr $C$DW$95, DW_AT_name("ECAP_CLK_STOP_REQ")
    1649        .dwattr $C$DW$95, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1650        .dwattr $C$DW$95, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1651        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1653        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1654        .dwattr $C$DW$95, DW_AT_decl_line(0x77)
    1655        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1656$C$DW$96        .dwtag  DW_TAG_member
    1657        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1658        .dwattr $C$DW$96, DW_AT_name("ECAP_CLK_STOP_ACK")
    1659        .dwattr $C$DW$96, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1660        .dwattr $C$DW$96, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1661        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1663        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1664        .dwattr $C$DW$96, DW_AT_decl_line(0x78)
    1665        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1666$C$DW$97        .dwtag  DW_TAG_member
    1667        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1668        .dwattr $C$DW$97, DW_AT_name("ECAP_CLK_EN")
    1669        .dwattr $C$DW$97, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1670        .dwattr $C$DW$97, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1671        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1673        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1674        .dwattr $C$DW$97, DW_AT_decl_line(0x79)
    1675        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1676$C$DW$98        .dwtag  DW_TAG_member
    1677        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1678        .dwattr $C$DW$98, DW_AT_name("IEP_CLK_STOP_REQ")
    1679        .dwattr $C$DW$98, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1680        .dwattr $C$DW$98, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1681        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1683        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1684        .dwattr $C$DW$98, DW_AT_decl_line(0x7a)
    1685        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1686$C$DW$99        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   32

    1687        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1688        .dwattr $C$DW$99, DW_AT_name("IEP_CLK_STOP_ACK")
    1689        .dwattr $C$DW$99, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1690        .dwattr $C$DW$99, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1691        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1693        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1694        .dwattr $C$DW$99, DW_AT_decl_line(0x7b)
    1695        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1696$C$DW$100       .dwtag  DW_TAG_member
    1697        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1698        .dwattr $C$DW$100, DW_AT_name("IEP_CLK_EN")
    1699        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1700        .dwattr $C$DW$100, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1701        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1703        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1704        .dwattr $C$DW$100, DW_AT_decl_line(0x7c)
    1705        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1706$C$DW$101       .dwtag  DW_TAG_member
    1707        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1708        .dwattr $C$DW$101, DW_AT_name("rsvd18")
    1709        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd18")
    1710        .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1711        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1713        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1714        .dwattr $C$DW$101, DW_AT_decl_line(0x7d)
    1715        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1716        .dwendtag $C$DW$T$23
    1717
    1718        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1719        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1720        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1721$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1722        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$23)
    1723
    1724$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1725        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1726$C$DW$102       .dwtag  DW_TAG_member
    1727        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1728        .dwattr $C$DW$102, DW_AT_name("PRU0_IMEM_PE_RAW")
    1729        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1730        .dwattr $C$DW$102, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1731        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1733        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1734        .dwattr $C$DW$102, DW_AT_decl_line(0x87)
    1735        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1736$C$DW$103       .dwtag  DW_TAG_member
    1737        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1738        .dwattr $C$DW$103, DW_AT_name("PRU0_DMEM_PE_RAW")
    1739        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1740        .dwattr $C$DW$103, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1741        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   33

    1742        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1743        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1744        .dwattr $C$DW$103, DW_AT_decl_line(0x88)
    1745        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1746$C$DW$104       .dwtag  DW_TAG_member
    1747        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1748        .dwattr $C$DW$104, DW_AT_name("PRU1_IMEM_PE_RAW")
    1749        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1750        .dwattr $C$DW$104, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1751        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1753        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1754        .dwattr $C$DW$104, DW_AT_decl_line(0x89)
    1755        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1756$C$DW$105       .dwtag  DW_TAG_member
    1757        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1758        .dwattr $C$DW$105, DW_AT_name("PRU1_DMEM_PE_RAW")
    1759        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1760        .dwattr $C$DW$105, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1761        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1763        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1764        .dwattr $C$DW$105, DW_AT_decl_line(0x8a)
    1765        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1766$C$DW$106       .dwtag  DW_TAG_member
    1767        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1768        .dwattr $C$DW$106, DW_AT_name("RAM_PE_RAW")
    1769        .dwattr $C$DW$106, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1770        .dwattr $C$DW$106, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1771        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1773        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1774        .dwattr $C$DW$106, DW_AT_decl_line(0x8b)
    1775        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1776$C$DW$107       .dwtag  DW_TAG_member
    1777        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1778        .dwattr $C$DW$107, DW_AT_name("rsvd20")
    1779        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd20")
    1780        .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1781        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1783        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1784        .dwattr $C$DW$107, DW_AT_decl_line(0x8c)
    1785        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1786        .dwendtag $C$DW$T$24
    1787
    1788        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1789        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1790        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1791$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    1792        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$24)
    1793
    1794$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1795        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1796$C$DW$108       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   34

    1797        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1798        .dwattr $C$DW$108, DW_AT_name("PRU0_IMEM_PE")
    1799        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1800        .dwattr $C$DW$108, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1801        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1803        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1804        .dwattr $C$DW$108, DW_AT_decl_line(0x96)
    1805        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1806$C$DW$109       .dwtag  DW_TAG_member
    1807        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1808        .dwattr $C$DW$109, DW_AT_name("PRU0_DMEM_PE")
    1809        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1810        .dwattr $C$DW$109, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1811        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1813        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1814        .dwattr $C$DW$109, DW_AT_decl_line(0x97)
    1815        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1816$C$DW$110       .dwtag  DW_TAG_member
    1817        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1818        .dwattr $C$DW$110, DW_AT_name("PRU1_IMEM_PE")
    1819        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1820        .dwattr $C$DW$110, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1821        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1823        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1824        .dwattr $C$DW$110, DW_AT_decl_line(0x98)
    1825        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1826$C$DW$111       .dwtag  DW_TAG_member
    1827        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1828        .dwattr $C$DW$111, DW_AT_name("PRU1_DMEM_PE")
    1829        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1830        .dwattr $C$DW$111, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1831        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1833        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1834        .dwattr $C$DW$111, DW_AT_decl_line(0x99)
    1835        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1836$C$DW$112       .dwtag  DW_TAG_member
    1837        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1838        .dwattr $C$DW$112, DW_AT_name("RAM_PE")
    1839        .dwattr $C$DW$112, DW_AT_TI_symbol_name("RAM_PE")
    1840        .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1841        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1843        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1844        .dwattr $C$DW$112, DW_AT_decl_line(0x9a)
    1845        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1846$C$DW$113       .dwtag  DW_TAG_member
    1847        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1848        .dwattr $C$DW$113, DW_AT_name("rsvd20")
    1849        .dwattr $C$DW$113, DW_AT_TI_symbol_name("rsvd20")
    1850        .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1851        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   35

    1852        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1853        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1854        .dwattr $C$DW$113, DW_AT_decl_line(0x9b)
    1855        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1856        .dwendtag $C$DW$T$25
    1857
    1858        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1859        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1860        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1861$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    1862        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$25)
    1863
    1864$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1865        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1866$C$DW$114       .dwtag  DW_TAG_member
    1867        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1868        .dwattr $C$DW$114, DW_AT_name("PRU0_IMEM_PE_SET")
    1869        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1870        .dwattr $C$DW$114, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1871        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1872        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1873        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1874        .dwattr $C$DW$114, DW_AT_decl_line(0xa4)
    1875        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1876$C$DW$115       .dwtag  DW_TAG_member
    1877        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1878        .dwattr $C$DW$115, DW_AT_name("PRU0_DMEM_PE_SET")
    1879        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1880        .dwattr $C$DW$115, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1881        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1882        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1883        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1884        .dwattr $C$DW$115, DW_AT_decl_line(0xa5)
    1885        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1886$C$DW$116       .dwtag  DW_TAG_member
    1887        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1888        .dwattr $C$DW$116, DW_AT_name("PRU1_IMEM_PE_SET")
    1889        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1890        .dwattr $C$DW$116, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1891        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1893        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1894        .dwattr $C$DW$116, DW_AT_decl_line(0xa6)
    1895        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1896$C$DW$117       .dwtag  DW_TAG_member
    1897        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1898        .dwattr $C$DW$117, DW_AT_name("PRU1_DMEM_PE_SET")
    1899        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1900        .dwattr $C$DW$117, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1901        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1903        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1904        .dwattr $C$DW$117, DW_AT_decl_line(0xa7)
    1905        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1906$C$DW$118       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   36

    1907        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1908        .dwattr $C$DW$118, DW_AT_name("RAM_PE_SET")
    1909        .dwattr $C$DW$118, DW_AT_TI_symbol_name("RAM_PE_SET")
    1910        .dwattr $C$DW$118, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1911        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1913        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1914        .dwattr $C$DW$118, DW_AT_decl_line(0xa8)
    1915        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1916$C$DW$119       .dwtag  DW_TAG_member
    1917        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1918        .dwattr $C$DW$119, DW_AT_name("rsvd20")
    1919        .dwattr $C$DW$119, DW_AT_TI_symbol_name("rsvd20")
    1920        .dwattr $C$DW$119, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1921        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1923        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1924        .dwattr $C$DW$119, DW_AT_decl_line(0xa9)
    1925        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1926        .dwendtag $C$DW$T$26
    1927
    1928        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1929        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1930        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1931$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    1932        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$26)
    1933
    1934$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1935        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1936$C$DW$120       .dwtag  DW_TAG_member
    1937        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1938        .dwattr $C$DW$120, DW_AT_name("PRU0_IMEM_PE_CLR")
    1939        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1940        .dwattr $C$DW$120, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1941        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1943        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1944        .dwattr $C$DW$120, DW_AT_decl_line(0xb3)
    1945        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1946$C$DW$121       .dwtag  DW_TAG_member
    1947        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1948        .dwattr $C$DW$121, DW_AT_name("PRU0_DMEM_PE_CLR")
    1949        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1950        .dwattr $C$DW$121, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1951        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1953        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1954        .dwattr $C$DW$121, DW_AT_decl_line(0xb4)
    1955        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1956$C$DW$122       .dwtag  DW_TAG_member
    1957        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1958        .dwattr $C$DW$122, DW_AT_name("PRU1_IMEM_PE_CLR")
    1959        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1960        .dwattr $C$DW$122, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1961        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   37

    1962        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1963        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1964        .dwattr $C$DW$122, DW_AT_decl_line(0xb5)
    1965        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1966$C$DW$123       .dwtag  DW_TAG_member
    1967        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1968        .dwattr $C$DW$123, DW_AT_name("PRU1_DMEM_PE_CLR")
    1969        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1970        .dwattr $C$DW$123, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1971        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1973        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1974        .dwattr $C$DW$123, DW_AT_decl_line(0xb6)
    1975        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1976$C$DW$124       .dwtag  DW_TAG_member
    1977        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1978        .dwattr $C$DW$124, DW_AT_name("rsvd16")
    1979        .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd16")
    1980        .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1981        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1983        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1984        .dwattr $C$DW$124, DW_AT_decl_line(0xb7)
    1985        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1986        .dwendtag $C$DW$T$27
    1987
    1988        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1989        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1990        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1991$C$DW$T$147     .dwtag  DW_TAG_volatile_type
    1992        .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$27)
    1993
    1994$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1995        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1996$C$DW$125       .dwtag  DW_TAG_member
    1997        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1998        .dwattr $C$DW$125, DW_AT_name("PMAO_PRU0")
    1999        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PMAO_PRU0")
    2000        .dwattr $C$DW$125, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2001        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2003        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2004        .dwattr $C$DW$125, DW_AT_decl_line(0xc4)
    2005        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2006$C$DW$126       .dwtag  DW_TAG_member
    2007        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2008        .dwattr $C$DW$126, DW_AT_name("PMAO_PRU1")
    2009        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PMAO_PRU1")
    2010        .dwattr $C$DW$126, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2011        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2013        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2014        .dwattr $C$DW$126, DW_AT_decl_line(0xc5)
    2015        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2016$C$DW$127       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   38

    2017        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2018        .dwattr $C$DW$127, DW_AT_name("rsvd2")
    2019        .dwattr $C$DW$127, DW_AT_TI_symbol_name("rsvd2")
    2020        .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2021        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2023        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2024        .dwattr $C$DW$127, DW_AT_decl_line(0xc6)
    2025        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2026        .dwendtag $C$DW$T$28
    2027
    2028        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2029        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2030        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2031$C$DW$T$149     .dwtag  DW_TAG_volatile_type
    2032        .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$28)
    2033
    2034$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2035        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2036$C$DW$128       .dwtag  DW_TAG_member
    2037        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2038        .dwattr $C$DW$128, DW_AT_name("OCP_EN")
    2039        .dwattr $C$DW$128, DW_AT_TI_symbol_name("OCP_EN")
    2040        .dwattr $C$DW$128, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2041        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2043        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2044        .dwattr $C$DW$128, DW_AT_decl_line(0xd3)
    2045        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2046$C$DW$129       .dwtag  DW_TAG_member
    2047        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2048        .dwattr $C$DW$129, DW_AT_name("rsvd1")
    2049        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd1")
    2050        .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2051        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2053        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2054        .dwattr $C$DW$129, DW_AT_decl_line(0xd4)
    2055        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2056        .dwendtag $C$DW$T$29
    2057
    2058        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2059        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2060        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2061$C$DW$T$151     .dwtag  DW_TAG_volatile_type
    2062        .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$29)
    2063
    2064$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2065        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2066$C$DW$130       .dwtag  DW_TAG_member
    2067        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2068        .dwattr $C$DW$130, DW_AT_name("PRU1_PAD_HP_EN")
    2069        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2070        .dwattr $C$DW$130, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2071        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   39

    2072        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2073        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2074        .dwattr $C$DW$130, DW_AT_decl_line(0xde)
    2075        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2076$C$DW$131       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2078        .dwattr $C$DW$131, DW_AT_name("XFR_SHIFT_EN")
    2079        .dwattr $C$DW$131, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2080        .dwattr $C$DW$131, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2081        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2083        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2084        .dwattr $C$DW$131, DW_AT_decl_line(0xdf)
    2085        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2086$C$DW$132       .dwtag  DW_TAG_member
    2087        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2088        .dwattr $C$DW$132, DW_AT_name("rsvd2")
    2089        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd2")
    2090        .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2091        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2092        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2093        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2094        .dwattr $C$DW$132, DW_AT_decl_line(0xe0)
    2095        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2096        .dwendtag $C$DW$T$30
    2097
    2098        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2099        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2100        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2101$C$DW$T$153     .dwtag  DW_TAG_volatile_type
    2102        .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$30)
    2103
    2104$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2105        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2106$C$DW$133       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2108        .dwattr $C$DW$133, DW_AT_name("PIN_MUX_SEL")
    2109        .dwattr $C$DW$133, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2110        .dwattr $C$DW$133, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    2111        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2113        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2114        .dwattr $C$DW$133, DW_AT_decl_line(0xec)
    2115        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2116$C$DW$134       .dwtag  DW_TAG_member
    2117        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2118        .dwattr $C$DW$134, DW_AT_name("rsvd2")
    2119        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd2")
    2120        .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    2121        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2123        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2124        .dwattr $C$DW$134, DW_AT_decl_line(0xed)
    2125        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2126        .dwendtag $C$DW$T$31
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   40

    2127
    2128        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2129        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2130        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2131$C$DW$T$155     .dwtag  DW_TAG_volatile_type
    2132        .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$31)
    2133
    2134$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2135        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2136$C$DW$135       .dwtag  DW_TAG_member
    2137        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$132)
    2138        .dwattr $C$DW$135, DW_AT_name("$P$T0")
    2139        .dwattr $C$DW$135, DW_AT_TI_symbol_name("$P$T0")
    2140        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2142        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2143        .dwattr $C$DW$135, DW_AT_decl_line(0x29)
    2144        .dwattr $C$DW$135, DW_AT_decl_column(0x02)
    2145$C$DW$136       .dwtag  DW_TAG_member
    2146        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$134)
    2147        .dwattr $C$DW$136, DW_AT_name("$P$T1")
    2148        .dwattr $C$DW$136, DW_AT_TI_symbol_name("$P$T1")
    2149        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2150        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2151        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2152        .dwattr $C$DW$136, DW_AT_decl_line(0x33)
    2153        .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    2154$C$DW$137       .dwtag  DW_TAG_member
    2155        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$136)
    2156        .dwattr $C$DW$137, DW_AT_name("$P$T2")
    2157        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T2")
    2158        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2159        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2160        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2161        .dwattr $C$DW$137, DW_AT_decl_line(0x41)
    2162        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2163$C$DW$138       .dwtag  DW_TAG_member
    2164        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$138)
    2165        .dwattr $C$DW$138, DW_AT_name("$P$T3")
    2166        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T3")
    2167        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2168        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2169        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2170        .dwattr $C$DW$138, DW_AT_decl_line(0x54)
    2171        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    2172$C$DW$139       .dwtag  DW_TAG_member
    2173        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$140)
    2174        .dwattr $C$DW$139, DW_AT_name("$P$T4")
    2175        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T4")
    2176        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2177        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2178        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2179        .dwattr $C$DW$139, DW_AT_decl_line(0x67)
    2180        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2181$C$DW$140       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   41

    2182        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$142)
    2183        .dwattr $C$DW$140, DW_AT_name("$P$T5")
    2184        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T5")
    2185        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2186        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2187        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2188        .dwattr $C$DW$140, DW_AT_decl_line(0x83)
    2189        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2190$C$DW$141       .dwtag  DW_TAG_member
    2191        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$144)
    2192        .dwattr $C$DW$141, DW_AT_name("$P$T6")
    2193        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T6")
    2194        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2195        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2196        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2197        .dwattr $C$DW$141, DW_AT_decl_line(0x92)
    2198        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2199$C$DW$142       .dwtag  DW_TAG_member
    2200        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$146)
    2201        .dwattr $C$DW$142, DW_AT_name("$P$T7")
    2202        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T7")
    2203        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2204        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2205        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2206        .dwattr $C$DW$142, DW_AT_decl_line(0xa0)
    2207        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2208$C$DW$143       .dwtag  DW_TAG_member
    2209        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$148)
    2210        .dwattr $C$DW$143, DW_AT_name("$P$T8")
    2211        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T8")
    2212        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2213        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2214        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2215        .dwattr $C$DW$143, DW_AT_decl_line(0xaf)
    2216        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2217$C$DW$144       .dwtag  DW_TAG_member
    2218        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$32)
    2219        .dwattr $C$DW$144, DW_AT_name("rsvd24")
    2220        .dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd24")
    2221        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2222        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2223        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2224        .dwattr $C$DW$144, DW_AT_decl_line(0xbc)
    2225        .dwattr $C$DW$144, DW_AT_decl_column(0x0b)
    2226$C$DW$145       .dwtag  DW_TAG_member
    2227        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$150)
    2228        .dwattr $C$DW$145, DW_AT_name("$P$T9")
    2229        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T9")
    2230        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2231        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2232        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2233        .dwattr $C$DW$145, DW_AT_decl_line(0xc0)
    2234        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2235$C$DW$146       .dwtag  DW_TAG_member
    2236        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$33)
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   42

    2237        .dwattr $C$DW$146, DW_AT_name("rsvd2c")
    2238        .dwattr $C$DW$146, DW_AT_TI_symbol_name("rsvd2c")
    2239        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2240        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2241        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2242        .dwattr $C$DW$146, DW_AT_decl_line(0xcb)
    2243        .dwattr $C$DW$146, DW_AT_decl_column(0x0b)
    2244$C$DW$147       .dwtag  DW_TAG_member
    2245        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$152)
    2246        .dwattr $C$DW$147, DW_AT_name("$P$T10")
    2247        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T10")
    2248        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2249        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2250        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2251        .dwattr $C$DW$147, DW_AT_decl_line(0xcf)
    2252        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2253$C$DW$148       .dwtag  DW_TAG_member
    2254        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$154)
    2255        .dwattr $C$DW$148, DW_AT_name("$P$T11")
    2256        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T11")
    2257        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2258        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2259        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2260        .dwattr $C$DW$148, DW_AT_decl_line(0xda)
    2261        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2262$C$DW$149       .dwtag  DW_TAG_member
    2263        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$34)
    2264        .dwattr $C$DW$149, DW_AT_name("rsvd38")
    2265        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd38")
    2266        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2267        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2268        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2269        .dwattr $C$DW$149, DW_AT_decl_line(0xe5)
    2270        .dwattr $C$DW$149, DW_AT_decl_column(0x0b)
    2271$C$DW$150       .dwtag  DW_TAG_member
    2272        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$156)
    2273        .dwattr $C$DW$150, DW_AT_name("$P$T12")
    2274        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T12")
    2275        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2276        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2277        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2278        .dwattr $C$DW$150, DW_AT_decl_line(0xe8)
    2279        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2280        .dwendtag $C$DW$T$35
    2281
    2282        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2283        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2284        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2285$C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2286        .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$35)
    2287        .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    2288        .dwattr $C$DW$T$353, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2289        .dwattr $C$DW$T$353, DW_AT_decl_line(0xf0)
    2290        .dwattr $C$DW$T$353, DW_AT_decl_column(0x03)
    2291$C$DW$T$354     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   43

    2292        .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
    2293
    2294$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2295        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2296$C$DW$151       .dwtag  DW_TAG_member
    2297        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    2298        .dwattr $C$DW$151, DW_AT_name("REV_MINOR")
    2299        .dwattr $C$DW$151, DW_AT_TI_symbol_name("REV_MINOR")
    2300        .dwattr $C$DW$151, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2301        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2302        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2303        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2304        .dwattr $C$DW$151, DW_AT_decl_line(0x2d)
    2305        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2306$C$DW$152       .dwtag  DW_TAG_member
    2307        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2308        .dwattr $C$DW$152, DW_AT_name("REV_CUSTOM")
    2309        .dwattr $C$DW$152, DW_AT_TI_symbol_name("REV_CUSTOM")
    2310        .dwattr $C$DW$152, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2311        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2312        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2313        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2314        .dwattr $C$DW$152, DW_AT_decl_line(0x2e)
    2315        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2316$C$DW$153       .dwtag  DW_TAG_member
    2317        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2318        .dwattr $C$DW$153, DW_AT_name("REV_MAJOR")
    2319        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_MAJOR")
    2320        .dwattr $C$DW$153, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2321        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2323        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2324        .dwattr $C$DW$153, DW_AT_decl_line(0x2f)
    2325        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2326$C$DW$154       .dwtag  DW_TAG_member
    2327        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2328        .dwattr $C$DW$154, DW_AT_name("REV_RTL")
    2329        .dwattr $C$DW$154, DW_AT_TI_symbol_name("REV_RTL")
    2330        .dwattr $C$DW$154, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2331        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2333        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2334        .dwattr $C$DW$154, DW_AT_decl_line(0x30)
    2335        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2336$C$DW$155       .dwtag  DW_TAG_member
    2337        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2338        .dwattr $C$DW$155, DW_AT_name("REV_MODULE")
    2339        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_MODULE")
    2340        .dwattr $C$DW$155, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2341        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2342        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2343        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2344        .dwattr $C$DW$155, DW_AT_decl_line(0x31)
    2345        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2346$C$DW$156       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   44

    2347        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2348        .dwattr $C$DW$156, DW_AT_name("rsvd28")
    2349        .dwattr $C$DW$156, DW_AT_TI_symbol_name("rsvd28")
    2350        .dwattr $C$DW$156, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2351        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2353        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2354        .dwattr $C$DW$156, DW_AT_decl_line(0x32)
    2355        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2356$C$DW$157       .dwtag  DW_TAG_member
    2357        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2358        .dwattr $C$DW$157, DW_AT_name("REV_SCHEME")
    2359        .dwattr $C$DW$157, DW_AT_TI_symbol_name("REV_SCHEME")
    2360        .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2361        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2363        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2364        .dwattr $C$DW$157, DW_AT_decl_line(0x33)
    2365        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2366        .dwendtag $C$DW$T$36
    2367
    2368        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2369        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2370        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2371$C$DW$T$157     .dwtag  DW_TAG_volatile_type
    2372        .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$36)
    2373
    2374$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2375        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2376$C$DW$158       .dwtag  DW_TAG_member
    2377        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2378        .dwattr $C$DW$158, DW_AT_name("rsvd0")
    2379        .dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd0")
    2380        .dwattr $C$DW$158, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2381        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2382        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2383        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2384        .dwattr $C$DW$158, DW_AT_decl_line(0x3d)
    2385        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2386$C$DW$159       .dwtag  DW_TAG_member
    2387        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2388        .dwattr $C$DW$159, DW_AT_name("NEST_MODE")
    2389        .dwattr $C$DW$159, DW_AT_TI_symbol_name("NEST_MODE")
    2390        .dwattr $C$DW$159, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2391        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2392        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2393        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2394        .dwattr $C$DW$159, DW_AT_decl_line(0x3e)
    2395        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2396$C$DW$160       .dwtag  DW_TAG_member
    2397        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2398        .dwattr $C$DW$160, DW_AT_name("rsvd4")
    2399        .dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd4")
    2400        .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2401        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   45

    2402        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2403        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2404        .dwattr $C$DW$160, DW_AT_decl_line(0x3f)
    2405        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2406        .dwendtag $C$DW$T$37
    2407
    2408        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2409        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2410        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2411$C$DW$T$159     .dwtag  DW_TAG_volatile_type
    2412        .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$37)
    2413
    2414$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2415        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2416$C$DW$161       .dwtag  DW_TAG_member
    2417        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2418        .dwattr $C$DW$161, DW_AT_name("EN_HINT_ANY")
    2419        .dwattr $C$DW$161, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2420        .dwattr $C$DW$161, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2421        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2422        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2423        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2424        .dwattr $C$DW$161, DW_AT_decl_line(0x4c)
    2425        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2426$C$DW$162       .dwtag  DW_TAG_member
    2427        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2428        .dwattr $C$DW$162, DW_AT_name("rsvd1")
    2429        .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd1")
    2430        .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2431        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2433        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2434        .dwattr $C$DW$162, DW_AT_decl_line(0x4d)
    2435        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2436        .dwendtag $C$DW$T$38
    2437
    2438        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2439        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2440        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2441$C$DW$T$161     .dwtag  DW_TAG_volatile_type
    2442        .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$38)
    2443
    2444$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2445        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2446$C$DW$163       .dwtag  DW_TAG_member
    2447        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2448        .dwattr $C$DW$163, DW_AT_name("GLB_NEST_LEVEL")
    2449        .dwattr $C$DW$163, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2450        .dwattr $C$DW$163, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2451        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2453        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2454        .dwattr $C$DW$163, DW_AT_decl_line(0x5a)
    2455        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2456$C$DW$164       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   46

    2457        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2458        .dwattr $C$DW$164, DW_AT_name("rsvd9")
    2459        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd9")
    2460        .dwattr $C$DW$164, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2461        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2463        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2464        .dwattr $C$DW$164, DW_AT_decl_line(0x5b)
    2465        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2466$C$DW$165       .dwtag  DW_TAG_member
    2467        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2468        .dwattr $C$DW$165, DW_AT_name("AUTO_OVERRIDE")
    2469        .dwattr $C$DW$165, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2470        .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2471        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2473        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2474        .dwattr $C$DW$165, DW_AT_decl_line(0x5c)
    2475        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2476        .dwendtag $C$DW$T$39
    2477
    2478        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2479        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2480        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2481$C$DW$T$163     .dwtag  DW_TAG_volatile_type
    2482        .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$39)
    2483
    2484$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2485        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2486$C$DW$166       .dwtag  DW_TAG_member
    2487        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2488        .dwattr $C$DW$166, DW_AT_name("STS_SET_IDX")
    2489        .dwattr $C$DW$166, DW_AT_TI_symbol_name("STS_SET_IDX")
    2490        .dwattr $C$DW$166, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2491        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2493        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2494        .dwattr $C$DW$166, DW_AT_decl_line(0x66)
    2495        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2496$C$DW$167       .dwtag  DW_TAG_member
    2497        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2498        .dwattr $C$DW$167, DW_AT_name("rsvd10")
    2499        .dwattr $C$DW$167, DW_AT_TI_symbol_name("rsvd10")
    2500        .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2501        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2503        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2504        .dwattr $C$DW$167, DW_AT_decl_line(0x67)
    2505        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2506        .dwendtag $C$DW$T$40
    2507
    2508        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2509        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    2510        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2511$C$DW$T$165     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sat Apr 14 22:56:01 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   47

    2512        .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$40)
    2513
    2514$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2515        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2516$C$DW$168       .dwtag  DW_TAG_member
    2517        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2518        .dwattr $C$DW$168, DW_AT_name("STS_CLR_IDX")
    2519        .dwattr $C$DW$168, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2520        .dwattr $C$DW$168, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2521        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2522        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2523        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2524        .dwattr $C$DW$168, DW_AT_decl_line(0x71)
    2525        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2526$C$DW$169       .dwtag  DW_TAG_member
    2527        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2528        .dwattr $C$DW$169, DW_AT_name("rsvd10")
    2529        .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd10")
    2530        .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2531        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2533        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2534        .dwattr $C$DW$169, DW_AT_decl_line(0x72)
    2535        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2536        .dwendtag $C$DW$T$41
    2537
    2538        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2539        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2540        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2541$C$DW$T$167     .dwtag  DW_TAG_volatile_type
    2542        .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$41)
    2543
