PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Fri Apr 13 20:44:07 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14
      15$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("pru_rpmsg_init")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("pru_rpmsg_init")
      17        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$318)
      18        .dwattr $C$DW$1, DW_AT_declaration
      19        .dwattr $C$DW$1, DW_AT_external

     389;*   Loop closing brace source line  : 103
     390;*   Known Minimum Trip Count        : 1
     391;*   Known Maximum Trip Count        : 4294967295
     392;*   Known Max Trip Count Factor     : 1
     393;* --------------------------------------------------------------------------*
     394 0000009c                 ||$C$L4||:    
     395        .dwpsn  file "main1.c",line 100,column 11,is_stmt,isa 0
     396;----------------------------------------------------------------------
     397; 100 | while (pru_rpmsg_receive(&transport, &src, &dst, payload, &len) == PRU_
     398;     | RPMSG_SUCCESS) {                                                       
     399;----------------------------------------------------------------------
     400 0000009c 0000000106E2EE          ADD       r14, r2, 6            ; [ALU_PRU] |100| transport,transport
     401 000000a0 0000000104E2EF          ADD       r15, r2, 4            ; [ALU_PRU] |100| src,src
     402 000000a4 0000000102E2F0          ADD       r16, r2, 2            ; [ALU_PRU] |100| dst,dst
     403 000000a8 00000010E5E5F1          MOV       r17, r5               ; [ALU_PRU] |100| $O$K37
     404 000000ac 0000000100E2F2          ADD       r18, r2, 0            ; [ALU_PRU] |100| len,len
     405$C$DW$37        .dwtag  DW_TAG_TI_branch
     406        .dwattr $C$DW$37, DW_AT_low_pc(0x00)
     407        .dwattr $C$DW$37, DW_AT_name("pru_rpmsg_receive")
     408        .dwattr $C$DW$37, DW_AT_TI_call
     409 000000b0 000000230000C3!         JAL       r3.w2, ||pru_rpmsg_receive|| ; [ALU_PRU] |100| pru_rpmsg_receive
     410 000000b4 0000006F008EF3          QBNE      ||$C$L3||, r14.w0, 0x00 ; [ALU_PRU] |100| 
     411;* --------------------------------------------------------------------------*
     412        .dwpsn  file "main1.c",line 102,column 5,is_stmt,isa 0
     413;----------------------------------------------------------------------
     414; 102 | pru_rpmsg_send(&transport, dst, src, payload, len);                    
     415;----------------------------------------------------------------------
     416 000000b8 000000F1020280          LBBO      &r0.w0, r2, 2, 2      ; [ALU_PRU] |102| dst
     417 000000bc 0000000106E2EE          ADD       r14, r2, 6            ; [ALU_PRU] |102| transport,transport
     418 000000c0 00000010E5E5F1          MOV       r17, r5               ; [ALU_PRU] |102| $O$K37
     419 000000c4 000000F1000292          LBBO      &r18.w0, r2, 0, 2     ; [ALU_PRU] |102| len
     420 000000c8 000000108080EF          MOV       r15, r0.w0            ; [ALU_PRU] |102| 
     421 000000cc 000000F1040280          LBBO      &r0.w0, r2, 4, 2      ; [ALU_PRU] |102| src
     422 000000d0 000000108080F0          MOV       r16, r0.w0            ; [ALU_PRU] |102| 
     423$C$DW$38        .dwtag  DW_TAG_TI_branch
     424        .dwattr $C$DW$38, DW_AT_low_pc(0x00)
     425        .dwattr $C$DW$38, DW_AT_name("pru_rpmsg_send")
     426        .dwattr $C$DW$38, DW_AT_TI_call
     427 000000d4 000000230000C3!         JAL       r3.w2, ||pru_rpmsg_send|| ; [ALU_PRU] |102| pru_rpmsg_send
     428 000000d8 00000021000000!         JMP       ||$C$L4||             ; [ALU_PRU] |102| 
     429;* --------------------------------------------------------------------------*
     430        .dwattr $C$DW$30, DW_AT_TI_end_file("main1.c")
     431        .dwattr $C$DW$30, DW_AT_TI_end_line(0x6a)
     432        .dwattr $C$DW$30, DW_AT_TI_end_column(0x01)
     433        .dwendentry
     434        .dwendtag $C$DW$30
     435
     436;******************************************************************************
     437;* STRINGS                                                                    *
     438;******************************************************************************
     439 00000000                         .sect   ".rodata:.string"
     440 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE    9

         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
     441 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000031 
         00000014 00000000000000 
     442;*****************************************************************************
     443;* UNDEFINED EXTERNAL REFERENCES                                             *
     444;*****************************************************************************
     445        .global ||pru_rpmsg_init||
     446        .global ||pru_rpmsg_receive||
     447        .global ||pru_rpmsg_send||
     448        .global ||pru_rpmsg_channel||
     449
     450;******************************************************************************
     451;* TYPE INFORMATION                                                           *
     452;******************************************************************************
     453
     454$C$DW$T$19      .dwtag  DW_TAG_structure_type
     455        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     456$C$DW$39        .dwtag  DW_TAG_member
     457        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     458        .dwattr $C$DW$39, DW_AT_name("REVID")
     459        .dwattr $C$DW$39, DW_AT_TI_symbol_name("REVID")
     460        .dwattr $C$DW$39, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     461        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     463        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     464        .dwattr $C$DW$39, DW_AT_decl_line(0x2d)
     465        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     466        .dwendtag $C$DW$T$19
     467
     468        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     469        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     470        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     471$C$DW$T$108     .dwtag  DW_TAG_volatile_type
     472        .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$19)
     473
     474$C$DW$T$20      .dwtag  DW_TAG_structure_type
     475        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     476$C$DW$40        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   10

     477        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     478        .dwattr $C$DW$40, DW_AT_name("IDLE_MODE")
     479        .dwattr $C$DW$40, DW_AT_TI_symbol_name("IDLE_MODE")
     480        .dwattr $C$DW$40, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     481        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     482        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     483        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     484        .dwattr $C$DW$40, DW_AT_decl_line(0x37)
     485        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     486$C$DW$41        .dwtag  DW_TAG_member
     487        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     488        .dwattr $C$DW$41, DW_AT_name("STANDBY_MODE")
     489        .dwattr $C$DW$41, DW_AT_TI_symbol_name("STANDBY_MODE")
     490        .dwattr $C$DW$41, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     491        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     493        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     494        .dwattr $C$DW$41, DW_AT_decl_line(0x38)
     495        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     496$C$DW$42        .dwtag  DW_TAG_member
     497        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     498        .dwattr $C$DW$42, DW_AT_name("STANDBY_INIT")
     499        .dwattr $C$DW$42, DW_AT_TI_symbol_name("STANDBY_INIT")
     500        .dwattr $C$DW$42, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     501        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     502        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     503        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     504        .dwattr $C$DW$42, DW_AT_decl_line(0x39)
     505        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     506$C$DW$43        .dwtag  DW_TAG_member
     507        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     508        .dwattr $C$DW$43, DW_AT_name("SUB_MWAIT")
     509        .dwattr $C$DW$43, DW_AT_TI_symbol_name("SUB_MWAIT")
     510        .dwattr $C$DW$43, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     511        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     513        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     514        .dwattr $C$DW$43, DW_AT_decl_line(0x3a)
     515        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     516$C$DW$44        .dwtag  DW_TAG_member
     517        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     518        .dwattr $C$DW$44, DW_AT_name("rsvd6")
     519        .dwattr $C$DW$44, DW_AT_TI_symbol_name("rsvd6")
     520        .dwattr $C$DW$44, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     521        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     523        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     524        .dwattr $C$DW$44, DW_AT_decl_line(0x3b)
     525        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     526        .dwendtag $C$DW$T$20
     527
     528        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     529        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     530        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     531$C$DW$T$110     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   11

     532        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$20)
     533
     534$C$DW$T$21      .dwtag  DW_TAG_structure_type
     535        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     536$C$DW$45        .dwtag  DW_TAG_member
     537        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     538        .dwattr $C$DW$45, DW_AT_name("PRU0_GPI_MODE")
     539        .dwattr $C$DW$45, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     540        .dwattr $C$DW$45, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     541        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     543        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     544        .dwattr $C$DW$45, DW_AT_decl_line(0x45)
     545        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     546$C$DW$46        .dwtag  DW_TAG_member
     547        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     548        .dwattr $C$DW$46, DW_AT_name("PRU0_GPI_CLK_MODE")
     549        .dwattr $C$DW$46, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     550        .dwattr $C$DW$46, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     551        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     553        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     554        .dwattr $C$DW$46, DW_AT_decl_line(0x46)
     555        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     556$C$DW$47        .dwtag  DW_TAG_member
     557        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     558        .dwattr $C$DW$47, DW_AT_name("PRU0_GPI_DIV0")
     559        .dwattr $C$DW$47, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     560        .dwattr $C$DW$47, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     561        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     563        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     564        .dwattr $C$DW$47, DW_AT_decl_line(0x47)
     565        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     566$C$DW$48        .dwtag  DW_TAG_member
     567        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     568        .dwattr $C$DW$48, DW_AT_name("PRU0_GPI_DIV1")
     569        .dwattr $C$DW$48, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     570        .dwattr $C$DW$48, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     571        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     573        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     574        .dwattr $C$DW$48, DW_AT_decl_line(0x48)
     575        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     576$C$DW$49        .dwtag  DW_TAG_member
     577        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     578        .dwattr $C$DW$49, DW_AT_name("PRU0_GPI_SB")
     579        .dwattr $C$DW$49, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     580        .dwattr $C$DW$49, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     581        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     583        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     584        .dwattr $C$DW$49, DW_AT_decl_line(0x49)
     585        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     586$C$DW$50        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   12

     587        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     588        .dwattr $C$DW$50, DW_AT_name("PRU0_GPO_MODE")
     589        .dwattr $C$DW$50, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     590        .dwattr $C$DW$50, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     591        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     593        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     594        .dwattr $C$DW$50, DW_AT_decl_line(0x4a)
     595        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     596$C$DW$51        .dwtag  DW_TAG_member
     597        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     598        .dwattr $C$DW$51, DW_AT_name("PRU0_GPO_DIV0")
     599        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     600        .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     601        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     603        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     604        .dwattr $C$DW$51, DW_AT_decl_line(0x4b)
     605        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     606$C$DW$52        .dwtag  DW_TAG_member
     607        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     608        .dwattr $C$DW$52, DW_AT_name("PRU0_GPO_DIV1")
     609        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     610        .dwattr $C$DW$52, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     611        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     613        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     614        .dwattr $C$DW$52, DW_AT_decl_line(0x4c)
     615        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     616$C$DW$53        .dwtag  DW_TAG_member
     617        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     618        .dwattr $C$DW$53, DW_AT_name("PRU0_GPO_SH_SEL")
     619        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     620        .dwattr $C$DW$53, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     621        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     623        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     624        .dwattr $C$DW$53, DW_AT_decl_line(0x4d)
     625        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     626$C$DW$54        .dwtag  DW_TAG_member
     627        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     628        .dwattr $C$DW$54, DW_AT_name("rsvd26")
     629        .dwattr $C$DW$54, DW_AT_TI_symbol_name("rsvd26")
     630        .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     631        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     633        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     634        .dwattr $C$DW$54, DW_AT_decl_line(0x4e)
     635        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     636        .dwendtag $C$DW$T$21
     637
     638        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     639        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     640        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     641$C$DW$T$112     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   13

     642        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$21)
     643
     644$C$DW$T$22      .dwtag  DW_TAG_structure_type
     645        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     646$C$DW$55        .dwtag  DW_TAG_member
     647        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     648        .dwattr $C$DW$55, DW_AT_name("PRU1_GPI_MODE")
     649        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     650        .dwattr $C$DW$55, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     651        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     653        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     654        .dwattr $C$DW$55, DW_AT_decl_line(0x58)
     655        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     656$C$DW$56        .dwtag  DW_TAG_member
     657        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     658        .dwattr $C$DW$56, DW_AT_name("PRU1_GPI_CLK_MODE")
     659        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     660        .dwattr $C$DW$56, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     661        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     663        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     664        .dwattr $C$DW$56, DW_AT_decl_line(0x59)
     665        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     666$C$DW$57        .dwtag  DW_TAG_member
     667        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     668        .dwattr $C$DW$57, DW_AT_name("PRU1_GPI_DIV0")
     669        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     670        .dwattr $C$DW$57, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     671        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     673        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     674        .dwattr $C$DW$57, DW_AT_decl_line(0x5a)
     675        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     676$C$DW$58        .dwtag  DW_TAG_member
     677        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     678        .dwattr $C$DW$58, DW_AT_name("PRU1_GPI_DIV1")
     679        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     680        .dwattr $C$DW$58, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     681        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     682        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     683        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     684        .dwattr $C$DW$58, DW_AT_decl_line(0x5b)
     685        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     686$C$DW$59        .dwtag  DW_TAG_member
     687        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     688        .dwattr $C$DW$59, DW_AT_name("PRU1_GPI_SB")
     689        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     690        .dwattr $C$DW$59, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     691        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     693        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     694        .dwattr $C$DW$59, DW_AT_decl_line(0x5c)
     695        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     696$C$DW$60        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   14

     697        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     698        .dwattr $C$DW$60, DW_AT_name("PRU1_GPO_MODE")
     699        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     700        .dwattr $C$DW$60, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     701        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     702        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     703        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     704        .dwattr $C$DW$60, DW_AT_decl_line(0x5d)
     705        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     706$C$DW$61        .dwtag  DW_TAG_member
     707        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     708        .dwattr $C$DW$61, DW_AT_name("PRU1_GPO_DIV0")
     709        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     710        .dwattr $C$DW$61, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     711        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     713        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     714        .dwattr $C$DW$61, DW_AT_decl_line(0x5e)
     715        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     716$C$DW$62        .dwtag  DW_TAG_member
     717        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     718        .dwattr $C$DW$62, DW_AT_name("PRU1_GPO_DIV1")
     719        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     720        .dwattr $C$DW$62, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     721        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     723        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     724        .dwattr $C$DW$62, DW_AT_decl_line(0x5f)
     725        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     726$C$DW$63        .dwtag  DW_TAG_member
     727        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     728        .dwattr $C$DW$63, DW_AT_name("PRU1_GPO_SH_SEL")
     729        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     730        .dwattr $C$DW$63, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     731        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     733        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     734        .dwattr $C$DW$63, DW_AT_decl_line(0x60)
     735        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     736$C$DW$64        .dwtag  DW_TAG_member
     737        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     738        .dwattr $C$DW$64, DW_AT_name("rsvd26")
     739        .dwattr $C$DW$64, DW_AT_TI_symbol_name("rsvd26")
     740        .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     741        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     742        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     743        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     744        .dwattr $C$DW$64, DW_AT_decl_line(0x61)
     745        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     746        .dwendtag $C$DW$T$22
     747
     748        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     749        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     750        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     751$C$DW$T$114     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   15

     752        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$22)
     753
     754$C$DW$T$23      .dwtag  DW_TAG_structure_type
     755        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     756$C$DW$65        .dwtag  DW_TAG_member
     757        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     758        .dwattr $C$DW$65, DW_AT_name("PRU0_CLK_STOP_REQ")
     759        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     760        .dwattr $C$DW$65, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     761        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     763        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     764        .dwattr $C$DW$65, DW_AT_decl_line(0x6b)
     765        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     766$C$DW$66        .dwtag  DW_TAG_member
     767        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     768        .dwattr $C$DW$66, DW_AT_name("PRU0_CLK_STOP_ACK")
     769        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     770        .dwattr $C$DW$66, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     771        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     773        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     774        .dwattr $C$DW$66, DW_AT_decl_line(0x6c)
     775        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     776$C$DW$67        .dwtag  DW_TAG_member
     777        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     778        .dwattr $C$DW$67, DW_AT_name("PRU0_CLK_EN")
     779        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     780        .dwattr $C$DW$67, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     781        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     782        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     783        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     784        .dwattr $C$DW$67, DW_AT_decl_line(0x6d)
     785        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     786$C$DW$68        .dwtag  DW_TAG_member
     787        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     788        .dwattr $C$DW$68, DW_AT_name("PRU1_CLK_STOP_REQ")
     789        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     790        .dwattr $C$DW$68, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     791        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     793        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     794        .dwattr $C$DW$68, DW_AT_decl_line(0x6e)
     795        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     796$C$DW$69        .dwtag  DW_TAG_member
     797        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     798        .dwattr $C$DW$69, DW_AT_name("PRU1_CLK_STOP_ACK")
     799        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     800        .dwattr $C$DW$69, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     801        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     803        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     804        .dwattr $C$DW$69, DW_AT_decl_line(0x6f)
     805        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     806$C$DW$70        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   16

     807        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     808        .dwattr $C$DW$70, DW_AT_name("PRU1_CLK_EN")
     809        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     810        .dwattr $C$DW$70, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     811        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     812        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     813        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     814        .dwattr $C$DW$70, DW_AT_decl_line(0x70)
     815        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     816$C$DW$71        .dwtag  DW_TAG_member
     817        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     818        .dwattr $C$DW$71, DW_AT_name("INTC_CLK_STOP_REQ")
     819        .dwattr $C$DW$71, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     820        .dwattr $C$DW$71, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     821        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     823        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     824        .dwattr $C$DW$71, DW_AT_decl_line(0x71)
     825        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     826$C$DW$72        .dwtag  DW_TAG_member
     827        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     828        .dwattr $C$DW$72, DW_AT_name("INTC_CLK_STOP_ACK")
     829        .dwattr $C$DW$72, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     830        .dwattr $C$DW$72, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     831        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     833        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     834        .dwattr $C$DW$72, DW_AT_decl_line(0x72)
     835        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     836$C$DW$73        .dwtag  DW_TAG_member
     837        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     838        .dwattr $C$DW$73, DW_AT_name("INTC_CLK_EN")
     839        .dwattr $C$DW$73, DW_AT_TI_symbol_name("INTC_CLK_EN")
     840        .dwattr $C$DW$73, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     841        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     843        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     844        .dwattr $C$DW$73, DW_AT_decl_line(0x73)
     845        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     846$C$DW$74        .dwtag  DW_TAG_member
     847        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     848        .dwattr $C$DW$74, DW_AT_name("UART_CLK_STOP_REQ")
     849        .dwattr $C$DW$74, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     850        .dwattr $C$DW$74, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     851        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     853        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     854        .dwattr $C$DW$74, DW_AT_decl_line(0x74)
     855        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     856$C$DW$75        .dwtag  DW_TAG_member
     857        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     858        .dwattr $C$DW$75, DW_AT_name("UART_CLK_STOP_ACK")
     859        .dwattr $C$DW$75, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     860        .dwattr $C$DW$75, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     861        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   17

     862        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     863        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     864        .dwattr $C$DW$75, DW_AT_decl_line(0x75)
     865        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     866$C$DW$76        .dwtag  DW_TAG_member
     867        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     868        .dwattr $C$DW$76, DW_AT_name("UART_CLK_EN")
     869        .dwattr $C$DW$76, DW_AT_TI_symbol_name("UART_CLK_EN")
     870        .dwattr $C$DW$76, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     871        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     873        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     874        .dwattr $C$DW$76, DW_AT_decl_line(0x76)
     875        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     876$C$DW$77        .dwtag  DW_TAG_member
     877        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     878        .dwattr $C$DW$77, DW_AT_name("ECAP_CLK_STOP_REQ")
     879        .dwattr $C$DW$77, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     880        .dwattr $C$DW$77, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     881        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     883        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     884        .dwattr $C$DW$77, DW_AT_decl_line(0x77)
     885        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     886$C$DW$78        .dwtag  DW_TAG_member
     887        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     888        .dwattr $C$DW$78, DW_AT_name("ECAP_CLK_STOP_ACK")
     889        .dwattr $C$DW$78, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     890        .dwattr $C$DW$78, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     891        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     893        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     894        .dwattr $C$DW$78, DW_AT_decl_line(0x78)
     895        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     896$C$DW$79        .dwtag  DW_TAG_member
     897        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
     898        .dwattr $C$DW$79, DW_AT_name("ECAP_CLK_EN")
     899        .dwattr $C$DW$79, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     900        .dwattr $C$DW$79, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     901        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     903        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     904        .dwattr $C$DW$79, DW_AT_decl_line(0x79)
     905        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     906$C$DW$80        .dwtag  DW_TAG_member
     907        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
     908        .dwattr $C$DW$80, DW_AT_name("IEP_CLK_STOP_REQ")
     909        .dwattr $C$DW$80, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     910        .dwattr $C$DW$80, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     911        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     913        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     914        .dwattr $C$DW$80, DW_AT_decl_line(0x7a)
     915        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
     916$C$DW$81        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   18

     917        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
     918        .dwattr $C$DW$81, DW_AT_name("IEP_CLK_STOP_ACK")
     919        .dwattr $C$DW$81, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     920        .dwattr $C$DW$81, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     921        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     923        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     924        .dwattr $C$DW$81, DW_AT_decl_line(0x7b)
     925        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
     926$C$DW$82        .dwtag  DW_TAG_member
     927        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
     928        .dwattr $C$DW$82, DW_AT_name("IEP_CLK_EN")
     929        .dwattr $C$DW$82, DW_AT_TI_symbol_name("IEP_CLK_EN")
     930        .dwattr $C$DW$82, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     931        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     933        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     934        .dwattr $C$DW$82, DW_AT_decl_line(0x7c)
     935        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
     936$C$DW$83        .dwtag  DW_TAG_member
     937        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
     938        .dwattr $C$DW$83, DW_AT_name("rsvd18")
     939        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd18")
     940        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     941        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     943        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     944        .dwattr $C$DW$83, DW_AT_decl_line(0x7d)
     945        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
     946        .dwendtag $C$DW$T$23
     947
     948        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     949        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     950        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     951$C$DW$T$116     .dwtag  DW_TAG_volatile_type
     952        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
     953
     954$C$DW$T$24      .dwtag  DW_TAG_structure_type
     955        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     956$C$DW$84        .dwtag  DW_TAG_member
     957        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
     958        .dwattr $C$DW$84, DW_AT_name("PRU0_IMEM_PE_RAW")
     959        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     960        .dwattr $C$DW$84, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     961        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     963        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     964        .dwattr $C$DW$84, DW_AT_decl_line(0x87)
     965        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
     966$C$DW$85        .dwtag  DW_TAG_member
     967        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
     968        .dwattr $C$DW$85, DW_AT_name("PRU0_DMEM_PE_RAW")
     969        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     970        .dwattr $C$DW$85, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     971        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   19

     972        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     973        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     974        .dwattr $C$DW$85, DW_AT_decl_line(0x88)
     975        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
     976$C$DW$86        .dwtag  DW_TAG_member
     977        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
     978        .dwattr $C$DW$86, DW_AT_name("PRU1_IMEM_PE_RAW")
     979        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     980        .dwattr $C$DW$86, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     981        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     983        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     984        .dwattr $C$DW$86, DW_AT_decl_line(0x89)
     985        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
     986$C$DW$87        .dwtag  DW_TAG_member
     987        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
     988        .dwattr $C$DW$87, DW_AT_name("PRU1_DMEM_PE_RAW")
     989        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     990        .dwattr $C$DW$87, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     991        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     993        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     994        .dwattr $C$DW$87, DW_AT_decl_line(0x8a)
     995        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
     996$C$DW$88        .dwtag  DW_TAG_member
     997        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
     998        .dwattr $C$DW$88, DW_AT_name("RAM_PE_RAW")
     999        .dwattr $C$DW$88, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1000        .dwattr $C$DW$88, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1001        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1003        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1004        .dwattr $C$DW$88, DW_AT_decl_line(0x8b)
    1005        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1006$C$DW$89        .dwtag  DW_TAG_member
    1007        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1008        .dwattr $C$DW$89, DW_AT_name("rsvd20")
    1009        .dwattr $C$DW$89, DW_AT_TI_symbol_name("rsvd20")
    1010        .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1011        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1013        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1014        .dwattr $C$DW$89, DW_AT_decl_line(0x8c)
    1015        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1016        .dwendtag $C$DW$T$24
    1017
    1018        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1019        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1020        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1021$C$DW$T$118     .dwtag  DW_TAG_volatile_type
    1022        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$24)
    1023
    1024$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1025        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1026$C$DW$90        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   20

    1027        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1028        .dwattr $C$DW$90, DW_AT_name("PRU0_IMEM_PE")
    1029        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1030        .dwattr $C$DW$90, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1031        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1033        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1034        .dwattr $C$DW$90, DW_AT_decl_line(0x96)
    1035        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1036$C$DW$91        .dwtag  DW_TAG_member
    1037        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1038        .dwattr $C$DW$91, DW_AT_name("PRU0_DMEM_PE")
    1039        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1040        .dwattr $C$DW$91, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1041        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1043        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1044        .dwattr $C$DW$91, DW_AT_decl_line(0x97)
    1045        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1046$C$DW$92        .dwtag  DW_TAG_member
    1047        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1048        .dwattr $C$DW$92, DW_AT_name("PRU1_IMEM_PE")
    1049        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1050        .dwattr $C$DW$92, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1051        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1053        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1054        .dwattr $C$DW$92, DW_AT_decl_line(0x98)
    1055        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1056$C$DW$93        .dwtag  DW_TAG_member
    1057        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1058        .dwattr $C$DW$93, DW_AT_name("PRU1_DMEM_PE")
    1059        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1060        .dwattr $C$DW$93, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1061        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1063        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1064        .dwattr $C$DW$93, DW_AT_decl_line(0x99)
    1065        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1066$C$DW$94        .dwtag  DW_TAG_member
    1067        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1068        .dwattr $C$DW$94, DW_AT_name("RAM_PE")
    1069        .dwattr $C$DW$94, DW_AT_TI_symbol_name("RAM_PE")
    1070        .dwattr $C$DW$94, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1071        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1073        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1074        .dwattr $C$DW$94, DW_AT_decl_line(0x9a)
    1075        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1076$C$DW$95        .dwtag  DW_TAG_member
    1077        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1078        .dwattr $C$DW$95, DW_AT_name("rsvd20")
    1079        .dwattr $C$DW$95, DW_AT_TI_symbol_name("rsvd20")
    1080        .dwattr $C$DW$95, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1081        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   21

    1082        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1083        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1084        .dwattr $C$DW$95, DW_AT_decl_line(0x9b)
    1085        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1086        .dwendtag $C$DW$T$25
    1087
    1088        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1089        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1090        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1091$C$DW$T$120     .dwtag  DW_TAG_volatile_type
    1092        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    1093
    1094$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1095        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1096$C$DW$96        .dwtag  DW_TAG_member
    1097        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1098        .dwattr $C$DW$96, DW_AT_name("PRU0_IMEM_PE_SET")
    1099        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1100        .dwattr $C$DW$96, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1101        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1103        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1104        .dwattr $C$DW$96, DW_AT_decl_line(0xa4)
    1105        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1106$C$DW$97        .dwtag  DW_TAG_member
    1107        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1108        .dwattr $C$DW$97, DW_AT_name("PRU0_DMEM_PE_SET")
    1109        .dwattr $C$DW$97, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1110        .dwattr $C$DW$97, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1111        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1113        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1114        .dwattr $C$DW$97, DW_AT_decl_line(0xa5)
    1115        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1116$C$DW$98        .dwtag  DW_TAG_member
    1117        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1118        .dwattr $C$DW$98, DW_AT_name("PRU1_IMEM_PE_SET")
    1119        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1120        .dwattr $C$DW$98, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1121        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1123        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1124        .dwattr $C$DW$98, DW_AT_decl_line(0xa6)
    1125        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1126$C$DW$99        .dwtag  DW_TAG_member
    1127        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1128        .dwattr $C$DW$99, DW_AT_name("PRU1_DMEM_PE_SET")
    1129        .dwattr $C$DW$99, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1130        .dwattr $C$DW$99, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1131        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1133        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1134        .dwattr $C$DW$99, DW_AT_decl_line(0xa7)
    1135        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1136$C$DW$100       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   22

    1137        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1138        .dwattr $C$DW$100, DW_AT_name("RAM_PE_SET")
    1139        .dwattr $C$DW$100, DW_AT_TI_symbol_name("RAM_PE_SET")
    1140        .dwattr $C$DW$100, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1141        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1143        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1144        .dwattr $C$DW$100, DW_AT_decl_line(0xa8)
    1145        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1146$C$DW$101       .dwtag  DW_TAG_member
    1147        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1148        .dwattr $C$DW$101, DW_AT_name("rsvd20")
    1149        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd20")
    1150        .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1151        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1152        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1153        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1154        .dwattr $C$DW$101, DW_AT_decl_line(0xa9)
    1155        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1156        .dwendtag $C$DW$T$26
    1157
    1158        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1159        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1160        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1161$C$DW$T$122     .dwtag  DW_TAG_volatile_type
    1162        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$26)
    1163
    1164$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1165        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1166$C$DW$102       .dwtag  DW_TAG_member
    1167        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1168        .dwattr $C$DW$102, DW_AT_name("PRU0_IMEM_PE_CLR")
    1169        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1170        .dwattr $C$DW$102, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1171        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1173        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1174        .dwattr $C$DW$102, DW_AT_decl_line(0xb3)
    1175        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1176$C$DW$103       .dwtag  DW_TAG_member
    1177        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1178        .dwattr $C$DW$103, DW_AT_name("PRU0_DMEM_PE_CLR")
    1179        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1180        .dwattr $C$DW$103, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1181        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1183        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1184        .dwattr $C$DW$103, DW_AT_decl_line(0xb4)
    1185        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1186$C$DW$104       .dwtag  DW_TAG_member
    1187        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1188        .dwattr $C$DW$104, DW_AT_name("PRU1_IMEM_PE_CLR")
    1189        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1190        .dwattr $C$DW$104, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1191        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   23

    1192        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1193        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1194        .dwattr $C$DW$104, DW_AT_decl_line(0xb5)
    1195        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1196$C$DW$105       .dwtag  DW_TAG_member
    1197        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1198        .dwattr $C$DW$105, DW_AT_name("PRU1_DMEM_PE_CLR")
    1199        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1200        .dwattr $C$DW$105, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1201        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1203        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1204        .dwattr $C$DW$105, DW_AT_decl_line(0xb6)
    1205        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1206$C$DW$106       .dwtag  DW_TAG_member
    1207        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1208        .dwattr $C$DW$106, DW_AT_name("rsvd16")
    1209        .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd16")
    1210        .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1211        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1213        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1214        .dwattr $C$DW$106, DW_AT_decl_line(0xb7)
    1215        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1216        .dwendtag $C$DW$T$27
    1217
    1218        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1219        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1220        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1221$C$DW$T$124     .dwtag  DW_TAG_volatile_type
    1222        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$27)
    1223
    1224$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1225        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1226$C$DW$107       .dwtag  DW_TAG_member
    1227        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1228        .dwattr $C$DW$107, DW_AT_name("PMAO_PRU0")
    1229        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PMAO_PRU0")
    1230        .dwattr $C$DW$107, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1231        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1233        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1234        .dwattr $C$DW$107, DW_AT_decl_line(0xc4)
    1235        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1236$C$DW$108       .dwtag  DW_TAG_member
    1237        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1238        .dwattr $C$DW$108, DW_AT_name("PMAO_PRU1")
    1239        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PMAO_PRU1")
    1240        .dwattr $C$DW$108, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1241        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1243        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1244        .dwattr $C$DW$108, DW_AT_decl_line(0xc5)
    1245        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1246$C$DW$109       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   24

    1247        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1248        .dwattr $C$DW$109, DW_AT_name("rsvd2")
    1249        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd2")
    1250        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1251        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1253        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1254        .dwattr $C$DW$109, DW_AT_decl_line(0xc6)
    1255        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1256        .dwendtag $C$DW$T$28
    1257
    1258        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1259        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1260        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1261$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1262        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$28)
    1263
    1264$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1265        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1266$C$DW$110       .dwtag  DW_TAG_member
    1267        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1268        .dwattr $C$DW$110, DW_AT_name("OCP_EN")
    1269        .dwattr $C$DW$110, DW_AT_TI_symbol_name("OCP_EN")
    1270        .dwattr $C$DW$110, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1271        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1273        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1274        .dwattr $C$DW$110, DW_AT_decl_line(0xd3)
    1275        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1276$C$DW$111       .dwtag  DW_TAG_member
    1277        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1278        .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1279        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd1")
    1280        .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1281        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1283        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1284        .dwattr $C$DW$111, DW_AT_decl_line(0xd4)
    1285        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1286        .dwendtag $C$DW$T$29
    1287
    1288        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1289        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1290        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1291$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1292        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$29)
    1293
    1294$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1295        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1296$C$DW$112       .dwtag  DW_TAG_member
    1297        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1298        .dwattr $C$DW$112, DW_AT_name("PRU1_PAD_HP_EN")
    1299        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1300        .dwattr $C$DW$112, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1301        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   25

    1302        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1303        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1304        .dwattr $C$DW$112, DW_AT_decl_line(0xde)
    1305        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1306$C$DW$113       .dwtag  DW_TAG_member
    1307        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1308        .dwattr $C$DW$113, DW_AT_name("XFR_SHIFT_EN")
    1309        .dwattr $C$DW$113, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1310        .dwattr $C$DW$113, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1311        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1313        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1314        .dwattr $C$DW$113, DW_AT_decl_line(0xdf)
    1315        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1316$C$DW$114       .dwtag  DW_TAG_member
    1317        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1318        .dwattr $C$DW$114, DW_AT_name("rsvd2")
    1319        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd2")
    1320        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1321        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1323        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1324        .dwattr $C$DW$114, DW_AT_decl_line(0xe0)
    1325        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1326        .dwendtag $C$DW$T$30
    1327
    1328        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1329        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1330        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1331$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    1332        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$30)
    1333
    1334$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1335        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1336$C$DW$115       .dwtag  DW_TAG_member
    1337        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1338        .dwattr $C$DW$115, DW_AT_name("PIN_MUX_SEL")
    1339        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1340        .dwattr $C$DW$115, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1341        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1343        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1344        .dwattr $C$DW$115, DW_AT_decl_line(0xec)
    1345        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1346$C$DW$116       .dwtag  DW_TAG_member
    1347        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1348        .dwattr $C$DW$116, DW_AT_name("rsvd2")
    1349        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd2")
    1350        .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1351        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1353        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1354        .dwattr $C$DW$116, DW_AT_decl_line(0xed)
    1355        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1356        .dwendtag $C$DW$T$31
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   26

    1357
    1358        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1359        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1360        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1361$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    1362        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    1363
    1364$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1365        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1366$C$DW$117       .dwtag  DW_TAG_member
    1367        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$109)
    1368        .dwattr $C$DW$117, DW_AT_name("$P$T0")
    1369        .dwattr $C$DW$117, DW_AT_TI_symbol_name("$P$T0")
    1370        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1372        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1373        .dwattr $C$DW$117, DW_AT_decl_line(0x29)
    1374        .dwattr $C$DW$117, DW_AT_decl_column(0x02)
    1375$C$DW$118       .dwtag  DW_TAG_member
    1376        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$111)
    1377        .dwattr $C$DW$118, DW_AT_name("$P$T1")
    1378        .dwattr $C$DW$118, DW_AT_TI_symbol_name("$P$T1")
    1379        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1380        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1381        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1382        .dwattr $C$DW$118, DW_AT_decl_line(0x33)
    1383        .dwattr $C$DW$118, DW_AT_decl_column(0x02)
    1384$C$DW$119       .dwtag  DW_TAG_member
    1385        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$113)
    1386        .dwattr $C$DW$119, DW_AT_name("$P$T2")
    1387        .dwattr $C$DW$119, DW_AT_TI_symbol_name("$P$T2")
    1388        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1389        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1390        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1391        .dwattr $C$DW$119, DW_AT_decl_line(0x41)
    1392        .dwattr $C$DW$119, DW_AT_decl_column(0x02)
    1393$C$DW$120       .dwtag  DW_TAG_member
    1394        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$115)
    1395        .dwattr $C$DW$120, DW_AT_name("$P$T3")
    1396        .dwattr $C$DW$120, DW_AT_TI_symbol_name("$P$T3")
    1397        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1398        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1399        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1400        .dwattr $C$DW$120, DW_AT_decl_line(0x54)
    1401        .dwattr $C$DW$120, DW_AT_decl_column(0x02)
    1402$C$DW$121       .dwtag  DW_TAG_member
    1403        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$117)
    1404        .dwattr $C$DW$121, DW_AT_name("$P$T4")
    1405        .dwattr $C$DW$121, DW_AT_TI_symbol_name("$P$T4")
    1406        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1407        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1408        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1409        .dwattr $C$DW$121, DW_AT_decl_line(0x67)
    1410        .dwattr $C$DW$121, DW_AT_decl_column(0x02)
    1411$C$DW$122       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   27

    1412        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$119)
    1413        .dwattr $C$DW$122, DW_AT_name("$P$T5")
    1414        .dwattr $C$DW$122, DW_AT_TI_symbol_name("$P$T5")
    1415        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1416        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1417        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1418        .dwattr $C$DW$122, DW_AT_decl_line(0x83)
    1419        .dwattr $C$DW$122, DW_AT_decl_column(0x02)
    1420$C$DW$123       .dwtag  DW_TAG_member
    1421        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$121)
    1422        .dwattr $C$DW$123, DW_AT_name("$P$T6")
    1423        .dwattr $C$DW$123, DW_AT_TI_symbol_name("$P$T6")
    1424        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1425        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1426        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1427        .dwattr $C$DW$123, DW_AT_decl_line(0x92)
    1428        .dwattr $C$DW$123, DW_AT_decl_column(0x02)
    1429$C$DW$124       .dwtag  DW_TAG_member
    1430        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$123)
    1431        .dwattr $C$DW$124, DW_AT_name("$P$T7")
    1432        .dwattr $C$DW$124, DW_AT_TI_symbol_name("$P$T7")
    1433        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1434        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1435        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1436        .dwattr $C$DW$124, DW_AT_decl_line(0xa0)
    1437        .dwattr $C$DW$124, DW_AT_decl_column(0x02)
    1438$C$DW$125       .dwtag  DW_TAG_member
    1439        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$125)
    1440        .dwattr $C$DW$125, DW_AT_name("$P$T8")
    1441        .dwattr $C$DW$125, DW_AT_TI_symbol_name("$P$T8")
    1442        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1443        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1444        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1445        .dwattr $C$DW$125, DW_AT_decl_line(0xaf)
    1446        .dwattr $C$DW$125, DW_AT_decl_column(0x02)
    1447$C$DW$126       .dwtag  DW_TAG_member
    1448        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$32)
    1449        .dwattr $C$DW$126, DW_AT_name("rsvd24")
    1450        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd24")
    1451        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1452        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1453        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1454        .dwattr $C$DW$126, DW_AT_decl_line(0xbc)
    1455        .dwattr $C$DW$126, DW_AT_decl_column(0x0b)
    1456$C$DW$127       .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$127)
    1458        .dwattr $C$DW$127, DW_AT_name("$P$T9")
    1459        .dwattr $C$DW$127, DW_AT_TI_symbol_name("$P$T9")
    1460        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1461        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1462        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1463        .dwattr $C$DW$127, DW_AT_decl_line(0xc0)
    1464        .dwattr $C$DW$127, DW_AT_decl_column(0x02)
    1465$C$DW$128       .dwtag  DW_TAG_member
    1466        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$33)
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   28

    1467        .dwattr $C$DW$128, DW_AT_name("rsvd2c")
    1468        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd2c")
    1469        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1470        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1471        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1472        .dwattr $C$DW$128, DW_AT_decl_line(0xcb)
    1473        .dwattr $C$DW$128, DW_AT_decl_column(0x0b)
    1474$C$DW$129       .dwtag  DW_TAG_member
    1475        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$129)
    1476        .dwattr $C$DW$129, DW_AT_name("$P$T10")
    1477        .dwattr $C$DW$129, DW_AT_TI_symbol_name("$P$T10")
    1478        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1479        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1480        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1481        .dwattr $C$DW$129, DW_AT_decl_line(0xcf)
    1482        .dwattr $C$DW$129, DW_AT_decl_column(0x02)
    1483$C$DW$130       .dwtag  DW_TAG_member
    1484        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$131)
    1485        .dwattr $C$DW$130, DW_AT_name("$P$T11")
    1486        .dwattr $C$DW$130, DW_AT_TI_symbol_name("$P$T11")
    1487        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1488        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1489        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1490        .dwattr $C$DW$130, DW_AT_decl_line(0xda)
    1491        .dwattr $C$DW$130, DW_AT_decl_column(0x02)
    1492$C$DW$131       .dwtag  DW_TAG_member
    1493        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$34)
    1494        .dwattr $C$DW$131, DW_AT_name("rsvd38")
    1495        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd38")
    1496        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1497        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1498        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1499        .dwattr $C$DW$131, DW_AT_decl_line(0xe5)
    1500        .dwattr $C$DW$131, DW_AT_decl_column(0x0b)
    1501$C$DW$132       .dwtag  DW_TAG_member
    1502        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$133)
    1503        .dwattr $C$DW$132, DW_AT_name("$P$T12")
    1504        .dwattr $C$DW$132, DW_AT_TI_symbol_name("$P$T12")
    1505        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1506        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1507        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1508        .dwattr $C$DW$132, DW_AT_decl_line(0xe8)
    1509        .dwattr $C$DW$132, DW_AT_decl_column(0x02)
    1510        .dwendtag $C$DW$T$35
    1511
    1512        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1513        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1514        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1515$C$DW$T$290     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1516        .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$35)
    1517        .dwattr $C$DW$T$290, DW_AT_language(DW_LANG_C)
    1518        .dwattr $C$DW$T$290, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    1519        .dwattr $C$DW$T$290, DW_AT_decl_line(0xf0)
    1520        .dwattr $C$DW$T$290, DW_AT_decl_column(0x03)
    1521$C$DW$T$291     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   29

    1522        .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    1523
    1524$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1525        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1526$C$DW$133       .dwtag  DW_TAG_member
    1527        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1528        .dwattr $C$DW$133, DW_AT_name("REV_MINOR")
    1529        .dwattr $C$DW$133, DW_AT_TI_symbol_name("REV_MINOR")
    1530        .dwattr $C$DW$133, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1531        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1533        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1534        .dwattr $C$DW$133, DW_AT_decl_line(0x2d)
    1535        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1536$C$DW$134       .dwtag  DW_TAG_member
    1537        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1538        .dwattr $C$DW$134, DW_AT_name("REV_CUSTOM")
    1539        .dwattr $C$DW$134, DW_AT_TI_symbol_name("REV_CUSTOM")
    1540        .dwattr $C$DW$134, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1541        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1543        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1544        .dwattr $C$DW$134, DW_AT_decl_line(0x2e)
    1545        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1546$C$DW$135       .dwtag  DW_TAG_member
    1547        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    1548        .dwattr $C$DW$135, DW_AT_name("REV_MAJOR")
    1549        .dwattr $C$DW$135, DW_AT_TI_symbol_name("REV_MAJOR")
    1550        .dwattr $C$DW$135, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1551        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1553        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1554        .dwattr $C$DW$135, DW_AT_decl_line(0x2f)
    1555        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1556$C$DW$136       .dwtag  DW_TAG_member
    1557        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    1558        .dwattr $C$DW$136, DW_AT_name("REV_RTL")
    1559        .dwattr $C$DW$136, DW_AT_TI_symbol_name("REV_RTL")
    1560        .dwattr $C$DW$136, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1561        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1563        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1564        .dwattr $C$DW$136, DW_AT_decl_line(0x30)
    1565        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1566$C$DW$137       .dwtag  DW_TAG_member
    1567        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1568        .dwattr $C$DW$137, DW_AT_name("REV_MODULE")
    1569        .dwattr $C$DW$137, DW_AT_TI_symbol_name("REV_MODULE")
    1570        .dwattr $C$DW$137, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1571        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1573        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1574        .dwattr $C$DW$137, DW_AT_decl_line(0x31)
    1575        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1576$C$DW$138       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   30

    1577        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1578        .dwattr $C$DW$138, DW_AT_name("rsvd28")
    1579        .dwattr $C$DW$138, DW_AT_TI_symbol_name("rsvd28")
    1580        .dwattr $C$DW$138, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1581        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1584        .dwattr $C$DW$138, DW_AT_decl_line(0x32)
    1585        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1586$C$DW$139       .dwtag  DW_TAG_member
    1587        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1588        .dwattr $C$DW$139, DW_AT_name("REV_SCHEME")
    1589        .dwattr $C$DW$139, DW_AT_TI_symbol_name("REV_SCHEME")
    1590        .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1591        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1592        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1593        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1594        .dwattr $C$DW$139, DW_AT_decl_line(0x33)
    1595        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    1596        .dwendtag $C$DW$T$36
    1597
    1598        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1599        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    1600        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1601$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    1602        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$36)
    1603
    1604$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1605        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1606$C$DW$140       .dwtag  DW_TAG_member
    1607        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    1608        .dwattr $C$DW$140, DW_AT_name("rsvd0")
    1609        .dwattr $C$DW$140, DW_AT_TI_symbol_name("rsvd0")
    1610        .dwattr $C$DW$140, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1611        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1613        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1614        .dwattr $C$DW$140, DW_AT_decl_line(0x3d)
    1615        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    1616$C$DW$141       .dwtag  DW_TAG_member
    1617        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    1618        .dwattr $C$DW$141, DW_AT_name("NEST_MODE")
    1619        .dwattr $C$DW$141, DW_AT_TI_symbol_name("NEST_MODE")
    1620        .dwattr $C$DW$141, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1621        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1623        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1624        .dwattr $C$DW$141, DW_AT_decl_line(0x3e)
    1625        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    1626$C$DW$142       .dwtag  DW_TAG_member
    1627        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    1628        .dwattr $C$DW$142, DW_AT_name("rsvd4")
    1629        .dwattr $C$DW$142, DW_AT_TI_symbol_name("rsvd4")
    1630        .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    1631        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   31

    1632        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1633        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1634        .dwattr $C$DW$142, DW_AT_decl_line(0x3f)
    1635        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    1636        .dwendtag $C$DW$T$37
    1637
    1638        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1639        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    1640        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1641$C$DW$T$136     .dwtag  DW_TAG_volatile_type
    1642        .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$37)
    1643
    1644$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1645        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1646$C$DW$143       .dwtag  DW_TAG_member
    1647        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    1648        .dwattr $C$DW$143, DW_AT_name("EN_HINT_ANY")
    1649        .dwattr $C$DW$143, DW_AT_TI_symbol_name("EN_HINT_ANY")
    1650        .dwattr $C$DW$143, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1651        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1653        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1654        .dwattr $C$DW$143, DW_AT_decl_line(0x4c)
    1655        .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    1656$C$DW$144       .dwtag  DW_TAG_member
    1657        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    1658        .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1659        .dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd1")
    1660        .dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1661        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1663        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1664        .dwattr $C$DW$144, DW_AT_decl_line(0x4d)
    1665        .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    1666        .dwendtag $C$DW$T$38
    1667
    1668        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1669        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    1670        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1671$C$DW$T$138     .dwtag  DW_TAG_volatile_type
    1672        .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$38)
    1673
    1674$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1675        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1676$C$DW$145       .dwtag  DW_TAG_member
    1677        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    1678        .dwattr $C$DW$145, DW_AT_name("GLB_NEST_LEVEL")
    1679        .dwattr $C$DW$145, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    1680        .dwattr $C$DW$145, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    1681        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1683        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1684        .dwattr $C$DW$145, DW_AT_decl_line(0x5a)
    1685        .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    1686$C$DW$146       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   32

    1687        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    1688        .dwattr $C$DW$146, DW_AT_name("rsvd9")
    1689        .dwattr $C$DW$146, DW_AT_TI_symbol_name("rsvd9")
    1690        .dwattr $C$DW$146, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    1691        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1693        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1694        .dwattr $C$DW$146, DW_AT_decl_line(0x5b)
    1695        .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    1696$C$DW$147       .dwtag  DW_TAG_member
    1697        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
    1698        .dwattr $C$DW$147, DW_AT_name("AUTO_OVERRIDE")
    1699        .dwattr $C$DW$147, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    1700        .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1701        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1703        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1704        .dwattr $C$DW$147, DW_AT_decl_line(0x5c)
    1705        .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    1706        .dwendtag $C$DW$T$39
    1707
    1708        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1709        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    1710        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1711$C$DW$T$140     .dwtag  DW_TAG_volatile_type
    1712        .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$39)
    1713
    1714$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1715        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1716$C$DW$148       .dwtag  DW_TAG_member
    1717        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
    1718        .dwattr $C$DW$148, DW_AT_name("STS_SET_IDX")
    1719        .dwattr $C$DW$148, DW_AT_TI_symbol_name("STS_SET_IDX")
    1720        .dwattr $C$DW$148, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1721        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1723        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1724        .dwattr $C$DW$148, DW_AT_decl_line(0x66)
    1725        .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    1726$C$DW$149       .dwtag  DW_TAG_member
    1727        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    1728        .dwattr $C$DW$149, DW_AT_name("rsvd10")
    1729        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd10")
    1730        .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1731        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1733        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1734        .dwattr $C$DW$149, DW_AT_decl_line(0x67)
    1735        .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    1736        .dwendtag $C$DW$T$40
    1737
    1738        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1739        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    1740        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1741$C$DW$T$142     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Fri Apr 13 20:44:07 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   33

    1742        .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$40)
    1743
    1744$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1745        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1746$C$DW$150       .dwtag  DW_TAG_member
    1747        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
    1748        .dwattr $C$DW$150, DW_AT_name("STS_CLR_IDX")
    1749        .dwattr $C$DW$150, DW_AT_TI_symbol_name("STS_CLR_IDX")
    1750        .dwattr $C$DW$150, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1751        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1753        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1754        .dwattr $C$DW$150, DW_AT_decl_line(0x71)
    1755        .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
    1756$C$DW$151       .dwtag  DW_TAG_member
    1757        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    1758        .dwattr $C$DW$151, DW_AT_name("rsvd10")
    1759        .dwattr $C$DW$151, DW_AT_TI_symbol_name("rsvd10")
    1760        .dwattr $C$DW$151, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1761        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1763        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1764        .dwattr $C$DW$151, DW_AT_decl_line(0x72)
    1765        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    1766        .dwendtag $C$DW$T$41
    1767
    1768        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1769        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    1770        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1771$C$DW$T$144     .dwtag  DW_TAG_volatile_type
    1772        .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$41)
    1773
    1774$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1775        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1776$C$DW$152       .dwtag  DW_TAG_member
    1777        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
