PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sat Apr 14 04:05:20 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_IEP
      15
      16$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("pru_rpmsg_init")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("pru_rpmsg_init")
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$389)
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external

PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   24

    1266; 301 | // payload[0] = __R31 & pinMasks[0] ? 'H' : 'L';                       
    1267; 302 | // payload[1] = '\n';                                                  
    1268; 303 | // payload[2] = 0;                                                     
    1269; 304 | // len = 3;                                                            
    1270; 306 | //time = 0;                                                            
    1271; 307 | // while(__R31 & pinMasks[0]){                                         
    1272; 308 | //      time++;                                                        
    1273; 309 | //      __delay_cycles(200000); // number of ms                        
    1274; 310 | // }                                                                   
    1275; 311 | // // if(time > 0){                                                    
    1276; 312 | // //   for(unsigned i = 0; i < 510 && time > 0; i++){                 
    1277; 313 | // //   //      payload[i] = digits[time ]                             
    1278; 314 | // //   }                                                              
    1279; 315 | // // }                                                                
    1280; 316 | // if(time > 0){                                                       
    1281; 319 | //LAST WORKING CLOCK PRINT                                             
    1282; 320 | // if(time > 0){                                                       
    1283; 321 | //      payload[0] = '1';                                              
    1284; 322 | //      payload[1] = ':';                                              
    1285; 323 | //      for(bit = 1 << 15, i = 2; i < 18; i++ ){ //2 to 18 = 16 bits   
    1286; 324 | //              payload[i] = (time & bit) ? '1' : '0';                 
    1287; 325 | //              bit >>= 1;                                             
    1288; 326 | //      }                                                              
    1289; 327 | //      payload[18] = '\n';                                            
    1290; 328 | //      payload[19] = 0;                                               
    1291; 329 | //      len = 20;                                                      
    1292; 331 | //      pru_rpmsg_send(&transport, dst, src, payload, len);            
    1293; 333 | // }                                                                   
    1294; 337 | //  __delay_cycles(2000000);                                           
    1295; 338 | //count++;                                                             
    1296;----------------------------------------------------------------------
    1297 00000228 000000F10C2A80          LBBO      &r0, r10, 12, 4       ; [ALU_PRU] |289| $O$K123
    1298        .dwpsn  file "main1.c",line 244,column 9,is_stmt,isa 0
    1299 0000022c 00000021000000!         JMP       ||$C$L19||            ; [ALU_PRU] |244| 
    1300;* --------------------------------------------------------------------------*
    1301        .dwattr $C$DW$44, DW_AT_TI_end_file("main1.c")
    1302        .dwattr $C$DW$44, DW_AT_TI_end_line(0x154)
    1303        .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
    1304        .dwendentry
    1305        .dwendtag $C$DW$44
    1306
    1307;******************************************************************************
    1308;* STRINGS                                                                    *
    1309;******************************************************************************
    1310 00000000                         .sect   ".rodata:.string"
    1311 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   25

    1312 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000031 
         00000014 00000000000000 
    1313;*****************************************************************************
    1314;* UNDEFINED EXTERNAL REFERENCES                                             *
    1315;*****************************************************************************
    1316        .global ||pru_rpmsg_init||
    1317        .global ||pru_rpmsg_receive||
    1318        .global ||pru_rpmsg_send||
    1319        .global ||pru_rpmsg_channel||
    1320
    1321;******************************************************************************
    1322;* TYPE INFORMATION                                                           *
    1323;******************************************************************************
    1324
    1325$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1326        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1327$C$DW$59        .dwtag  DW_TAG_member
    1328        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1329        .dwattr $C$DW$59, DW_AT_name("REVID")
    1330        .dwattr $C$DW$59, DW_AT_TI_symbol_name("REVID")
    1331        .dwattr $C$DW$59, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1332        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1334        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1335        .dwattr $C$DW$59, DW_AT_decl_line(0x2d)
    1336        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1337        .dwendtag $C$DW$T$19
    1338
    1339        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1340        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1341        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1342$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1343        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    1344
    1345$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1346        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1347$C$DW$60        .dwtag  DW_TAG_member
    1348        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1349        .dwattr $C$DW$60, DW_AT_name("IDLE_MODE")
    1350        .dwattr $C$DW$60, DW_AT_TI_symbol_name("IDLE_MODE")
    1351        .dwattr $C$DW$60, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1352        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1354        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1355        .dwattr $C$DW$60, DW_AT_decl_line(0x37)
    1356        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   26

    1357$C$DW$61        .dwtag  DW_TAG_member
    1358        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1359        .dwattr $C$DW$61, DW_AT_name("STANDBY_MODE")
    1360        .dwattr $C$DW$61, DW_AT_TI_symbol_name("STANDBY_MODE")
    1361        .dwattr $C$DW$61, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1362        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1364        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1365        .dwattr $C$DW$61, DW_AT_decl_line(0x38)
    1366        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1367$C$DW$62        .dwtag  DW_TAG_member
    1368        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1369        .dwattr $C$DW$62, DW_AT_name("STANDBY_INIT")
    1370        .dwattr $C$DW$62, DW_AT_TI_symbol_name("STANDBY_INIT")
    1371        .dwattr $C$DW$62, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1372        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1374        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1375        .dwattr $C$DW$62, DW_AT_decl_line(0x39)
    1376        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1377$C$DW$63        .dwtag  DW_TAG_member
    1378        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1379        .dwattr $C$DW$63, DW_AT_name("SUB_MWAIT")
    1380        .dwattr $C$DW$63, DW_AT_TI_symbol_name("SUB_MWAIT")
    1381        .dwattr $C$DW$63, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1382        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1384        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1385        .dwattr $C$DW$63, DW_AT_decl_line(0x3a)
    1386        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1387$C$DW$64        .dwtag  DW_TAG_member
    1388        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1389        .dwattr $C$DW$64, DW_AT_name("rsvd6")
    1390        .dwattr $C$DW$64, DW_AT_TI_symbol_name("rsvd6")
    1391        .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1392        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1394        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1395        .dwattr $C$DW$64, DW_AT_decl_line(0x3b)
    1396        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1397        .dwendtag $C$DW$T$20
    1398
    1399        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1400        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1401        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1402$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1403        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$20)
    1404
    1405$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1406        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1407$C$DW$65        .dwtag  DW_TAG_member
    1408        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1409        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_MODE")
    1410        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1411        .dwattr $C$DW$65, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   27

    1412        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1414        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1415        .dwattr $C$DW$65, DW_AT_decl_line(0x45)
    1416        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1417$C$DW$66        .dwtag  DW_TAG_member
    1418        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1419        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_CLK_MODE")
    1420        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1421        .dwattr $C$DW$66, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1422        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1424        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1425        .dwattr $C$DW$66, DW_AT_decl_line(0x46)
    1426        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1427$C$DW$67        .dwtag  DW_TAG_member
    1428        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1429        .dwattr $C$DW$67, DW_AT_name("PRU0_GPI_DIV0")
    1430        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1431        .dwattr $C$DW$67, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1432        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1434        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1435        .dwattr $C$DW$67, DW_AT_decl_line(0x47)
    1436        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1437$C$DW$68        .dwtag  DW_TAG_member
    1438        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1439        .dwattr $C$DW$68, DW_AT_name("PRU0_GPI_DIV1")
    1440        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1441        .dwattr $C$DW$68, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1442        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1444        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1445        .dwattr $C$DW$68, DW_AT_decl_line(0x48)
    1446        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1447$C$DW$69        .dwtag  DW_TAG_member
    1448        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1449        .dwattr $C$DW$69, DW_AT_name("PRU0_GPI_SB")
    1450        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1451        .dwattr $C$DW$69, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1452        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1454        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1455        .dwattr $C$DW$69, DW_AT_decl_line(0x49)
    1456        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1457$C$DW$70        .dwtag  DW_TAG_member
    1458        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1459        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_MODE")
    1460        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1461        .dwattr $C$DW$70, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1462        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1464        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1465        .dwattr $C$DW$70, DW_AT_decl_line(0x4a)
    1466        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   28

    1467$C$DW$71        .dwtag  DW_TAG_member
    1468        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1469        .dwattr $C$DW$71, DW_AT_name("PRU0_GPO_DIV0")
    1470        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1471        .dwattr $C$DW$71, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1472        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1474        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1475        .dwattr $C$DW$71, DW_AT_decl_line(0x4b)
    1476        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1477$C$DW$72        .dwtag  DW_TAG_member
    1478        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1479        .dwattr $C$DW$72, DW_AT_name("PRU0_GPO_DIV1")
    1480        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1481        .dwattr $C$DW$72, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1482        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1484        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1485        .dwattr $C$DW$72, DW_AT_decl_line(0x4c)
    1486        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1487$C$DW$73        .dwtag  DW_TAG_member
    1488        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1489        .dwattr $C$DW$73, DW_AT_name("PRU0_GPO_SH_SEL")
    1490        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1491        .dwattr $C$DW$73, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1492        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1493        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1494        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1495        .dwattr $C$DW$73, DW_AT_decl_line(0x4d)
    1496        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1497$C$DW$74        .dwtag  DW_TAG_member
    1498        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1499        .dwattr $C$DW$74, DW_AT_name("rsvd26")
    1500        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd26")
    1501        .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1502        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1504        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1505        .dwattr $C$DW$74, DW_AT_decl_line(0x4e)
    1506        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1507        .dwendtag $C$DW$T$21
    1508
    1509        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1510        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1511        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1512$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1513        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    1514
    1515$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1516        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1517$C$DW$75        .dwtag  DW_TAG_member
    1518        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1519        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_MODE")
    1520        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1521        .dwattr $C$DW$75, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   29

    1522        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1524        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1525        .dwattr $C$DW$75, DW_AT_decl_line(0x58)
    1526        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1527$C$DW$76        .dwtag  DW_TAG_member
    1528        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1529        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_CLK_MODE")
    1530        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1531        .dwattr $C$DW$76, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1532        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1533        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1534        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1535        .dwattr $C$DW$76, DW_AT_decl_line(0x59)
    1536        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1537$C$DW$77        .dwtag  DW_TAG_member
    1538        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1539        .dwattr $C$DW$77, DW_AT_name("PRU1_GPI_DIV0")
    1540        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1541        .dwattr $C$DW$77, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1542        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1544        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1545        .dwattr $C$DW$77, DW_AT_decl_line(0x5a)
    1546        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1547$C$DW$78        .dwtag  DW_TAG_member
    1548        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1549        .dwattr $C$DW$78, DW_AT_name("PRU1_GPI_DIV1")
    1550        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1551        .dwattr $C$DW$78, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1552        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1554        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1555        .dwattr $C$DW$78, DW_AT_decl_line(0x5b)
    1556        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1557$C$DW$79        .dwtag  DW_TAG_member
    1558        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1559        .dwattr $C$DW$79, DW_AT_name("PRU1_GPI_SB")
    1560        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1561        .dwattr $C$DW$79, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1562        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1564        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1565        .dwattr $C$DW$79, DW_AT_decl_line(0x5c)
    1566        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1567$C$DW$80        .dwtag  DW_TAG_member
    1568        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1569        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_MODE")
    1570        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1571        .dwattr $C$DW$80, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1572        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1574        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1575        .dwattr $C$DW$80, DW_AT_decl_line(0x5d)
    1576        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   30

    1577$C$DW$81        .dwtag  DW_TAG_member
    1578        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1579        .dwattr $C$DW$81, DW_AT_name("PRU1_GPO_DIV0")
    1580        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1581        .dwattr $C$DW$81, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1582        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1583        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1584        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1585        .dwattr $C$DW$81, DW_AT_decl_line(0x5e)
    1586        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1587$C$DW$82        .dwtag  DW_TAG_member
    1588        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1589        .dwattr $C$DW$82, DW_AT_name("PRU1_GPO_DIV1")
    1590        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1591        .dwattr $C$DW$82, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1592        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1594        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1595        .dwattr $C$DW$82, DW_AT_decl_line(0x5f)
    1596        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1597$C$DW$83        .dwtag  DW_TAG_member
    1598        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1599        .dwattr $C$DW$83, DW_AT_name("PRU1_GPO_SH_SEL")
    1600        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1601        .dwattr $C$DW$83, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1602        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1604        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1605        .dwattr $C$DW$83, DW_AT_decl_line(0x60)
    1606        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1607$C$DW$84        .dwtag  DW_TAG_member
    1608        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1609        .dwattr $C$DW$84, DW_AT_name("rsvd26")
    1610        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd26")
    1611        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1612        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1614        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1615        .dwattr $C$DW$84, DW_AT_decl_line(0x61)
    1616        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1617        .dwendtag $C$DW$T$22
    1618
    1619        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1620        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1621        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1622$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1623        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$22)
    1624
    1625$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1626        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1627$C$DW$85        .dwtag  DW_TAG_member
    1628        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1629        .dwattr $C$DW$85, DW_AT_name("PRU0_CLK_STOP_REQ")
    1630        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1631        .dwattr $C$DW$85, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   31

    1632        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1634        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1635        .dwattr $C$DW$85, DW_AT_decl_line(0x6b)
    1636        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1637$C$DW$86        .dwtag  DW_TAG_member
    1638        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1639        .dwattr $C$DW$86, DW_AT_name("PRU0_CLK_STOP_ACK")
    1640        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1641        .dwattr $C$DW$86, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1642        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1644        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1645        .dwattr $C$DW$86, DW_AT_decl_line(0x6c)
    1646        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1647$C$DW$87        .dwtag  DW_TAG_member
    1648        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1649        .dwattr $C$DW$87, DW_AT_name("PRU0_CLK_EN")
    1650        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1651        .dwattr $C$DW$87, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1652        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1654        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1655        .dwattr $C$DW$87, DW_AT_decl_line(0x6d)
    1656        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1657$C$DW$88        .dwtag  DW_TAG_member
    1658        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1659        .dwattr $C$DW$88, DW_AT_name("PRU1_CLK_STOP_REQ")
    1660        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1661        .dwattr $C$DW$88, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1662        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1664        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1665        .dwattr $C$DW$88, DW_AT_decl_line(0x6e)
    1666        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1667$C$DW$89        .dwtag  DW_TAG_member
    1668        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1669        .dwattr $C$DW$89, DW_AT_name("PRU1_CLK_STOP_ACK")
    1670        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1671        .dwattr $C$DW$89, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1672        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1674        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1675        .dwattr $C$DW$89, DW_AT_decl_line(0x6f)
    1676        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1677$C$DW$90        .dwtag  DW_TAG_member
    1678        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1679        .dwattr $C$DW$90, DW_AT_name("PRU1_CLK_EN")
    1680        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1681        .dwattr $C$DW$90, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1682        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1684        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1685        .dwattr $C$DW$90, DW_AT_decl_line(0x70)
    1686        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   32

    1687$C$DW$91        .dwtag  DW_TAG_member
    1688        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1689        .dwattr $C$DW$91, DW_AT_name("INTC_CLK_STOP_REQ")
    1690        .dwattr $C$DW$91, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1691        .dwattr $C$DW$91, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1692        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1694        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1695        .dwattr $C$DW$91, DW_AT_decl_line(0x71)
    1696        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1697$C$DW$92        .dwtag  DW_TAG_member
    1698        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1699        .dwattr $C$DW$92, DW_AT_name("INTC_CLK_STOP_ACK")
    1700        .dwattr $C$DW$92, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1701        .dwattr $C$DW$92, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1702        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1704        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1705        .dwattr $C$DW$92, DW_AT_decl_line(0x72)
    1706        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1707$C$DW$93        .dwtag  DW_TAG_member
    1708        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1709        .dwattr $C$DW$93, DW_AT_name("INTC_CLK_EN")
    1710        .dwattr $C$DW$93, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1711        .dwattr $C$DW$93, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1712        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1714        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1715        .dwattr $C$DW$93, DW_AT_decl_line(0x73)
    1716        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1717$C$DW$94        .dwtag  DW_TAG_member
    1718        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1719        .dwattr $C$DW$94, DW_AT_name("UART_CLK_STOP_REQ")
    1720        .dwattr $C$DW$94, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1721        .dwattr $C$DW$94, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1722        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1724        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1725        .dwattr $C$DW$94, DW_AT_decl_line(0x74)
    1726        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1727$C$DW$95        .dwtag  DW_TAG_member
    1728        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1729        .dwattr $C$DW$95, DW_AT_name("UART_CLK_STOP_ACK")
    1730        .dwattr $C$DW$95, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1731        .dwattr $C$DW$95, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1732        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1733        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1734        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1735        .dwattr $C$DW$95, DW_AT_decl_line(0x75)
    1736        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1737$C$DW$96        .dwtag  DW_TAG_member
    1738        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1739        .dwattr $C$DW$96, DW_AT_name("UART_CLK_EN")
    1740        .dwattr $C$DW$96, DW_AT_TI_symbol_name("UART_CLK_EN")
    1741        .dwattr $C$DW$96, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   33

    1742        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1744        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1745        .dwattr $C$DW$96, DW_AT_decl_line(0x76)
    1746        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1747$C$DW$97        .dwtag  DW_TAG_member
    1748        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1749        .dwattr $C$DW$97, DW_AT_name("ECAP_CLK_STOP_REQ")
    1750        .dwattr $C$DW$97, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1751        .dwattr $C$DW$97, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1752        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1754        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1755        .dwattr $C$DW$97, DW_AT_decl_line(0x77)
    1756        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1757$C$DW$98        .dwtag  DW_TAG_member
    1758        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1759        .dwattr $C$DW$98, DW_AT_name("ECAP_CLK_STOP_ACK")
    1760        .dwattr $C$DW$98, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1761        .dwattr $C$DW$98, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1762        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1764        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1765        .dwattr $C$DW$98, DW_AT_decl_line(0x78)
    1766        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1767$C$DW$99        .dwtag  DW_TAG_member
    1768        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1769        .dwattr $C$DW$99, DW_AT_name("ECAP_CLK_EN")
    1770        .dwattr $C$DW$99, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1771        .dwattr $C$DW$99, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1772        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1774        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1775        .dwattr $C$DW$99, DW_AT_decl_line(0x79)
    1776        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1777$C$DW$100       .dwtag  DW_TAG_member
    1778        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1779        .dwattr $C$DW$100, DW_AT_name("IEP_CLK_STOP_REQ")
    1780        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1781        .dwattr $C$DW$100, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1782        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1784        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1785        .dwattr $C$DW$100, DW_AT_decl_line(0x7a)
    1786        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1787$C$DW$101       .dwtag  DW_TAG_member
    1788        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1789        .dwattr $C$DW$101, DW_AT_name("IEP_CLK_STOP_ACK")
    1790        .dwattr $C$DW$101, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1791        .dwattr $C$DW$101, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1792        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1794        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1795        .dwattr $C$DW$101, DW_AT_decl_line(0x7b)
    1796        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   34

    1797$C$DW$102       .dwtag  DW_TAG_member
    1798        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1799        .dwattr $C$DW$102, DW_AT_name("IEP_CLK_EN")
    1800        .dwattr $C$DW$102, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1801        .dwattr $C$DW$102, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1802        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1804        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1805        .dwattr $C$DW$102, DW_AT_decl_line(0x7c)
    1806        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1807$C$DW$103       .dwtag  DW_TAG_member
    1808        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1809        .dwattr $C$DW$103, DW_AT_name("rsvd18")
    1810        .dwattr $C$DW$103, DW_AT_TI_symbol_name("rsvd18")
    1811        .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1812        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1814        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1815        .dwattr $C$DW$103, DW_AT_decl_line(0x7d)
    1816        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1817        .dwendtag $C$DW$T$23
    1818
    1819        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1820        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1821        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1822$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1823        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$23)
    1824
    1825$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1826        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1827$C$DW$104       .dwtag  DW_TAG_member
    1828        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1829        .dwattr $C$DW$104, DW_AT_name("PRU0_IMEM_PE_RAW")
    1830        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1831        .dwattr $C$DW$104, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1832        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1833        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1834        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1835        .dwattr $C$DW$104, DW_AT_decl_line(0x87)
    1836        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1837$C$DW$105       .dwtag  DW_TAG_member
    1838        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1839        .dwattr $C$DW$105, DW_AT_name("PRU0_DMEM_PE_RAW")
    1840        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1841        .dwattr $C$DW$105, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1842        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1844        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1845        .dwattr $C$DW$105, DW_AT_decl_line(0x88)
    1846        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1847$C$DW$106       .dwtag  DW_TAG_member
    1848        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1849        .dwattr $C$DW$106, DW_AT_name("PRU1_IMEM_PE_RAW")
    1850        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1851        .dwattr $C$DW$106, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   35

    1852        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1854        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1855        .dwattr $C$DW$106, DW_AT_decl_line(0x89)
    1856        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1857$C$DW$107       .dwtag  DW_TAG_member
    1858        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1859        .dwattr $C$DW$107, DW_AT_name("PRU1_DMEM_PE_RAW")
    1860        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1861        .dwattr $C$DW$107, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1862        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1863        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1864        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1865        .dwattr $C$DW$107, DW_AT_decl_line(0x8a)
    1866        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1867$C$DW$108       .dwtag  DW_TAG_member
    1868        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1869        .dwattr $C$DW$108, DW_AT_name("RAM_PE_RAW")
    1870        .dwattr $C$DW$108, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1871        .dwattr $C$DW$108, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1872        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1874        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1875        .dwattr $C$DW$108, DW_AT_decl_line(0x8b)
    1876        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1877$C$DW$109       .dwtag  DW_TAG_member
    1878        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1879        .dwattr $C$DW$109, DW_AT_name("rsvd20")
    1880        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd20")
    1881        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1882        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1883        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1884        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1885        .dwattr $C$DW$109, DW_AT_decl_line(0x8c)
    1886        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1887        .dwendtag $C$DW$T$24
    1888
    1889        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1890        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1891        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1892$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    1893        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$24)
    1894
    1895$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1896        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1897$C$DW$110       .dwtag  DW_TAG_member
    1898        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1899        .dwattr $C$DW$110, DW_AT_name("PRU0_IMEM_PE")
    1900        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1901        .dwattr $C$DW$110, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1902        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1904        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1905        .dwattr $C$DW$110, DW_AT_decl_line(0x96)
    1906        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   36

    1907$C$DW$111       .dwtag  DW_TAG_member
    1908        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1909        .dwattr $C$DW$111, DW_AT_name("PRU0_DMEM_PE")
    1910        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1911        .dwattr $C$DW$111, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1912        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1914        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1915        .dwattr $C$DW$111, DW_AT_decl_line(0x97)
    1916        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1917$C$DW$112       .dwtag  DW_TAG_member
    1918        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1919        .dwattr $C$DW$112, DW_AT_name("PRU1_IMEM_PE")
    1920        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1921        .dwattr $C$DW$112, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1922        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1924        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1925        .dwattr $C$DW$112, DW_AT_decl_line(0x98)
    1926        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1927$C$DW$113       .dwtag  DW_TAG_member
    1928        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1929        .dwattr $C$DW$113, DW_AT_name("PRU1_DMEM_PE")
    1930        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1931        .dwattr $C$DW$113, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1932        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1934        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1935        .dwattr $C$DW$113, DW_AT_decl_line(0x99)
    1936        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1937$C$DW$114       .dwtag  DW_TAG_member
    1938        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1939        .dwattr $C$DW$114, DW_AT_name("RAM_PE")
    1940        .dwattr $C$DW$114, DW_AT_TI_symbol_name("RAM_PE")
    1941        .dwattr $C$DW$114, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1942        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1943        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1944        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1945        .dwattr $C$DW$114, DW_AT_decl_line(0x9a)
    1946        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1947$C$DW$115       .dwtag  DW_TAG_member
    1948        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1949        .dwattr $C$DW$115, DW_AT_name("rsvd20")
    1950        .dwattr $C$DW$115, DW_AT_TI_symbol_name("rsvd20")
    1951        .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1952        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1954        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1955        .dwattr $C$DW$115, DW_AT_decl_line(0x9b)
    1956        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1957        .dwendtag $C$DW$T$25
    1958
    1959        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1960        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1961        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   37

    1962$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    1963        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$25)
    1964
    1965$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1966        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1967$C$DW$116       .dwtag  DW_TAG_member
    1968        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1969        .dwattr $C$DW$116, DW_AT_name("PRU0_IMEM_PE_SET")
    1970        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1971        .dwattr $C$DW$116, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1972        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1974        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1975        .dwattr $C$DW$116, DW_AT_decl_line(0xa4)
    1976        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1977$C$DW$117       .dwtag  DW_TAG_member
    1978        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1979        .dwattr $C$DW$117, DW_AT_name("PRU0_DMEM_PE_SET")
    1980        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1981        .dwattr $C$DW$117, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1982        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1984        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1985        .dwattr $C$DW$117, DW_AT_decl_line(0xa5)
    1986        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1987$C$DW$118       .dwtag  DW_TAG_member
    1988        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1989        .dwattr $C$DW$118, DW_AT_name("PRU1_IMEM_PE_SET")
    1990        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1991        .dwattr $C$DW$118, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1992        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1993        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1994        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1995        .dwattr $C$DW$118, DW_AT_decl_line(0xa6)
    1996        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1997$C$DW$119       .dwtag  DW_TAG_member
    1998        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1999        .dwattr $C$DW$119, DW_AT_name("PRU1_DMEM_PE_SET")
    2000        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2001        .dwattr $C$DW$119, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2002        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2004        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2005        .dwattr $C$DW$119, DW_AT_decl_line(0xa7)
    2006        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    2007$C$DW$120       .dwtag  DW_TAG_member
    2008        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    2009        .dwattr $C$DW$120, DW_AT_name("RAM_PE_SET")
    2010        .dwattr $C$DW$120, DW_AT_TI_symbol_name("RAM_PE_SET")
    2011        .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2012        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2013        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2014        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2015        .dwattr $C$DW$120, DW_AT_decl_line(0xa8)
    2016        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   38

    2017$C$DW$121       .dwtag  DW_TAG_member
    2018        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2019        .dwattr $C$DW$121, DW_AT_name("rsvd20")
    2020        .dwattr $C$DW$121, DW_AT_TI_symbol_name("rsvd20")
    2021        .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2022        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2024        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2025        .dwattr $C$DW$121, DW_AT_decl_line(0xa9)
    2026        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2027        .dwendtag $C$DW$T$26
    2028
    2029        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2030        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2031        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2032$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    2033        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$26)
    2034
    2035$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2036        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2037$C$DW$122       .dwtag  DW_TAG_member
    2038        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2039        .dwattr $C$DW$122, DW_AT_name("PRU0_IMEM_PE_CLR")
    2040        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2041        .dwattr $C$DW$122, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2042        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2044        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2045        .dwattr $C$DW$122, DW_AT_decl_line(0xb3)
    2046        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2047$C$DW$123       .dwtag  DW_TAG_member
    2048        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2049        .dwattr $C$DW$123, DW_AT_name("PRU0_DMEM_PE_CLR")
    2050        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2051        .dwattr $C$DW$123, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2052        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2054        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2055        .dwattr $C$DW$123, DW_AT_decl_line(0xb4)
    2056        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2057$C$DW$124       .dwtag  DW_TAG_member
    2058        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2059        .dwattr $C$DW$124, DW_AT_name("PRU1_IMEM_PE_CLR")
    2060        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2061        .dwattr $C$DW$124, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2062        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2063        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2064        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2065        .dwattr $C$DW$124, DW_AT_decl_line(0xb5)
    2066        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2067$C$DW$125       .dwtag  DW_TAG_member
    2068        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2069        .dwattr $C$DW$125, DW_AT_name("PRU1_DMEM_PE_CLR")
    2070        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2071        .dwattr $C$DW$125, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   39

    2072        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2074        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2075        .dwattr $C$DW$125, DW_AT_decl_line(0xb6)
    2076        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2077$C$DW$126       .dwtag  DW_TAG_member
    2078        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2079        .dwattr $C$DW$126, DW_AT_name("rsvd16")
    2080        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd16")
    2081        .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2082        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2083        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2084        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2085        .dwattr $C$DW$126, DW_AT_decl_line(0xb7)
    2086        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2087        .dwendtag $C$DW$T$27
    2088
    2089        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2090        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2091        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2092$C$DW$T$147     .dwtag  DW_TAG_volatile_type
    2093        .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$27)
    2094
    2095$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2096        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2097$C$DW$127       .dwtag  DW_TAG_member
    2098        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2099        .dwattr $C$DW$127, DW_AT_name("PMAO_PRU0")
    2100        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PMAO_PRU0")
    2101        .dwattr $C$DW$127, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2102        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2104        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2105        .dwattr $C$DW$127, DW_AT_decl_line(0xc4)
    2106        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2107$C$DW$128       .dwtag  DW_TAG_member
    2108        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2109        .dwattr $C$DW$128, DW_AT_name("PMAO_PRU1")
    2110        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PMAO_PRU1")
    2111        .dwattr $C$DW$128, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2112        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2114        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2115        .dwattr $C$DW$128, DW_AT_decl_line(0xc5)
    2116        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2117$C$DW$129       .dwtag  DW_TAG_member
    2118        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2119        .dwattr $C$DW$129, DW_AT_name("rsvd2")
    2120        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd2")
    2121        .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2122        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2124        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2125        .dwattr $C$DW$129, DW_AT_decl_line(0xc6)
    2126        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   40

    2127        .dwendtag $C$DW$T$28
    2128
    2129        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2130        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2131        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2132$C$DW$T$149     .dwtag  DW_TAG_volatile_type
    2133        .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$28)
    2134
    2135$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2136        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2137$C$DW$130       .dwtag  DW_TAG_member
    2138        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2139        .dwattr $C$DW$130, DW_AT_name("OCP_EN")
    2140        .dwattr $C$DW$130, DW_AT_TI_symbol_name("OCP_EN")
    2141        .dwattr $C$DW$130, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2142        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2143        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2144        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2145        .dwattr $C$DW$130, DW_AT_decl_line(0xd3)
    2146        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2147$C$DW$131       .dwtag  DW_TAG_member
    2148        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2149        .dwattr $C$DW$131, DW_AT_name("rsvd1")
    2150        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd1")
    2151        .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2152        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2154        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2155        .dwattr $C$DW$131, DW_AT_decl_line(0xd4)
    2156        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2157        .dwendtag $C$DW$T$29
    2158
    2159        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2160        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2161        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2162$C$DW$T$151     .dwtag  DW_TAG_volatile_type
    2163        .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$29)
    2164
    2165$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2166        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2167$C$DW$132       .dwtag  DW_TAG_member
    2168        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2169        .dwattr $C$DW$132, DW_AT_name("PRU1_PAD_HP_EN")
    2170        .dwattr $C$DW$132, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2171        .dwattr $C$DW$132, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2172        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2174        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2175        .dwattr $C$DW$132, DW_AT_decl_line(0xde)
    2176        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2177$C$DW$133       .dwtag  DW_TAG_member
    2178        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2179        .dwattr $C$DW$133, DW_AT_name("XFR_SHIFT_EN")
    2180        .dwattr $C$DW$133, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2181        .dwattr $C$DW$133, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   41

    2182        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2184        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2185        .dwattr $C$DW$133, DW_AT_decl_line(0xdf)
    2186        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2187$C$DW$134       .dwtag  DW_TAG_member
    2188        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2189        .dwattr $C$DW$134, DW_AT_name("rsvd2")
    2190        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd2")
    2191        .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2192        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2193        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2194        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2195        .dwattr $C$DW$134, DW_AT_decl_line(0xe0)
    2196        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2197        .dwendtag $C$DW$T$30
    2198
    2199        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2200        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2201        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2202$C$DW$T$153     .dwtag  DW_TAG_volatile_type
    2203        .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$30)
    2204
    2205$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2206        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2207$C$DW$135       .dwtag  DW_TAG_member
    2208        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2209        .dwattr $C$DW$135, DW_AT_name("PIN_MUX_SEL")
    2210        .dwattr $C$DW$135, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2211        .dwattr $C$DW$135, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    2212        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2214        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2215        .dwattr $C$DW$135, DW_AT_decl_line(0xec)
    2216        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2217$C$DW$136       .dwtag  DW_TAG_member
    2218        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2219        .dwattr $C$DW$136, DW_AT_name("rsvd2")
    2220        .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd2")
    2221        .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    2222        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2223        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2224        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2225        .dwattr $C$DW$136, DW_AT_decl_line(0xed)
    2226        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2227        .dwendtag $C$DW$T$31
    2228
    2229        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2230        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2231        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2232$C$DW$T$155     .dwtag  DW_TAG_volatile_type
    2233        .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$31)
    2234
    2235$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2236        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   42

    2237$C$DW$137       .dwtag  DW_TAG_member
    2238        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$132)
    2239        .dwattr $C$DW$137, DW_AT_name("$P$T0")
    2240        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T0")
    2241        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2243        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2244        .dwattr $C$DW$137, DW_AT_decl_line(0x29)
    2245        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2246$C$DW$138       .dwtag  DW_TAG_member
    2247        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$134)
    2248        .dwattr $C$DW$138, DW_AT_name("$P$T1")
    2249        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T1")
    2250        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2251        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2252        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2253        .dwattr $C$DW$138, DW_AT_decl_line(0x33)
    2254        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    2255$C$DW$139       .dwtag  DW_TAG_member
    2256        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$136)
    2257        .dwattr $C$DW$139, DW_AT_name("$P$T2")
    2258        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T2")
    2259        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2260        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2261        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2262        .dwattr $C$DW$139, DW_AT_decl_line(0x41)
    2263        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2264$C$DW$140       .dwtag  DW_TAG_member
    2265        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$138)
    2266        .dwattr $C$DW$140, DW_AT_name("$P$T3")
    2267        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T3")
    2268        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2269        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2270        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2271        .dwattr $C$DW$140, DW_AT_decl_line(0x54)
    2272        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2273$C$DW$141       .dwtag  DW_TAG_member
    2274        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$140)
    2275        .dwattr $C$DW$141, DW_AT_name("$P$T4")
    2276        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T4")
    2277        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2278        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2279        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2280        .dwattr $C$DW$141, DW_AT_decl_line(0x67)
    2281        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2282$C$DW$142       .dwtag  DW_TAG_member
    2283        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$142)
    2284        .dwattr $C$DW$142, DW_AT_name("$P$T5")
    2285        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T5")
    2286        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2287        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2288        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2289        .dwattr $C$DW$142, DW_AT_decl_line(0x83)
    2290        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2291$C$DW$143       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   43

    2292        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$144)
    2293        .dwattr $C$DW$143, DW_AT_name("$P$T6")
    2294        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T6")
    2295        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2296        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2297        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2298        .dwattr $C$DW$143, DW_AT_decl_line(0x92)
    2299        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2300$C$DW$144       .dwtag  DW_TAG_member
    2301        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$146)
    2302        .dwattr $C$DW$144, DW_AT_name("$P$T7")
    2303        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T7")
    2304        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2305        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2306        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2307        .dwattr $C$DW$144, DW_AT_decl_line(0xa0)
    2308        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2309$C$DW$145       .dwtag  DW_TAG_member
    2310        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$148)
    2311        .dwattr $C$DW$145, DW_AT_name("$P$T8")
    2312        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T8")
    2313        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2314        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2315        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2316        .dwattr $C$DW$145, DW_AT_decl_line(0xaf)
    2317        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2318$C$DW$146       .dwtag  DW_TAG_member
    2319        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
    2320        .dwattr $C$DW$146, DW_AT_name("rsvd24")
    2321        .dwattr $C$DW$146, DW_AT_TI_symbol_name("rsvd24")
    2322        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2323        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2324        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2325        .dwattr $C$DW$146, DW_AT_decl_line(0xbc)
    2326        .dwattr $C$DW$146, DW_AT_decl_column(0x0b)
    2327$C$DW$147       .dwtag  DW_TAG_member
    2328        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$150)
    2329        .dwattr $C$DW$147, DW_AT_name("$P$T9")
    2330        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T9")
    2331        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2332        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2333        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2334        .dwattr $C$DW$147, DW_AT_decl_line(0xc0)
    2335        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2336$C$DW$148       .dwtag  DW_TAG_member
    2337        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$33)
    2338        .dwattr $C$DW$148, DW_AT_name("rsvd2c")
    2339        .dwattr $C$DW$148, DW_AT_TI_symbol_name("rsvd2c")
    2340        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2341        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2342        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2343        .dwattr $C$DW$148, DW_AT_decl_line(0xcb)
    2344        .dwattr $C$DW$148, DW_AT_decl_column(0x0b)
    2345$C$DW$149       .dwtag  DW_TAG_member
    2346        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$152)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   44

    2347        .dwattr $C$DW$149, DW_AT_name("$P$T10")
    2348        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T10")
    2349        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2350        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2351        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2352        .dwattr $C$DW$149, DW_AT_decl_line(0xcf)
    2353        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2354$C$DW$150       .dwtag  DW_TAG_member
    2355        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$154)
    2356        .dwattr $C$DW$150, DW_AT_name("$P$T11")
    2357        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T11")
    2358        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2359        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2360        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2361        .dwattr $C$DW$150, DW_AT_decl_line(0xda)
    2362        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2363$C$DW$151       .dwtag  DW_TAG_member
    2364        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$34)
    2365        .dwattr $C$DW$151, DW_AT_name("rsvd38")
    2366        .dwattr $C$DW$151, DW_AT_TI_symbol_name("rsvd38")
    2367        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2368        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2369        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2370        .dwattr $C$DW$151, DW_AT_decl_line(0xe5)
    2371        .dwattr $C$DW$151, DW_AT_decl_column(0x0b)
    2372$C$DW$152       .dwtag  DW_TAG_member
    2373        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$156)
    2374        .dwattr $C$DW$152, DW_AT_name("$P$T12")
    2375        .dwattr $C$DW$152, DW_AT_TI_symbol_name("$P$T12")
    2376        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2377        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2378        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2379        .dwattr $C$DW$152, DW_AT_decl_line(0xe8)
    2380        .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    2381        .dwendtag $C$DW$T$35
    2382
    2383        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2384        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2385        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2386$C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2387        .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$35)
    2388        .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    2389        .dwattr $C$DW$T$353, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2390        .dwattr $C$DW$T$353, DW_AT_decl_line(0xf0)
    2391        .dwattr $C$DW$T$353, DW_AT_decl_column(0x03)
    2392$C$DW$T$354     .dwtag  DW_TAG_volatile_type
    2393        .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
    2394
    2395$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2396        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2397$C$DW$153       .dwtag  DW_TAG_member
    2398        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2399        .dwattr $C$DW$153, DW_AT_name("REV_MINOR")
    2400        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_MINOR")
    2401        .dwattr $C$DW$153, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   45

    2402        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2404        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2405        .dwattr $C$DW$153, DW_AT_decl_line(0x2d)
    2406        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2407$C$DW$154       .dwtag  DW_TAG_member
    2408        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2409        .dwattr $C$DW$154, DW_AT_name("REV_CUSTOM")
    2410        .dwattr $C$DW$154, DW_AT_TI_symbol_name("REV_CUSTOM")
    2411        .dwattr $C$DW$154, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2412        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2413        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2414        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2415        .dwattr $C$DW$154, DW_AT_decl_line(0x2e)
    2416        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2417$C$DW$155       .dwtag  DW_TAG_member
    2418        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2419        .dwattr $C$DW$155, DW_AT_name("REV_MAJOR")
    2420        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_MAJOR")
    2421        .dwattr $C$DW$155, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2422        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2424        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2425        .dwattr $C$DW$155, DW_AT_decl_line(0x2f)
    2426        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2427$C$DW$156       .dwtag  DW_TAG_member
    2428        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2429        .dwattr $C$DW$156, DW_AT_name("REV_RTL")
    2430        .dwattr $C$DW$156, DW_AT_TI_symbol_name("REV_RTL")
    2431        .dwattr $C$DW$156, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2432        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2433        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2434        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2435        .dwattr $C$DW$156, DW_AT_decl_line(0x30)
    2436        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2437$C$DW$157       .dwtag  DW_TAG_member
    2438        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2439        .dwattr $C$DW$157, DW_AT_name("REV_MODULE")
    2440        .dwattr $C$DW$157, DW_AT_TI_symbol_name("REV_MODULE")
    2441        .dwattr $C$DW$157, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2442        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2443        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2444        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2445        .dwattr $C$DW$157, DW_AT_decl_line(0x31)
    2446        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2447$C$DW$158       .dwtag  DW_TAG_member
    2448        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2449        .dwattr $C$DW$158, DW_AT_name("rsvd28")
    2450        .dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd28")
    2451        .dwattr $C$DW$158, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2452        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2454        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2455        .dwattr $C$DW$158, DW_AT_decl_line(0x32)
    2456        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   46

    2457$C$DW$159       .dwtag  DW_TAG_member
    2458        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2459        .dwattr $C$DW$159, DW_AT_name("REV_SCHEME")
    2460        .dwattr $C$DW$159, DW_AT_TI_symbol_name("REV_SCHEME")
    2461        .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2462        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2463        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2464        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2465        .dwattr $C$DW$159, DW_AT_decl_line(0x33)
    2466        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2467        .dwendtag $C$DW$T$36
    2468
    2469        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2470        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2471        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2472$C$DW$T$157     .dwtag  DW_TAG_volatile_type
    2473        .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$36)
    2474
    2475$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2476        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2477$C$DW$160       .dwtag  DW_TAG_member
    2478        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2479        .dwattr $C$DW$160, DW_AT_name("rsvd0")
    2480        .dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd0")
    2481        .dwattr $C$DW$160, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2482        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2483        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2484        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2485        .dwattr $C$DW$160, DW_AT_decl_line(0x3d)
    2486        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2487$C$DW$161       .dwtag  DW_TAG_member
    2488        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2489        .dwattr $C$DW$161, DW_AT_name("NEST_MODE")
    2490        .dwattr $C$DW$161, DW_AT_TI_symbol_name("NEST_MODE")
    2491        .dwattr $C$DW$161, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2492        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2494        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2495        .dwattr $C$DW$161, DW_AT_decl_line(0x3e)
    2496        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2497$C$DW$162       .dwtag  DW_TAG_member
    2498        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2499        .dwattr $C$DW$162, DW_AT_name("rsvd4")
    2500        .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd4")
    2501        .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2502        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2504        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2505        .dwattr $C$DW$162, DW_AT_decl_line(0x3f)
    2506        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2507        .dwendtag $C$DW$T$37
    2508
    2509        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2510        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2511        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   47

    2512$C$DW$T$159     .dwtag  DW_TAG_volatile_type
    2513        .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$37)
    2514
    2515$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2516        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2517$C$DW$163       .dwtag  DW_TAG_member
    2518        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2519        .dwattr $C$DW$163, DW_AT_name("EN_HINT_ANY")
    2520        .dwattr $C$DW$163, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2521        .dwattr $C$DW$163, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2522        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2524        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2525        .dwattr $C$DW$163, DW_AT_decl_line(0x4c)
    2526        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2527$C$DW$164       .dwtag  DW_TAG_member
    2528        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2529        .dwattr $C$DW$164, DW_AT_name("rsvd1")
    2530        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd1")
    2531        .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2532        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2534        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2535        .dwattr $C$DW$164, DW_AT_decl_line(0x4d)
    2536        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2537        .dwendtag $C$DW$T$38
    2538
    2539        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2540        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2541        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2542$C$DW$T$161     .dwtag  DW_TAG_volatile_type
    2543        .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$38)
    2544
    2545$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2546        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2547$C$DW$165       .dwtag  DW_TAG_member
    2548        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2549        .dwattr $C$DW$165, DW_AT_name("GLB_NEST_LEVEL")
    2550        .dwattr $C$DW$165, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2551        .dwattr $C$DW$165, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2552        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2554        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2555        .dwattr $C$DW$165, DW_AT_decl_line(0x5a)
    2556        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2557$C$DW$166       .dwtag  DW_TAG_member
    2558        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2559        .dwattr $C$DW$166, DW_AT_name("rsvd9")
    2560        .dwattr $C$DW$166, DW_AT_TI_symbol_name("rsvd9")
    2561        .dwattr $C$DW$166, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2562        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2563        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2564        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2565        .dwattr $C$DW$166, DW_AT_decl_line(0x5b)
    2566        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   48

    2567$C$DW$167       .dwtag  DW_TAG_member
    2568        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2569        .dwattr $C$DW$167, DW_AT_name("AUTO_OVERRIDE")
    2570        .dwattr $C$DW$167, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2571        .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2572        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2574        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2575        .dwattr $C$DW$167, DW_AT_decl_line(0x5c)
    2576        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2577        .dwendtag $C$DW$T$39
    2578
    2579        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2580        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2581        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2582$C$DW$T$163     .dwtag  DW_TAG_volatile_type
    2583        .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$39)
    2584
    2585$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2586        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2587$C$DW$168       .dwtag  DW_TAG_member
    2588        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2589        .dwattr $C$DW$168, DW_AT_name("STS_SET_IDX")
    2590        .dwattr $C$DW$168, DW_AT_TI_symbol_name("STS_SET_IDX")
    2591        .dwattr $C$DW$168, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2592        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2593        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2594        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2595        .dwattr $C$DW$168, DW_AT_decl_line(0x66)
    2596        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2597$C$DW$169       .dwtag  DW_TAG_member
    2598        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2599        .dwattr $C$DW$169, DW_AT_name("rsvd10")
    2600        .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd10")
    2601        .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2602        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2603        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2604        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2605        .dwattr $C$DW$169, DW_AT_decl_line(0x67)
    2606        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2607        .dwendtag $C$DW$T$40
    2608
    2609        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2610        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    2611        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2612$C$DW$T$165     .dwtag  DW_TAG_volatile_type
    2613        .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$40)
    2614
    2615$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2616        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2617$C$DW$170       .dwtag  DW_TAG_member
    2618        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2619        .dwattr $C$DW$170, DW_AT_name("STS_CLR_IDX")
    2620        .dwattr $C$DW$170, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2621        .dwattr $C$DW$170, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
PRU Assembler Unix v2.1.4 Sat Apr 14 04:05:20 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   49

    2622        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2623        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2624        .dwattr $C$DW$170, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2625        .dwattr $C$DW$170, DW_AT_decl_line(0x71)
    2626        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2627$C$DW$171       .dwtag  DW_TAG_member
    2628        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$11)
    2629        .dwattr $C$DW$171, DW_AT_name("rsvd10")
    2630        .dwattr $C$DW$171, DW_AT_TI_symbol_name("rsvd10")
    2631        .dwattr $C$DW$171, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2632        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2634        .dwattr $C$DW$171, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2635        .dwattr $C$DW$171, DW_AT_decl_line(0x72)
    2636        .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2637        .dwendtag $C$DW$T$41
    2638
    2639        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2640        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2641        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2642$C$DW$T$167     .dwtag  DW_TAG_volatile_type
    2643        .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$41)
    2644
