PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Fri Apr 13 06:28:54 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14
      15$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__delay_cycles")
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external
      19$C$DW$2 .dwtag  DW_TAG_formal_parameter
      20        .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$11)
      21        .dwendtag $C$DW$1

     564        .dwpsn  file "main.c",line 160,column 2,is_stmt,isa 0
     565 00000118 000000E102040B          SBBO      &r11.b0, r4, 2, 1     ; [ALU_PRU] |160| $O$K38,$O$K62
     566        .dwpsn  file "main.c",line 165,column 5,is_stmt,isa 0
     567;----------------------------------------------------------------------
     568; 165 | pru_rpmsg_send(&transport, dst, src, payload, len);                    
     569;----------------------------------------------------------------------
     570 0000011c 00000024000592          LDI       r18.w0, 0x0005        ; [ALU_PRU] |165| 
     571 00000120 0000000106E2EE          ADD       r14, r2, 6            ; [ALU_PRU] |165| transport,transport
     572 00000124 00000010E4E4F1          MOV       r17, r4               ; [ALU_PRU] |165| $O$K38
     573        .dwpsn  file "main.c",line 161,column 2,is_stmt,isa 0
     574 00000128 000000E1030407          SBBO      &r7.b0, r4, 3, 1      ; [ALU_PRU] |161| $O$K38,$O$K51
     575        .dwpsn  file "main.c",line 162,column 2,is_stmt,isa 0
     576 0000012c 000000E1040408          SBBO      &r8.b0, r4, 4, 1      ; [ALU_PRU] |162| $O$K38,$O$K55
     577        .dwpsn  file "main.c",line 163,column 2,is_stmt,isa 0
     578 00000130 000000E1000280          SBBO      &r0.w0, r2, 0, 2      ; [ALU_PRU] |163| len
     579        .dwpsn  file "main.c",line 165,column 5,is_stmt,isa 0
     580;----------------------------------------------------------------------
     581; 166 | // __R30 &= ~PRU0_GPIO;                                                
     582;----------------------------------------------------------------------
     583 00000134 000000F1020280          LBBO      &r0.w0, r2, 2, 2      ; [ALU_PRU] |165| dst
     584 00000138 000000108080EF          MOV       r15, r0.w0            ; [ALU_PRU] |165| 
     585 0000013c 000000F1040280          LBBO      &r0.w0, r2, 4, 2      ; [ALU_PRU] |165| src
     586 00000140 000000108080F0          MOV       r16, r0.w0            ; [ALU_PRU] |165| 
     587$C$DW$41        .dwtag  DW_TAG_TI_branch
     588        .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     589        .dwattr $C$DW$41, DW_AT_name("pru_rpmsg_send")
     590        .dwattr $C$DW$41, DW_AT_TI_call
     591 00000144 000000230000C3!         JAL       r3.w2, ||pru_rpmsg_send|| ; [ALU_PRU] |165| pru_rpmsg_send
     592        .dwpsn  file "main.c",line 167,column 5,is_stmt,isa 0
     593;----------------------------------------------------------------------
     594; 167 | __delay_cycles(200000000);                                             
     595; 168 | //      }                                                              
     596; 169 | //}                                                                    
     597;----------------------------------------------------------------------
     598        .newblock
     599 00000148 E0FF852405F5C5          LDI32    r5, 99999999
     600 00000150 0000000501E5E5  $1:     SUB      r5, r5, 1
     601 00000154 0000006F00E5FF          QBNE     $1, r5, 0             ; [ALU_PRU] |167| 
     602        .dwpsn  file "main.c",line 127,column 9,is_stmt,isa 0
     603 00000158 00000021000000!         JMP       ||$C$L5||             ; [ALU_PRU] |127| 
     604;* --------------------------------------------------------------------------*
     605        .dwattr $C$DW$32, DW_AT_TI_end_file("main.c")
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   12

     606        .dwattr $C$DW$32, DW_AT_TI_end_line(0xad)
     607        .dwattr $C$DW$32, DW_AT_TI_end_column(0x01)
     608        .dwendentry
     609        .dwendtag $C$DW$32
     610
     611;******************************************************************************
     612;* STRINGS                                                                    *
     613;******************************************************************************
     614 00000000                         .sect   ".rodata:.string"
     615 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
     616 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 30",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000030 
         00000014 00000000000000 
     617;*****************************************************************************
     618;* UNDEFINED EXTERNAL REFERENCES                                             *
     619;*****************************************************************************
     620        .global ||pru_rpmsg_init||
     621        .global ||pru_rpmsg_receive||
     622        .global ||pru_rpmsg_send||
     623        .global ||pru_rpmsg_channel||
     624
     625;******************************************************************************
     626;* TYPE INFORMATION                                                           *
     627;******************************************************************************
     628
     629$C$DW$T$19      .dwtag  DW_TAG_structure_type
     630        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     631$C$DW$42        .dwtag  DW_TAG_member
     632        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     633        .dwattr $C$DW$42, DW_AT_name("REVID")
     634        .dwattr $C$DW$42, DW_AT_TI_symbol_name("REVID")
     635        .dwattr $C$DW$42, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     636        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     638        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     639        .dwattr $C$DW$42, DW_AT_decl_line(0x2d)
     640        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     641        .dwendtag $C$DW$T$19
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   13

     642
     643        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     644        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     645        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     646$C$DW$T$108     .dwtag  DW_TAG_volatile_type
     647        .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$19)
     648
     649$C$DW$T$20      .dwtag  DW_TAG_structure_type
     650        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     651$C$DW$43        .dwtag  DW_TAG_member
     652        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     653        .dwattr $C$DW$43, DW_AT_name("IDLE_MODE")
     654        .dwattr $C$DW$43, DW_AT_TI_symbol_name("IDLE_MODE")
     655        .dwattr $C$DW$43, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     656        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     658        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     659        .dwattr $C$DW$43, DW_AT_decl_line(0x37)
     660        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     661$C$DW$44        .dwtag  DW_TAG_member
     662        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     663        .dwattr $C$DW$44, DW_AT_name("STANDBY_MODE")
     664        .dwattr $C$DW$44, DW_AT_TI_symbol_name("STANDBY_MODE")
     665        .dwattr $C$DW$44, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     666        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     668        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     669        .dwattr $C$DW$44, DW_AT_decl_line(0x38)
     670        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     671$C$DW$45        .dwtag  DW_TAG_member
     672        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     673        .dwattr $C$DW$45, DW_AT_name("STANDBY_INIT")
     674        .dwattr $C$DW$45, DW_AT_TI_symbol_name("STANDBY_INIT")
     675        .dwattr $C$DW$45, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     676        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     678        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     679        .dwattr $C$DW$45, DW_AT_decl_line(0x39)
     680        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     681$C$DW$46        .dwtag  DW_TAG_member
     682        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     683        .dwattr $C$DW$46, DW_AT_name("SUB_MWAIT")
     684        .dwattr $C$DW$46, DW_AT_TI_symbol_name("SUB_MWAIT")
     685        .dwattr $C$DW$46, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     686        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     688        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     689        .dwattr $C$DW$46, DW_AT_decl_line(0x3a)
     690        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     691$C$DW$47        .dwtag  DW_TAG_member
     692        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     693        .dwattr $C$DW$47, DW_AT_name("rsvd6")
     694        .dwattr $C$DW$47, DW_AT_TI_symbol_name("rsvd6")
     695        .dwattr $C$DW$47, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     696        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   14

     697        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     698        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     699        .dwattr $C$DW$47, DW_AT_decl_line(0x3b)
     700        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     701        .dwendtag $C$DW$T$20
     702
     703        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     704        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     705        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     706$C$DW$T$110     .dwtag  DW_TAG_volatile_type
     707        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$20)
     708
     709$C$DW$T$21      .dwtag  DW_TAG_structure_type
     710        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     711$C$DW$48        .dwtag  DW_TAG_member
     712        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     713        .dwattr $C$DW$48, DW_AT_name("PRU0_GPI_MODE")
     714        .dwattr $C$DW$48, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     715        .dwattr $C$DW$48, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     716        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     718        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     719        .dwattr $C$DW$48, DW_AT_decl_line(0x45)
     720        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     721$C$DW$49        .dwtag  DW_TAG_member
     722        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     723        .dwattr $C$DW$49, DW_AT_name("PRU0_GPI_CLK_MODE")
     724        .dwattr $C$DW$49, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     725        .dwattr $C$DW$49, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     726        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     728        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     729        .dwattr $C$DW$49, DW_AT_decl_line(0x46)
     730        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     731$C$DW$50        .dwtag  DW_TAG_member
     732        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     733        .dwattr $C$DW$50, DW_AT_name("PRU0_GPI_DIV0")
     734        .dwattr $C$DW$50, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     735        .dwattr $C$DW$50, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     736        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     738        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     739        .dwattr $C$DW$50, DW_AT_decl_line(0x47)
     740        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     741$C$DW$51        .dwtag  DW_TAG_member
     742        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     743        .dwattr $C$DW$51, DW_AT_name("PRU0_GPI_DIV1")
     744        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     745        .dwattr $C$DW$51, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     746        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     748        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     749        .dwattr $C$DW$51, DW_AT_decl_line(0x48)
     750        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     751$C$DW$52        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   15

     752        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     753        .dwattr $C$DW$52, DW_AT_name("PRU0_GPI_SB")
     754        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     755        .dwattr $C$DW$52, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     756        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     758        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     759        .dwattr $C$DW$52, DW_AT_decl_line(0x49)
     760        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     761$C$DW$53        .dwtag  DW_TAG_member
     762        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     763        .dwattr $C$DW$53, DW_AT_name("PRU0_GPO_MODE")
     764        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     765        .dwattr $C$DW$53, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     766        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     768        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     769        .dwattr $C$DW$53, DW_AT_decl_line(0x4a)
     770        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     771$C$DW$54        .dwtag  DW_TAG_member
     772        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     773        .dwattr $C$DW$54, DW_AT_name("PRU0_GPO_DIV0")
     774        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     775        .dwattr $C$DW$54, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     776        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     777        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     778        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     779        .dwattr $C$DW$54, DW_AT_decl_line(0x4b)
     780        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     781$C$DW$55        .dwtag  DW_TAG_member
     782        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     783        .dwattr $C$DW$55, DW_AT_name("PRU0_GPO_DIV1")
     784        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     785        .dwattr $C$DW$55, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     786        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     788        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     789        .dwattr $C$DW$55, DW_AT_decl_line(0x4c)
     790        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     791$C$DW$56        .dwtag  DW_TAG_member
     792        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     793        .dwattr $C$DW$56, DW_AT_name("PRU0_GPO_SH_SEL")
     794        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     795        .dwattr $C$DW$56, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     796        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     798        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     799        .dwattr $C$DW$56, DW_AT_decl_line(0x4d)
     800        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     801$C$DW$57        .dwtag  DW_TAG_member
     802        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     803        .dwattr $C$DW$57, DW_AT_name("rsvd26")
     804        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd26")
     805        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     806        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   16

     807        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     808        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     809        .dwattr $C$DW$57, DW_AT_decl_line(0x4e)
     810        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     811        .dwendtag $C$DW$T$21
     812
     813        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     814        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     815        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     816$C$DW$T$112     .dwtag  DW_TAG_volatile_type
     817        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$21)
     818
     819$C$DW$T$22      .dwtag  DW_TAG_structure_type
     820        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     821$C$DW$58        .dwtag  DW_TAG_member
     822        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     823        .dwattr $C$DW$58, DW_AT_name("PRU1_GPI_MODE")
     824        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     825        .dwattr $C$DW$58, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     826        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     828        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     829        .dwattr $C$DW$58, DW_AT_decl_line(0x58)
     830        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     831$C$DW$59        .dwtag  DW_TAG_member
     832        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     833        .dwattr $C$DW$59, DW_AT_name("PRU1_GPI_CLK_MODE")
     834        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     835        .dwattr $C$DW$59, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     836        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     838        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     839        .dwattr $C$DW$59, DW_AT_decl_line(0x59)
     840        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     841$C$DW$60        .dwtag  DW_TAG_member
     842        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     843        .dwattr $C$DW$60, DW_AT_name("PRU1_GPI_DIV0")
     844        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     845        .dwattr $C$DW$60, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     846        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     848        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     849        .dwattr $C$DW$60, DW_AT_decl_line(0x5a)
     850        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     851$C$DW$61        .dwtag  DW_TAG_member
     852        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     853        .dwattr $C$DW$61, DW_AT_name("PRU1_GPI_DIV1")
     854        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     855        .dwattr $C$DW$61, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     856        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     857        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     858        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     859        .dwattr $C$DW$61, DW_AT_decl_line(0x5b)
     860        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     861$C$DW$62        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     862        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     863        .dwattr $C$DW$62, DW_AT_name("PRU1_GPI_SB")
     864        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     865        .dwattr $C$DW$62, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     866        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     868        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     869        .dwattr $C$DW$62, DW_AT_decl_line(0x5c)
     870        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     871$C$DW$63        .dwtag  DW_TAG_member
     872        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     873        .dwattr $C$DW$63, DW_AT_name("PRU1_GPO_MODE")
     874        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     875        .dwattr $C$DW$63, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     876        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     878        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     879        .dwattr $C$DW$63, DW_AT_decl_line(0x5d)
     880        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     881$C$DW$64        .dwtag  DW_TAG_member
     882        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     883        .dwattr $C$DW$64, DW_AT_name("PRU1_GPO_DIV0")
     884        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     885        .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     886        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     888        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     889        .dwattr $C$DW$64, DW_AT_decl_line(0x5e)
     890        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     891$C$DW$65        .dwtag  DW_TAG_member
     892        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     893        .dwattr $C$DW$65, DW_AT_name("PRU1_GPO_DIV1")
     894        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     895        .dwattr $C$DW$65, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     896        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     898        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     899        .dwattr $C$DW$65, DW_AT_decl_line(0x5f)
     900        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     901$C$DW$66        .dwtag  DW_TAG_member
     902        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     903        .dwattr $C$DW$66, DW_AT_name("PRU1_GPO_SH_SEL")
     904        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     905        .dwattr $C$DW$66, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     906        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     908        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     909        .dwattr $C$DW$66, DW_AT_decl_line(0x60)
     910        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     911$C$DW$67        .dwtag  DW_TAG_member
     912        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     913        .dwattr $C$DW$67, DW_AT_name("rsvd26")
     914        .dwattr $C$DW$67, DW_AT_TI_symbol_name("rsvd26")
     915        .dwattr $C$DW$67, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     916        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     917        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     918        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     919        .dwattr $C$DW$67, DW_AT_decl_line(0x61)
     920        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     921        .dwendtag $C$DW$T$22
     922
     923        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     924        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     925        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     926$C$DW$T$114     .dwtag  DW_TAG_volatile_type
     927        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$22)
     928
     929$C$DW$T$23      .dwtag  DW_TAG_structure_type
     930        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     931$C$DW$68        .dwtag  DW_TAG_member
     932        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     933        .dwattr $C$DW$68, DW_AT_name("PRU0_CLK_STOP_REQ")
     934        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     935        .dwattr $C$DW$68, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     936        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     937        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     938        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     939        .dwattr $C$DW$68, DW_AT_decl_line(0x6b)
     940        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     941$C$DW$69        .dwtag  DW_TAG_member
     942        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     943        .dwattr $C$DW$69, DW_AT_name("PRU0_CLK_STOP_ACK")
     944        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     945        .dwattr $C$DW$69, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     946        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     948        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     949        .dwattr $C$DW$69, DW_AT_decl_line(0x6c)
     950        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     951$C$DW$70        .dwtag  DW_TAG_member
     952        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     953        .dwattr $C$DW$70, DW_AT_name("PRU0_CLK_EN")
     954        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     955        .dwattr $C$DW$70, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     956        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     958        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     959        .dwattr $C$DW$70, DW_AT_decl_line(0x6d)
     960        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     961$C$DW$71        .dwtag  DW_TAG_member
     962        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     963        .dwattr $C$DW$71, DW_AT_name("PRU1_CLK_STOP_REQ")
     964        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     965        .dwattr $C$DW$71, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     966        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     968        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     969        .dwattr $C$DW$71, DW_AT_decl_line(0x6e)
     970        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     971$C$DW$72        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     972        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     973        .dwattr $C$DW$72, DW_AT_name("PRU1_CLK_STOP_ACK")
     974        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     975        .dwattr $C$DW$72, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     976        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     978        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     979        .dwattr $C$DW$72, DW_AT_decl_line(0x6f)
     980        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     981$C$DW$73        .dwtag  DW_TAG_member
     982        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     983        .dwattr $C$DW$73, DW_AT_name("PRU1_CLK_EN")
     984        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     985        .dwattr $C$DW$73, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     986        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     988        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     989        .dwattr $C$DW$73, DW_AT_decl_line(0x70)
     990        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     991$C$DW$74        .dwtag  DW_TAG_member
     992        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     993        .dwattr $C$DW$74, DW_AT_name("INTC_CLK_STOP_REQ")
     994        .dwattr $C$DW$74, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     995        .dwattr $C$DW$74, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     996        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     997        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     998        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     999        .dwattr $C$DW$74, DW_AT_decl_line(0x71)
    1000        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1001$C$DW$75        .dwtag  DW_TAG_member
    1002        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1003        .dwattr $C$DW$75, DW_AT_name("INTC_CLK_STOP_ACK")
    1004        .dwattr $C$DW$75, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1005        .dwattr $C$DW$75, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1006        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1008        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1009        .dwattr $C$DW$75, DW_AT_decl_line(0x72)
    1010        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1011$C$DW$76        .dwtag  DW_TAG_member
    1012        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1013        .dwattr $C$DW$76, DW_AT_name("INTC_CLK_EN")
    1014        .dwattr $C$DW$76, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1015        .dwattr $C$DW$76, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1016        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1018        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1019        .dwattr $C$DW$76, DW_AT_decl_line(0x73)
    1020        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1021$C$DW$77        .dwtag  DW_TAG_member
    1022        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1023        .dwattr $C$DW$77, DW_AT_name("UART_CLK_STOP_REQ")
    1024        .dwattr $C$DW$77, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1025        .dwattr $C$DW$77, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1026        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1027        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1028        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1029        .dwattr $C$DW$77, DW_AT_decl_line(0x74)
    1030        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1031$C$DW$78        .dwtag  DW_TAG_member
    1032        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1033        .dwattr $C$DW$78, DW_AT_name("UART_CLK_STOP_ACK")
    1034        .dwattr $C$DW$78, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1035        .dwattr $C$DW$78, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1036        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1038        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1039        .dwattr $C$DW$78, DW_AT_decl_line(0x75)
    1040        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1041$C$DW$79        .dwtag  DW_TAG_member
    1042        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1043        .dwattr $C$DW$79, DW_AT_name("UART_CLK_EN")
    1044        .dwattr $C$DW$79, DW_AT_TI_symbol_name("UART_CLK_EN")
    1045        .dwattr $C$DW$79, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1046        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1047        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1048        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1049        .dwattr $C$DW$79, DW_AT_decl_line(0x76)
    1050        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1051$C$DW$80        .dwtag  DW_TAG_member
    1052        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1053        .dwattr $C$DW$80, DW_AT_name("ECAP_CLK_STOP_REQ")
    1054        .dwattr $C$DW$80, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1055        .dwattr $C$DW$80, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1056        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1058        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1059        .dwattr $C$DW$80, DW_AT_decl_line(0x77)
    1060        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1061$C$DW$81        .dwtag  DW_TAG_member
    1062        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1063        .dwattr $C$DW$81, DW_AT_name("ECAP_CLK_STOP_ACK")
    1064        .dwattr $C$DW$81, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1065        .dwattr $C$DW$81, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1066        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1068        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1069        .dwattr $C$DW$81, DW_AT_decl_line(0x78)
    1070        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1071$C$DW$82        .dwtag  DW_TAG_member
    1072        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1073        .dwattr $C$DW$82, DW_AT_name("ECAP_CLK_EN")
    1074        .dwattr $C$DW$82, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1075        .dwattr $C$DW$82, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1076        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1078        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1079        .dwattr $C$DW$82, DW_AT_decl_line(0x79)
    1080        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1081$C$DW$83        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1082        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1083        .dwattr $C$DW$83, DW_AT_name("IEP_CLK_STOP_REQ")
    1084        .dwattr $C$DW$83, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1085        .dwattr $C$DW$83, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1086        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1088        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1089        .dwattr $C$DW$83, DW_AT_decl_line(0x7a)
    1090        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1091$C$DW$84        .dwtag  DW_TAG_member
    1092        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1093        .dwattr $C$DW$84, DW_AT_name("IEP_CLK_STOP_ACK")
    1094        .dwattr $C$DW$84, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1095        .dwattr $C$DW$84, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1096        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1098        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1099        .dwattr $C$DW$84, DW_AT_decl_line(0x7b)
    1100        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1101$C$DW$85        .dwtag  DW_TAG_member
    1102        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1103        .dwattr $C$DW$85, DW_AT_name("IEP_CLK_EN")
    1104        .dwattr $C$DW$85, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1105        .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1106        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1108        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1109        .dwattr $C$DW$85, DW_AT_decl_line(0x7c)
    1110        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1111$C$DW$86        .dwtag  DW_TAG_member
    1112        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1113        .dwattr $C$DW$86, DW_AT_name("rsvd18")
    1114        .dwattr $C$DW$86, DW_AT_TI_symbol_name("rsvd18")
    1115        .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1116        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1118        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1119        .dwattr $C$DW$86, DW_AT_decl_line(0x7d)
    1120        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1121        .dwendtag $C$DW$T$23
    1122
    1123        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1124        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1125        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1126$C$DW$T$116     .dwtag  DW_TAG_volatile_type
    1127        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
    1128
    1129$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1130        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1131$C$DW$87        .dwtag  DW_TAG_member
    1132        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1133        .dwattr $C$DW$87, DW_AT_name("PRU0_IMEM_PE_RAW")
    1134        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1135        .dwattr $C$DW$87, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1136        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1137        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1138        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1139        .dwattr $C$DW$87, DW_AT_decl_line(0x87)
    1140        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1141$C$DW$88        .dwtag  DW_TAG_member
    1142        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1143        .dwattr $C$DW$88, DW_AT_name("PRU0_DMEM_PE_RAW")
    1144        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1145        .dwattr $C$DW$88, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1146        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1148        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1149        .dwattr $C$DW$88, DW_AT_decl_line(0x88)
    1150        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1151$C$DW$89        .dwtag  DW_TAG_member
    1152        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1153        .dwattr $C$DW$89, DW_AT_name("PRU1_IMEM_PE_RAW")
    1154        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1155        .dwattr $C$DW$89, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1156        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1158        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1159        .dwattr $C$DW$89, DW_AT_decl_line(0x89)
    1160        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1161$C$DW$90        .dwtag  DW_TAG_member
    1162        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1163        .dwattr $C$DW$90, DW_AT_name("PRU1_DMEM_PE_RAW")
    1164        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1165        .dwattr $C$DW$90, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1166        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1168        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1169        .dwattr $C$DW$90, DW_AT_decl_line(0x8a)
    1170        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1171$C$DW$91        .dwtag  DW_TAG_member
    1172        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1173        .dwattr $C$DW$91, DW_AT_name("RAM_PE_RAW")
    1174        .dwattr $C$DW$91, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1175        .dwattr $C$DW$91, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1176        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1178        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1179        .dwattr $C$DW$91, DW_AT_decl_line(0x8b)
    1180        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1181$C$DW$92        .dwtag  DW_TAG_member
    1182        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1183        .dwattr $C$DW$92, DW_AT_name("rsvd20")
    1184        .dwattr $C$DW$92, DW_AT_TI_symbol_name("rsvd20")
    1185        .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1186        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1188        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1189        .dwattr $C$DW$92, DW_AT_decl_line(0x8c)
    1190        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1191        .dwendtag $C$DW$T$24
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1192
    1193        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1194        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1195        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1196$C$DW$T$118     .dwtag  DW_TAG_volatile_type
    1197        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$24)
    1198
    1199$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1200        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1201$C$DW$93        .dwtag  DW_TAG_member
    1202        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1203        .dwattr $C$DW$93, DW_AT_name("PRU0_IMEM_PE")
    1204        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1205        .dwattr $C$DW$93, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1206        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1208        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1209        .dwattr $C$DW$93, DW_AT_decl_line(0x96)
    1210        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1211$C$DW$94        .dwtag  DW_TAG_member
    1212        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1213        .dwattr $C$DW$94, DW_AT_name("PRU0_DMEM_PE")
    1214        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1215        .dwattr $C$DW$94, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1216        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1217        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1218        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1219        .dwattr $C$DW$94, DW_AT_decl_line(0x97)
    1220        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1221$C$DW$95        .dwtag  DW_TAG_member
    1222        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1223        .dwattr $C$DW$95, DW_AT_name("PRU1_IMEM_PE")
    1224        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1225        .dwattr $C$DW$95, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1226        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1228        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1229        .dwattr $C$DW$95, DW_AT_decl_line(0x98)
    1230        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1231$C$DW$96        .dwtag  DW_TAG_member
    1232        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1233        .dwattr $C$DW$96, DW_AT_name("PRU1_DMEM_PE")
    1234        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1235        .dwattr $C$DW$96, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1236        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1238        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1239        .dwattr $C$DW$96, DW_AT_decl_line(0x99)
    1240        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1241$C$DW$97        .dwtag  DW_TAG_member
    1242        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1243        .dwattr $C$DW$97, DW_AT_name("RAM_PE")
    1244        .dwattr $C$DW$97, DW_AT_TI_symbol_name("RAM_PE")
    1245        .dwattr $C$DW$97, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1246        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1247        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1248        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1249        .dwattr $C$DW$97, DW_AT_decl_line(0x9a)
    1250        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1251$C$DW$98        .dwtag  DW_TAG_member
    1252        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1253        .dwattr $C$DW$98, DW_AT_name("rsvd20")
    1254        .dwattr $C$DW$98, DW_AT_TI_symbol_name("rsvd20")
    1255        .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1256        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1258        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1259        .dwattr $C$DW$98, DW_AT_decl_line(0x9b)
    1260        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1261        .dwendtag $C$DW$T$25
    1262
    1263        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1264        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1265        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1266$C$DW$T$120     .dwtag  DW_TAG_volatile_type
    1267        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    1268
    1269$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1270        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1271$C$DW$99        .dwtag  DW_TAG_member
    1272        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1273        .dwattr $C$DW$99, DW_AT_name("PRU0_IMEM_PE_SET")
    1274        .dwattr $C$DW$99, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1275        .dwattr $C$DW$99, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1276        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1278        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1279        .dwattr $C$DW$99, DW_AT_decl_line(0xa4)
    1280        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1281$C$DW$100       .dwtag  DW_TAG_member
    1282        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1283        .dwattr $C$DW$100, DW_AT_name("PRU0_DMEM_PE_SET")
    1284        .dwattr $C$DW$100, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1285        .dwattr $C$DW$100, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1286        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1288        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1289        .dwattr $C$DW$100, DW_AT_decl_line(0xa5)
    1290        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1291$C$DW$101       .dwtag  DW_TAG_member
    1292        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1293        .dwattr $C$DW$101, DW_AT_name("PRU1_IMEM_PE_SET")
    1294        .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1295        .dwattr $C$DW$101, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1296        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1298        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1299        .dwattr $C$DW$101, DW_AT_decl_line(0xa6)
    1300        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1301$C$DW$102       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1302        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1303        .dwattr $C$DW$102, DW_AT_name("PRU1_DMEM_PE_SET")
    1304        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1305        .dwattr $C$DW$102, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1306        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1308        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1309        .dwattr $C$DW$102, DW_AT_decl_line(0xa7)
    1310        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1311$C$DW$103       .dwtag  DW_TAG_member
    1312        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1313        .dwattr $C$DW$103, DW_AT_name("RAM_PE_SET")
    1314        .dwattr $C$DW$103, DW_AT_TI_symbol_name("RAM_PE_SET")
    1315        .dwattr $C$DW$103, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1316        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1318        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1319        .dwattr $C$DW$103, DW_AT_decl_line(0xa8)
    1320        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1321$C$DW$104       .dwtag  DW_TAG_member
    1322        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1323        .dwattr $C$DW$104, DW_AT_name("rsvd20")
    1324        .dwattr $C$DW$104, DW_AT_TI_symbol_name("rsvd20")
    1325        .dwattr $C$DW$104, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1326        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1328        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1329        .dwattr $C$DW$104, DW_AT_decl_line(0xa9)
    1330        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1331        .dwendtag $C$DW$T$26
    1332
    1333        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1334        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1335        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1336$C$DW$T$122     .dwtag  DW_TAG_volatile_type
    1337        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$26)
    1338
    1339$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1340        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1341$C$DW$105       .dwtag  DW_TAG_member
    1342        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1343        .dwattr $C$DW$105, DW_AT_name("PRU0_IMEM_PE_CLR")
    1344        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1345        .dwattr $C$DW$105, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1346        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1348        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1349        .dwattr $C$DW$105, DW_AT_decl_line(0xb3)
    1350        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1351$C$DW$106       .dwtag  DW_TAG_member
    1352        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1353        .dwattr $C$DW$106, DW_AT_name("PRU0_DMEM_PE_CLR")
    1354        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1355        .dwattr $C$DW$106, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1356        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1357        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1358        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1359        .dwattr $C$DW$106, DW_AT_decl_line(0xb4)
    1360        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1361$C$DW$107       .dwtag  DW_TAG_member
    1362        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1363        .dwattr $C$DW$107, DW_AT_name("PRU1_IMEM_PE_CLR")
    1364        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1365        .dwattr $C$DW$107, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1366        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1368        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1369        .dwattr $C$DW$107, DW_AT_decl_line(0xb5)
    1370        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1371$C$DW$108       .dwtag  DW_TAG_member
    1372        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1373        .dwattr $C$DW$108, DW_AT_name("PRU1_DMEM_PE_CLR")
    1374        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1375        .dwattr $C$DW$108, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1376        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1378        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1379        .dwattr $C$DW$108, DW_AT_decl_line(0xb6)
    1380        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1381$C$DW$109       .dwtag  DW_TAG_member
    1382        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1383        .dwattr $C$DW$109, DW_AT_name("rsvd16")
    1384        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd16")
    1385        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1386        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1388        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1389        .dwattr $C$DW$109, DW_AT_decl_line(0xb7)
    1390        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1391        .dwendtag $C$DW$T$27
    1392
    1393        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1394        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1395        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1396$C$DW$T$124     .dwtag  DW_TAG_volatile_type
    1397        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$27)
    1398
    1399$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1400        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1401$C$DW$110       .dwtag  DW_TAG_member
    1402        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1403        .dwattr $C$DW$110, DW_AT_name("PMAO_PRU0")
    1404        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PMAO_PRU0")
    1405        .dwattr $C$DW$110, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1406        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1408        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1409        .dwattr $C$DW$110, DW_AT_decl_line(0xc4)
    1410        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1411$C$DW$111       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1412        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1413        .dwattr $C$DW$111, DW_AT_name("PMAO_PRU1")
    1414        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PMAO_PRU1")
    1415        .dwattr $C$DW$111, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1416        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1418        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1419        .dwattr $C$DW$111, DW_AT_decl_line(0xc5)
    1420        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1421$C$DW$112       .dwtag  DW_TAG_member
    1422        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1423        .dwattr $C$DW$112, DW_AT_name("rsvd2")
    1424        .dwattr $C$DW$112, DW_AT_TI_symbol_name("rsvd2")
    1425        .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1426        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1428        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1429        .dwattr $C$DW$112, DW_AT_decl_line(0xc6)
    1430        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1431        .dwendtag $C$DW$T$28
    1432
    1433        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1434        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1435        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1436$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1437        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$28)
    1438
    1439$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1440        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1441$C$DW$113       .dwtag  DW_TAG_member
    1442        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1443        .dwattr $C$DW$113, DW_AT_name("OCP_EN")
    1444        .dwattr $C$DW$113, DW_AT_TI_symbol_name("OCP_EN")
    1445        .dwattr $C$DW$113, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1446        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1448        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1449        .dwattr $C$DW$113, DW_AT_decl_line(0xd3)
    1450        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1451$C$DW$114       .dwtag  DW_TAG_member
    1452        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1453        .dwattr $C$DW$114, DW_AT_name("rsvd1")
    1454        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd1")
    1455        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1456        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1458        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1459        .dwattr $C$DW$114, DW_AT_decl_line(0xd4)
    1460        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1461        .dwendtag $C$DW$T$29
    1462
    1463        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1464        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1465        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1466$C$DW$T$128     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1467        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$29)
    1468
    1469$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1470        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1471$C$DW$115       .dwtag  DW_TAG_member
    1472        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1473        .dwattr $C$DW$115, DW_AT_name("PRU1_PAD_HP_EN")
    1474        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1475        .dwattr $C$DW$115, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1476        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1478        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1479        .dwattr $C$DW$115, DW_AT_decl_line(0xde)
    1480        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1481$C$DW$116       .dwtag  DW_TAG_member
    1482        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1483        .dwattr $C$DW$116, DW_AT_name("XFR_SHIFT_EN")
    1484        .dwattr $C$DW$116, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1485        .dwattr $C$DW$116, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1486        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1488        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1489        .dwattr $C$DW$116, DW_AT_decl_line(0xdf)
    1490        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1491$C$DW$117       .dwtag  DW_TAG_member
    1492        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1493        .dwattr $C$DW$117, DW_AT_name("rsvd2")
    1494        .dwattr $C$DW$117, DW_AT_TI_symbol_name("rsvd2")
    1495        .dwattr $C$DW$117, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1496        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1498        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1499        .dwattr $C$DW$117, DW_AT_decl_line(0xe0)
    1500        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1501        .dwendtag $C$DW$T$30
    1502
    1503        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1504        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1505        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1506$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    1507        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$30)
    1508
    1509$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1510        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1511$C$DW$118       .dwtag  DW_TAG_member
    1512        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1513        .dwattr $C$DW$118, DW_AT_name("PIN_MUX_SEL")
    1514        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1515        .dwattr $C$DW$118, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1516        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1518        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1519        .dwattr $C$DW$118, DW_AT_decl_line(0xec)
    1520        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1521$C$DW$119       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1522        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1523        .dwattr $C$DW$119, DW_AT_name("rsvd2")
    1524        .dwattr $C$DW$119, DW_AT_TI_symbol_name("rsvd2")
    1525        .dwattr $C$DW$119, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1526        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1528        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1529        .dwattr $C$DW$119, DW_AT_decl_line(0xed)
    1530        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1531        .dwendtag $C$DW$T$31
    1532
    1533        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1534        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1535        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1536$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    1537        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    1538
    1539$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1540        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1541$C$DW$120       .dwtag  DW_TAG_member
    1542        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$109)
    1543        .dwattr $C$DW$120, DW_AT_name("$P$T0")
    1544        .dwattr $C$DW$120, DW_AT_TI_symbol_name("$P$T0")
    1545        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1547        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1548        .dwattr $C$DW$120, DW_AT_decl_line(0x29)
    1549        .dwattr $C$DW$120, DW_AT_decl_column(0x02)
    1550$C$DW$121       .dwtag  DW_TAG_member
    1551        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$111)
    1552        .dwattr $C$DW$121, DW_AT_name("$P$T1")
    1553        .dwattr $C$DW$121, DW_AT_TI_symbol_name("$P$T1")
    1554        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1555        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1556        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1557        .dwattr $C$DW$121, DW_AT_decl_line(0x33)
    1558        .dwattr $C$DW$121, DW_AT_decl_column(0x02)
    1559$C$DW$122       .dwtag  DW_TAG_member
    1560        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$113)
    1561        .dwattr $C$DW$122, DW_AT_name("$P$T2")
    1562        .dwattr $C$DW$122, DW_AT_TI_symbol_name("$P$T2")
    1563        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1564        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1565        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1566        .dwattr $C$DW$122, DW_AT_decl_line(0x41)
    1567        .dwattr $C$DW$122, DW_AT_decl_column(0x02)
    1568$C$DW$123       .dwtag  DW_TAG_member
    1569        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$115)
    1570        .dwattr $C$DW$123, DW_AT_name("$P$T3")
    1571        .dwattr $C$DW$123, DW_AT_TI_symbol_name("$P$T3")
    1572        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1573        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1574        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1575        .dwattr $C$DW$123, DW_AT_decl_line(0x54)
    1576        .dwattr $C$DW$123, DW_AT_decl_column(0x02)
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1577$C$DW$124       .dwtag  DW_TAG_member
    1578        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$117)
    1579        .dwattr $C$DW$124, DW_AT_name("$P$T4")
    1580        .dwattr $C$DW$124, DW_AT_TI_symbol_name("$P$T4")
    1581        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1582        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1584        .dwattr $C$DW$124, DW_AT_decl_line(0x67)
    1585        .dwattr $C$DW$124, DW_AT_decl_column(0x02)
    1586$C$DW$125       .dwtag  DW_TAG_member
    1587        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$119)
    1588        .dwattr $C$DW$125, DW_AT_name("$P$T5")
    1589        .dwattr $C$DW$125, DW_AT_TI_symbol_name("$P$T5")
    1590        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1591        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1592        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1593        .dwattr $C$DW$125, DW_AT_decl_line(0x83)
    1594        .dwattr $C$DW$125, DW_AT_decl_column(0x02)
    1595$C$DW$126       .dwtag  DW_TAG_member
    1596        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$121)
    1597        .dwattr $C$DW$126, DW_AT_name("$P$T6")
    1598        .dwattr $C$DW$126, DW_AT_TI_symbol_name("$P$T6")
    1599        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1600        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1601        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1602        .dwattr $C$DW$126, DW_AT_decl_line(0x92)
    1603        .dwattr $C$DW$126, DW_AT_decl_column(0x02)
    1604$C$DW$127       .dwtag  DW_TAG_member
    1605        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$123)
    1606        .dwattr $C$DW$127, DW_AT_name("$P$T7")
    1607        .dwattr $C$DW$127, DW_AT_TI_symbol_name("$P$T7")
    1608        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1609        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1610        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1611        .dwattr $C$DW$127, DW_AT_decl_line(0xa0)
    1612        .dwattr $C$DW$127, DW_AT_decl_column(0x02)
    1613$C$DW$128       .dwtag  DW_TAG_member
    1614        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$125)
    1615        .dwattr $C$DW$128, DW_AT_name("$P$T8")
    1616        .dwattr $C$DW$128, DW_AT_TI_symbol_name("$P$T8")
    1617        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1618        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1619        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1620        .dwattr $C$DW$128, DW_AT_decl_line(0xaf)
    1621        .dwattr $C$DW$128, DW_AT_decl_column(0x02)
    1622$C$DW$129       .dwtag  DW_TAG_member
    1623        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    1624        .dwattr $C$DW$129, DW_AT_name("rsvd24")
    1625        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd24")
    1626        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1627        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1628        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1629        .dwattr $C$DW$129, DW_AT_decl_line(0xbc)
    1630        .dwattr $C$DW$129, DW_AT_decl_column(0x0b)
    1631$C$DW$130       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1632        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$127)
    1633        .dwattr $C$DW$130, DW_AT_name("$P$T9")
    1634        .dwattr $C$DW$130, DW_AT_TI_symbol_name("$P$T9")
    1635        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1636        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1637        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1638        .dwattr $C$DW$130, DW_AT_decl_line(0xc0)
    1639        .dwattr $C$DW$130, DW_AT_decl_column(0x02)
    1640$C$DW$131       .dwtag  DW_TAG_member
    1641        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    1642        .dwattr $C$DW$131, DW_AT_name("rsvd2c")
    1643        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd2c")
    1644        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1645        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1646        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1647        .dwattr $C$DW$131, DW_AT_decl_line(0xcb)
    1648        .dwattr $C$DW$131, DW_AT_decl_column(0x0b)
    1649$C$DW$132       .dwtag  DW_TAG_member
    1650        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$129)
    1651        .dwattr $C$DW$132, DW_AT_name("$P$T10")
    1652        .dwattr $C$DW$132, DW_AT_TI_symbol_name("$P$T10")
    1653        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1654        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1655        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1656        .dwattr $C$DW$132, DW_AT_decl_line(0xcf)
    1657        .dwattr $C$DW$132, DW_AT_decl_column(0x02)
    1658$C$DW$133       .dwtag  DW_TAG_member
    1659        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$131)
    1660        .dwattr $C$DW$133, DW_AT_name("$P$T11")
    1661        .dwattr $C$DW$133, DW_AT_TI_symbol_name("$P$T11")
    1662        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1663        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1664        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1665        .dwattr $C$DW$133, DW_AT_decl_line(0xda)
    1666        .dwattr $C$DW$133, DW_AT_decl_column(0x02)
    1667$C$DW$134       .dwtag  DW_TAG_member
    1668        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$34)
    1669        .dwattr $C$DW$134, DW_AT_name("rsvd38")
    1670        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd38")
    1671        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1672        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1673        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1674        .dwattr $C$DW$134, DW_AT_decl_line(0xe5)
    1675        .dwattr $C$DW$134, DW_AT_decl_column(0x0b)
    1676$C$DW$135       .dwtag  DW_TAG_member
    1677        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$133)
    1678        .dwattr $C$DW$135, DW_AT_name("$P$T12")
    1679        .dwattr $C$DW$135, DW_AT_TI_symbol_name("$P$T12")
    1680        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1681        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1682        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1683        .dwattr $C$DW$135, DW_AT_decl_line(0xe8)
    1684        .dwattr $C$DW$135, DW_AT_decl_column(0x02)
    1685        .dwendtag $C$DW$T$35
    1686
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1687        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1688        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1689        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1690$C$DW$T$290     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1691        .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$35)
    1692        .dwattr $C$DW$T$290, DW_AT_language(DW_LANG_C)
    1693        .dwattr $C$DW$T$290, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    1694        .dwattr $C$DW$T$290, DW_AT_decl_line(0xf0)
    1695        .dwattr $C$DW$T$290, DW_AT_decl_column(0x03)
    1696$C$DW$T$291     .dwtag  DW_TAG_volatile_type
    1697        .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    1698
    1699$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1700        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1701$C$DW$136       .dwtag  DW_TAG_member
    1702        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    1703        .dwattr $C$DW$136, DW_AT_name("REV_MINOR")
    1704        .dwattr $C$DW$136, DW_AT_TI_symbol_name("REV_MINOR")
    1705        .dwattr $C$DW$136, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1706        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1708        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1709        .dwattr $C$DW$136, DW_AT_decl_line(0x2d)
    1710        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1711$C$DW$137       .dwtag  DW_TAG_member
    1712        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1713        .dwattr $C$DW$137, DW_AT_name("REV_CUSTOM")
    1714        .dwattr $C$DW$137, DW_AT_TI_symbol_name("REV_CUSTOM")
    1715        .dwattr $C$DW$137, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1716        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1718        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1719        .dwattr $C$DW$137, DW_AT_decl_line(0x2e)
    1720        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1721$C$DW$138       .dwtag  DW_TAG_member
    1722        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1723        .dwattr $C$DW$138, DW_AT_name("REV_MAJOR")
    1724        .dwattr $C$DW$138, DW_AT_TI_symbol_name("REV_MAJOR")
    1725        .dwattr $C$DW$138, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1726        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1728        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1729        .dwattr $C$DW$138, DW_AT_decl_line(0x2f)
    1730        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1731$C$DW$139       .dwtag  DW_TAG_member
    1732        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1733        .dwattr $C$DW$139, DW_AT_name("REV_RTL")
    1734        .dwattr $C$DW$139, DW_AT_TI_symbol_name("REV_RTL")
    1735        .dwattr $C$DW$139, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1736        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1738        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1739        .dwattr $C$DW$139, DW_AT_decl_line(0x30)
    1740        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    1741$C$DW$140       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1742        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    1743        .dwattr $C$DW$140, DW_AT_name("REV_MODULE")
    1744        .dwattr $C$DW$140, DW_AT_TI_symbol_name("REV_MODULE")
    1745        .dwattr $C$DW$140, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1746        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1747        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1748        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1749        .dwattr $C$DW$140, DW_AT_decl_line(0x31)
    1750        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    1751$C$DW$141       .dwtag  DW_TAG_member
    1752        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    1753        .dwattr $C$DW$141, DW_AT_name("rsvd28")
    1754        .dwattr $C$DW$141, DW_AT_TI_symbol_name("rsvd28")
    1755        .dwattr $C$DW$141, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1756        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1758        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1759        .dwattr $C$DW$141, DW_AT_decl_line(0x32)
    1760        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    1761$C$DW$142       .dwtag  DW_TAG_member
    1762        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    1763        .dwattr $C$DW$142, DW_AT_name("REV_SCHEME")
    1764        .dwattr $C$DW$142, DW_AT_TI_symbol_name("REV_SCHEME")
    1765        .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1766        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1768        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1769        .dwattr $C$DW$142, DW_AT_decl_line(0x33)
    1770        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    1771        .dwendtag $C$DW$T$36
    1772
    1773        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1774        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    1775        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1776$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    1777        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$36)
    1778
    1779$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1780        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1781$C$DW$143       .dwtag  DW_TAG_member
    1782        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    1783        .dwattr $C$DW$143, DW_AT_name("rsvd0")
    1784        .dwattr $C$DW$143, DW_AT_TI_symbol_name("rsvd0")
    1785        .dwattr $C$DW$143, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1786        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1787        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1788        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1789        .dwattr $C$DW$143, DW_AT_decl_line(0x3d)
    1790        .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    1791$C$DW$144       .dwtag  DW_TAG_member
    1792        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    1793        .dwattr $C$DW$144, DW_AT_name("NEST_MODE")
    1794        .dwattr $C$DW$144, DW_AT_TI_symbol_name("NEST_MODE")
    1795        .dwattr $C$DW$144, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1796        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1797        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1798        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1799        .dwattr $C$DW$144, DW_AT_decl_line(0x3e)
    1800        .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    1801$C$DW$145       .dwtag  DW_TAG_member
    1802        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    1803        .dwattr $C$DW$145, DW_AT_name("rsvd4")
    1804        .dwattr $C$DW$145, DW_AT_TI_symbol_name("rsvd4")
    1805        .dwattr $C$DW$145, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    1806        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1808        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1809        .dwattr $C$DW$145, DW_AT_decl_line(0x3f)
    1810        .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    1811        .dwendtag $C$DW$T$37
    1812
    1813        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1814        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    1815        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1816$C$DW$T$136     .dwtag  DW_TAG_volatile_type
    1817        .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$37)
    1818
    1819$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1820        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1821$C$DW$146       .dwtag  DW_TAG_member
    1822        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    1823        .dwattr $C$DW$146, DW_AT_name("EN_HINT_ANY")
    1824        .dwattr $C$DW$146, DW_AT_TI_symbol_name("EN_HINT_ANY")
    1825        .dwattr $C$DW$146, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1826        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1828        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1829        .dwattr $C$DW$146, DW_AT_decl_line(0x4c)
    1830        .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    1831$C$DW$147       .dwtag  DW_TAG_member
    1832        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
    1833        .dwattr $C$DW$147, DW_AT_name("rsvd1")
    1834        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd1")
    1835        .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1836        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1838        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1839        .dwattr $C$DW$147, DW_AT_decl_line(0x4d)
    1840        .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    1841        .dwendtag $C$DW$T$38
    1842
    1843        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1844        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    1845        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1846$C$DW$T$138     .dwtag  DW_TAG_volatile_type
    1847        .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$38)
    1848
    1849$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1850        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1851$C$DW$148       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1852        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
    1853        .dwattr $C$DW$148, DW_AT_name("GLB_NEST_LEVEL")
    1854        .dwattr $C$DW$148, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    1855        .dwattr $C$DW$148, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    1856        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1858        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1859        .dwattr $C$DW$148, DW_AT_decl_line(0x5a)
    1860        .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    1861$C$DW$149       .dwtag  DW_TAG_member
    1862        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    1863        .dwattr $C$DW$149, DW_AT_name("rsvd9")
    1864        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd9")
    1865        .dwattr $C$DW$149, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    1866        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1868        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1869        .dwattr $C$DW$149, DW_AT_decl_line(0x5b)
    1870        .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    1871$C$DW$150       .dwtag  DW_TAG_member
    1872        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
    1873        .dwattr $C$DW$150, DW_AT_name("AUTO_OVERRIDE")
    1874        .dwattr $C$DW$150, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    1875        .dwattr $C$DW$150, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1876        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1878        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1879        .dwattr $C$DW$150, DW_AT_decl_line(0x5c)
    1880        .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
    1881        .dwendtag $C$DW$T$39
    1882
    1883        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1884        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    1885        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1886$C$DW$T$140     .dwtag  DW_TAG_volatile_type
    1887        .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$39)
    1888
    1889$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1890        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1891$C$DW$151       .dwtag  DW_TAG_member
    1892        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    1893        .dwattr $C$DW$151, DW_AT_name("STS_SET_IDX")
    1894        .dwattr $C$DW$151, DW_AT_TI_symbol_name("STS_SET_IDX")
    1895        .dwattr $C$DW$151, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1896        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1898        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1899        .dwattr $C$DW$151, DW_AT_decl_line(0x66)
    1900        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    1901$C$DW$152       .dwtag  DW_TAG_member
    1902        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    1903        .dwattr $C$DW$152, DW_AT_name("rsvd10")
    1904        .dwattr $C$DW$152, DW_AT_TI_symbol_name("rsvd10")
    1905        .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1906        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Fri Apr 13 06:28:55 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1907        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1908        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1909        .dwattr $C$DW$152, DW_AT_decl_line(0x67)
    1910        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    1911        .dwendtag $C$DW$T$40
    1912
    1913        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1914        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    1915        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1916$C$DW$T$142     .dwtag  DW_TAG_volatile_type
    1917        .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$40)
    1918
    1919$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1920        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1921$C$DW$153       .dwtag  DW_TAG_member
    1922        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    1923        .dwattr $C$DW$153, DW_AT_name("STS_CLR_IDX")
    1924        .dwattr $C$DW$153, DW_AT_TI_symbol_name("STS_CLR_IDX")
    1925        .dwattr $C$DW$153, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1926        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1928        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1929        .dwattr $C$DW$153, DW_AT_decl_line(0x71)
    1930        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    1931$C$DW$154       .dwtag  DW_TAG_member
    1932        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    1933        .dwattr $C$DW$154, DW_AT_name("rsvd10")
    1934        .dwattr $C$DW$154, DW_AT_TI_symbol_name("rsvd10")
    1935        .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1936        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1938        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1939        .dwattr $C$DW$154, DW_AT_decl_line(0x72)
    1940        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    1941        .dwendtag $C$DW$T$41
    1942
    1943        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1944        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    1945        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1946$C$DW$T$144     .dwtag  DW_TAG_volatile_type
    1947        .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$41)
    1948
    1949$C$DW$T$42      .dwtag  DW_TAG_structure_type
