PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sat Apr 14 23:23:22 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_detector")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_IEP
      15
      16$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("pru_rpmsg_init")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("pru_rpmsg_init")
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$389)
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external

    1229 00000204 0000006973000E          QBNE      ||$C$L28||, r0.b0, 0x73 ; [ALU_PRU] |277| 
    1230;* --------------------------------------------------------------------------*
    1231 00000208 000000F1000800          LBBO      &r0.b0, r8, 0, 1      ; [ALU_PRU] |277| $O$K50
    1232 0000020c 0000006974000C          QBNE      ||$C$L28||, r0.b0, 0x74 ; [ALU_PRU] |277| 
    1233;* --------------------------------------------------------------------------*
    1234 00000210 000000F1020500          LBBO      &r0.b0, r5, 2, 1      ; [ALU_PRU] |277| $O$K37
    1235 00000214 000000696F000A          QBNE      ||$C$L28||, r0.b0, 0x6f ; [ALU_PRU] |277| 
    1236;* --------------------------------------------------------------------------*
    1237 00000218 000000F1030500          LBBO      &r0.b0, r5, 3, 1      ; [ALU_PRU] |277| $O$K37
    1238 0000021c 0000005770009F          QBEQ      ||$C$L15||, r0.b0, 0x70 ; [ALU_PRU] |277| 
    1239;* --------------------------------------------------------------------------*
    1240 00000220 00000021000000!         JMP       ||$C$L28||            ; [ALU_PRU] |277| 
    1241;* --------------------------------------------------------------------------*
    1242 00000224                 ||$C$L27||:    
    1243        .dwpsn  file "main1.c",line 280,column 6,is_stmt,isa 0
    1244;----------------------------------------------------------------------
    1245; 280 | CT_INTC.SICR_bit.STS_CLR_IDX = FROM_ARM_HOST;                          
    1246; 286 | while( CT_IEP.TMR_CNT < SAMPLE_PERIOD);                                
    1247;----------------------------------------------------------------------
    1248 00000224 FC008024FFFFC0          LDI32     r0, 0xfffffc00        ; [ALU_PRU] |280| 
    1249 0000022c 000000F1002681          LBBO      &r1, r6, 0, 4         ; [ALU_PRU] |280| $O$K4
    1250 00000230 00000010E0E1E0          AND       r0, r1, r0            ; [ALU_PRU] |280| 
    1251 00000234 0000001313E0E0          OR        r0, r0, 0x13          ; [ALU_PRU] |280| 
    1252 00000238 000000E1002680          SBBO      &r0, r6, 0, 4         ; [ALU_PRU] |280| $O$K4
    1253;* --------------------------------------------------------------------------*
    1254;*   BEGIN LOOP ||$C$L28||
    1255;*
    1256;*   Loop source line                : 286
    1257;*   Loop closing brace source line  : 286
    1258;*   Known Minimum Trip Count        : 1
    1259;*   Known Maximum Trip Count        : 4294967295
    1260;*   Known Max Trip Count Factor     : 1
    1261;* --------------------------------------------------------------------------*
    1262 0000023c                 ||$C$L28||:    
    1263        .dwpsn  file "main1.c",line 225,column 9,is_stmt,isa 0
    1264 0000023c 0000002407D0E0          LDI       r0, 0x07d0            ; [ALU_PRU] |225| 
    1265 00000240 000000F10C2B81          LBBO      &r1, r11, 12, 4       ; [ALU_PRU] |225| $O$K135
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   24

    1266 00000244 00000076E1E0B3          QBGE      ||$C$L19||, r0, r1    ; [ALU_PRU] |225| 
    1267;* --------------------------------------------------------------------------*
    1268 00000248 00000021000000!         JMP       ||$C$L28||            ; [ALU_PRU] |225| 
    1269;* --------------------------------------------------------------------------*
    1270        .dwattr $C$DW$44, DW_AT_TI_end_file("main1.c")
    1271        .dwattr $C$DW$44, DW_AT_TI_end_line(0x121)
    1272        .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
    1273        .dwendentry
    1274        .dwendtag $C$DW$44
    1275
    1276;******************************************************************************
    1277;* STRINGS                                                                    *
    1278;******************************************************************************
    1279 00000000                         .sect   ".rodata:.string"
    1280 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
    1281 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000031 
         00000014 00000000000000 
    1282;*****************************************************************************
    1283;* UNDEFINED EXTERNAL REFERENCES                                             *
    1284;*****************************************************************************
    1285        .global ||pru_rpmsg_init||
    1286        .global ||pru_rpmsg_receive||
    1287        .global ||pru_rpmsg_send||
    1288        .global ||pru_rpmsg_channel||
    1289
    1290;******************************************************************************
    1291;* TYPE INFORMATION                                                           *
    1292;******************************************************************************
    1293
    1294$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1295        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1296$C$DW$58        .dwtag  DW_TAG_member
    1297        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1298        .dwattr $C$DW$58, DW_AT_name("REVID")
    1299        .dwattr $C$DW$58, DW_AT_TI_symbol_name("REVID")
    1300        .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1301        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   25

    1302        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1303        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1304        .dwattr $C$DW$58, DW_AT_decl_line(0x2d)
    1305        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1306        .dwendtag $C$DW$T$19
    1307
    1308        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1309        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1310        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1311$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1312        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    1313
    1314$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1315        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1316$C$DW$59        .dwtag  DW_TAG_member
    1317        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1318        .dwattr $C$DW$59, DW_AT_name("IDLE_MODE")
    1319        .dwattr $C$DW$59, DW_AT_TI_symbol_name("IDLE_MODE")
    1320        .dwattr $C$DW$59, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1321        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1323        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1324        .dwattr $C$DW$59, DW_AT_decl_line(0x37)
    1325        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1326$C$DW$60        .dwtag  DW_TAG_member
    1327        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1328        .dwattr $C$DW$60, DW_AT_name("STANDBY_MODE")
    1329        .dwattr $C$DW$60, DW_AT_TI_symbol_name("STANDBY_MODE")
    1330        .dwattr $C$DW$60, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1331        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1333        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1334        .dwattr $C$DW$60, DW_AT_decl_line(0x38)
    1335        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1336$C$DW$61        .dwtag  DW_TAG_member
    1337        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1338        .dwattr $C$DW$61, DW_AT_name("STANDBY_INIT")
    1339        .dwattr $C$DW$61, DW_AT_TI_symbol_name("STANDBY_INIT")
    1340        .dwattr $C$DW$61, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1341        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1343        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1344        .dwattr $C$DW$61, DW_AT_decl_line(0x39)
    1345        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1346$C$DW$62        .dwtag  DW_TAG_member
    1347        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1348        .dwattr $C$DW$62, DW_AT_name("SUB_MWAIT")
    1349        .dwattr $C$DW$62, DW_AT_TI_symbol_name("SUB_MWAIT")
    1350        .dwattr $C$DW$62, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1351        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1353        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1354        .dwattr $C$DW$62, DW_AT_decl_line(0x3a)
    1355        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1356$C$DW$63        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   26

    1357        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1358        .dwattr $C$DW$63, DW_AT_name("rsvd6")
    1359        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd6")
    1360        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1361        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1363        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1364        .dwattr $C$DW$63, DW_AT_decl_line(0x3b)
    1365        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1366        .dwendtag $C$DW$T$20
    1367
    1368        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1369        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1370        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1371$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1372        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$20)
    1373
    1374$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1375        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1376$C$DW$64        .dwtag  DW_TAG_member
    1377        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1378        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_MODE")
    1379        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1380        .dwattr $C$DW$64, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1381        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1383        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1384        .dwattr $C$DW$64, DW_AT_decl_line(0x45)
    1385        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1386$C$DW$65        .dwtag  DW_TAG_member
    1387        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1388        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_CLK_MODE")
    1389        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1390        .dwattr $C$DW$65, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1391        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1393        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1394        .dwattr $C$DW$65, DW_AT_decl_line(0x46)
    1395        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1396$C$DW$66        .dwtag  DW_TAG_member
    1397        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1398        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_DIV0")
    1399        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1400        .dwattr $C$DW$66, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1401        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1403        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1404        .dwattr $C$DW$66, DW_AT_decl_line(0x47)
    1405        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1406$C$DW$67        .dwtag  DW_TAG_member
    1407        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1408        .dwattr $C$DW$67, DW_AT_name("PRU0_GPI_DIV1")
    1409        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1410        .dwattr $C$DW$67, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1411        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   27

    1412        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1413        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1414        .dwattr $C$DW$67, DW_AT_decl_line(0x48)
    1415        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1416$C$DW$68        .dwtag  DW_TAG_member
    1417        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1418        .dwattr $C$DW$68, DW_AT_name("PRU0_GPI_SB")
    1419        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1420        .dwattr $C$DW$68, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1421        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1423        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1424        .dwattr $C$DW$68, DW_AT_decl_line(0x49)
    1425        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1426$C$DW$69        .dwtag  DW_TAG_member
    1427        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1428        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_MODE")
    1429        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1430        .dwattr $C$DW$69, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1431        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1433        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1434        .dwattr $C$DW$69, DW_AT_decl_line(0x4a)
    1435        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1436$C$DW$70        .dwtag  DW_TAG_member
    1437        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1438        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_DIV0")
    1439        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1440        .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1441        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1443        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1444        .dwattr $C$DW$70, DW_AT_decl_line(0x4b)
    1445        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1446$C$DW$71        .dwtag  DW_TAG_member
    1447        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1448        .dwattr $C$DW$71, DW_AT_name("PRU0_GPO_DIV1")
    1449        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1450        .dwattr $C$DW$71, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1451        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1453        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1454        .dwattr $C$DW$71, DW_AT_decl_line(0x4c)
    1455        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1456$C$DW$72        .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1458        .dwattr $C$DW$72, DW_AT_name("PRU0_GPO_SH_SEL")
    1459        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1460        .dwattr $C$DW$72, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1461        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1463        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1464        .dwattr $C$DW$72, DW_AT_decl_line(0x4d)
    1465        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1466$C$DW$73        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   28

    1467        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1468        .dwattr $C$DW$73, DW_AT_name("rsvd26")
    1469        .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd26")
    1470        .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1471        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1473        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1474        .dwattr $C$DW$73, DW_AT_decl_line(0x4e)
    1475        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1476        .dwendtag $C$DW$T$21
    1477
    1478        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1479        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1480        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1481$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1482        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    1483
    1484$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1485        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1486$C$DW$74        .dwtag  DW_TAG_member
    1487        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1488        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_MODE")
    1489        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1490        .dwattr $C$DW$74, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1491        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1493        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1494        .dwattr $C$DW$74, DW_AT_decl_line(0x58)
    1495        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1496$C$DW$75        .dwtag  DW_TAG_member
    1497        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1498        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_CLK_MODE")
    1499        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1500        .dwattr $C$DW$75, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1501        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1503        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1504        .dwattr $C$DW$75, DW_AT_decl_line(0x59)
    1505        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1506$C$DW$76        .dwtag  DW_TAG_member
    1507        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1508        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_DIV0")
    1509        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1510        .dwattr $C$DW$76, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1511        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1513        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1514        .dwattr $C$DW$76, DW_AT_decl_line(0x5a)
    1515        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1516$C$DW$77        .dwtag  DW_TAG_member
    1517        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1518        .dwattr $C$DW$77, DW_AT_name("PRU1_GPI_DIV1")
    1519        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1520        .dwattr $C$DW$77, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1521        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   29

    1522        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1523        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1524        .dwattr $C$DW$77, DW_AT_decl_line(0x5b)
    1525        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1526$C$DW$78        .dwtag  DW_TAG_member
    1527        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1528        .dwattr $C$DW$78, DW_AT_name("PRU1_GPI_SB")
    1529        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1530        .dwattr $C$DW$78, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1531        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1533        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1534        .dwattr $C$DW$78, DW_AT_decl_line(0x5c)
    1535        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1536$C$DW$79        .dwtag  DW_TAG_member
    1537        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1538        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_MODE")
    1539        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1540        .dwattr $C$DW$79, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1541        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1543        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1544        .dwattr $C$DW$79, DW_AT_decl_line(0x5d)
    1545        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1546$C$DW$80        .dwtag  DW_TAG_member
    1547        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1548        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_DIV0")
    1549        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1550        .dwattr $C$DW$80, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1551        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1553        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1554        .dwattr $C$DW$80, DW_AT_decl_line(0x5e)
    1555        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1556$C$DW$81        .dwtag  DW_TAG_member
    1557        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1558        .dwattr $C$DW$81, DW_AT_name("PRU1_GPO_DIV1")
    1559        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1560        .dwattr $C$DW$81, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1561        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1563        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1564        .dwattr $C$DW$81, DW_AT_decl_line(0x5f)
    1565        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1566$C$DW$82        .dwtag  DW_TAG_member
    1567        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1568        .dwattr $C$DW$82, DW_AT_name("PRU1_GPO_SH_SEL")
    1569        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1570        .dwattr $C$DW$82, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1571        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1573        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1574        .dwattr $C$DW$82, DW_AT_decl_line(0x60)
    1575        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1576$C$DW$83        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   30

    1577        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1578        .dwattr $C$DW$83, DW_AT_name("rsvd26")
    1579        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd26")
    1580        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1581        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1584        .dwattr $C$DW$83, DW_AT_decl_line(0x61)
    1585        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1586        .dwendtag $C$DW$T$22
    1587
    1588        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1589        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1590        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1591$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1592        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$22)
    1593
    1594$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1595        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1596$C$DW$84        .dwtag  DW_TAG_member
    1597        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1598        .dwattr $C$DW$84, DW_AT_name("PRU0_CLK_STOP_REQ")
    1599        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1600        .dwattr $C$DW$84, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1601        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1603        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1604        .dwattr $C$DW$84, DW_AT_decl_line(0x6b)
    1605        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1606$C$DW$85        .dwtag  DW_TAG_member
    1607        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1608        .dwattr $C$DW$85, DW_AT_name("PRU0_CLK_STOP_ACK")
    1609        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1610        .dwattr $C$DW$85, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1611        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1613        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1614        .dwattr $C$DW$85, DW_AT_decl_line(0x6c)
    1615        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1616$C$DW$86        .dwtag  DW_TAG_member
    1617        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1618        .dwattr $C$DW$86, DW_AT_name("PRU0_CLK_EN")
    1619        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1620        .dwattr $C$DW$86, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1621        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1623        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1624        .dwattr $C$DW$86, DW_AT_decl_line(0x6d)
    1625        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1626$C$DW$87        .dwtag  DW_TAG_member
    1627        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1628        .dwattr $C$DW$87, DW_AT_name("PRU1_CLK_STOP_REQ")
    1629        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1630        .dwattr $C$DW$87, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1631        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   31

    1632        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1633        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1634        .dwattr $C$DW$87, DW_AT_decl_line(0x6e)
    1635        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1636$C$DW$88        .dwtag  DW_TAG_member
    1637        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1638        .dwattr $C$DW$88, DW_AT_name("PRU1_CLK_STOP_ACK")
    1639        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1640        .dwattr $C$DW$88, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1641        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1643        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1644        .dwattr $C$DW$88, DW_AT_decl_line(0x6f)
    1645        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1646$C$DW$89        .dwtag  DW_TAG_member
    1647        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1648        .dwattr $C$DW$89, DW_AT_name("PRU1_CLK_EN")
    1649        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1650        .dwattr $C$DW$89, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1651        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1653        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1654        .dwattr $C$DW$89, DW_AT_decl_line(0x70)
    1655        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1656$C$DW$90        .dwtag  DW_TAG_member
    1657        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1658        .dwattr $C$DW$90, DW_AT_name("INTC_CLK_STOP_REQ")
    1659        .dwattr $C$DW$90, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1660        .dwattr $C$DW$90, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1661        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1663        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1664        .dwattr $C$DW$90, DW_AT_decl_line(0x71)
    1665        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1666$C$DW$91        .dwtag  DW_TAG_member
    1667        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1668        .dwattr $C$DW$91, DW_AT_name("INTC_CLK_STOP_ACK")
    1669        .dwattr $C$DW$91, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1670        .dwattr $C$DW$91, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1671        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1673        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1674        .dwattr $C$DW$91, DW_AT_decl_line(0x72)
    1675        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1676$C$DW$92        .dwtag  DW_TAG_member
    1677        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1678        .dwattr $C$DW$92, DW_AT_name("INTC_CLK_EN")
    1679        .dwattr $C$DW$92, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1680        .dwattr $C$DW$92, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1681        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1683        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1684        .dwattr $C$DW$92, DW_AT_decl_line(0x73)
    1685        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1686$C$DW$93        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   32

    1687        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1688        .dwattr $C$DW$93, DW_AT_name("UART_CLK_STOP_REQ")
    1689        .dwattr $C$DW$93, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1690        .dwattr $C$DW$93, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1691        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1693        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1694        .dwattr $C$DW$93, DW_AT_decl_line(0x74)
    1695        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1696$C$DW$94        .dwtag  DW_TAG_member
    1697        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1698        .dwattr $C$DW$94, DW_AT_name("UART_CLK_STOP_ACK")
    1699        .dwattr $C$DW$94, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1700        .dwattr $C$DW$94, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1701        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1703        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1704        .dwattr $C$DW$94, DW_AT_decl_line(0x75)
    1705        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1706$C$DW$95        .dwtag  DW_TAG_member
    1707        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1708        .dwattr $C$DW$95, DW_AT_name("UART_CLK_EN")
    1709        .dwattr $C$DW$95, DW_AT_TI_symbol_name("UART_CLK_EN")
    1710        .dwattr $C$DW$95, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1711        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1713        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1714        .dwattr $C$DW$95, DW_AT_decl_line(0x76)
    1715        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1716$C$DW$96        .dwtag  DW_TAG_member
    1717        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1718        .dwattr $C$DW$96, DW_AT_name("ECAP_CLK_STOP_REQ")
    1719        .dwattr $C$DW$96, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1720        .dwattr $C$DW$96, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1721        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1723        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1724        .dwattr $C$DW$96, DW_AT_decl_line(0x77)
    1725        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1726$C$DW$97        .dwtag  DW_TAG_member
    1727        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1728        .dwattr $C$DW$97, DW_AT_name("ECAP_CLK_STOP_ACK")
    1729        .dwattr $C$DW$97, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1730        .dwattr $C$DW$97, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1731        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1733        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1734        .dwattr $C$DW$97, DW_AT_decl_line(0x78)
    1735        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1736$C$DW$98        .dwtag  DW_TAG_member
    1737        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1738        .dwattr $C$DW$98, DW_AT_name("ECAP_CLK_EN")
    1739        .dwattr $C$DW$98, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1740        .dwattr $C$DW$98, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1741        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   33

    1742        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1743        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1744        .dwattr $C$DW$98, DW_AT_decl_line(0x79)
    1745        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1746$C$DW$99        .dwtag  DW_TAG_member
    1747        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1748        .dwattr $C$DW$99, DW_AT_name("IEP_CLK_STOP_REQ")
    1749        .dwattr $C$DW$99, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1750        .dwattr $C$DW$99, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1751        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1753        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1754        .dwattr $C$DW$99, DW_AT_decl_line(0x7a)
    1755        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1756$C$DW$100       .dwtag  DW_TAG_member
    1757        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1758        .dwattr $C$DW$100, DW_AT_name("IEP_CLK_STOP_ACK")
    1759        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1760        .dwattr $C$DW$100, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1761        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1763        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1764        .dwattr $C$DW$100, DW_AT_decl_line(0x7b)
    1765        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1766$C$DW$101       .dwtag  DW_TAG_member
    1767        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1768        .dwattr $C$DW$101, DW_AT_name("IEP_CLK_EN")
    1769        .dwattr $C$DW$101, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1770        .dwattr $C$DW$101, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1771        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1773        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1774        .dwattr $C$DW$101, DW_AT_decl_line(0x7c)
    1775        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1776$C$DW$102       .dwtag  DW_TAG_member
    1777        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1778        .dwattr $C$DW$102, DW_AT_name("rsvd18")
    1779        .dwattr $C$DW$102, DW_AT_TI_symbol_name("rsvd18")
    1780        .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1781        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1783        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1784        .dwattr $C$DW$102, DW_AT_decl_line(0x7d)
    1785        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1786        .dwendtag $C$DW$T$23
    1787
    1788        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1789        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1790        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1791$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1792        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$23)
    1793
    1794$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1795        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1796$C$DW$103       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   34

    1797        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1798        .dwattr $C$DW$103, DW_AT_name("PRU0_IMEM_PE_RAW")
    1799        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1800        .dwattr $C$DW$103, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1801        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1803        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1804        .dwattr $C$DW$103, DW_AT_decl_line(0x87)
    1805        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1806$C$DW$104       .dwtag  DW_TAG_member
    1807        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1808        .dwattr $C$DW$104, DW_AT_name("PRU0_DMEM_PE_RAW")
    1809        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1810        .dwattr $C$DW$104, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1811        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1813        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1814        .dwattr $C$DW$104, DW_AT_decl_line(0x88)
    1815        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1816$C$DW$105       .dwtag  DW_TAG_member
    1817        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1818        .dwattr $C$DW$105, DW_AT_name("PRU1_IMEM_PE_RAW")
    1819        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1820        .dwattr $C$DW$105, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1821        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1823        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1824        .dwattr $C$DW$105, DW_AT_decl_line(0x89)
    1825        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1826$C$DW$106       .dwtag  DW_TAG_member
    1827        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1828        .dwattr $C$DW$106, DW_AT_name("PRU1_DMEM_PE_RAW")
    1829        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1830        .dwattr $C$DW$106, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1831        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1833        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1834        .dwattr $C$DW$106, DW_AT_decl_line(0x8a)
    1835        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1836$C$DW$107       .dwtag  DW_TAG_member
    1837        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1838        .dwattr $C$DW$107, DW_AT_name("RAM_PE_RAW")
    1839        .dwattr $C$DW$107, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1840        .dwattr $C$DW$107, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1841        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1843        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1844        .dwattr $C$DW$107, DW_AT_decl_line(0x8b)
    1845        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1846$C$DW$108       .dwtag  DW_TAG_member
    1847        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1848        .dwattr $C$DW$108, DW_AT_name("rsvd20")
    1849        .dwattr $C$DW$108, DW_AT_TI_symbol_name("rsvd20")
    1850        .dwattr $C$DW$108, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1851        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   35

    1852        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1853        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1854        .dwattr $C$DW$108, DW_AT_decl_line(0x8c)
    1855        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1856        .dwendtag $C$DW$T$24
    1857
    1858        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1859        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1860        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1861$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    1862        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$24)
    1863
    1864$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1865        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1866$C$DW$109       .dwtag  DW_TAG_member
    1867        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1868        .dwattr $C$DW$109, DW_AT_name("PRU0_IMEM_PE")
    1869        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1870        .dwattr $C$DW$109, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1871        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1872        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1873        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1874        .dwattr $C$DW$109, DW_AT_decl_line(0x96)
    1875        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1876$C$DW$110       .dwtag  DW_TAG_member
    1877        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1878        .dwattr $C$DW$110, DW_AT_name("PRU0_DMEM_PE")
    1879        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1880        .dwattr $C$DW$110, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1881        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1882        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1883        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1884        .dwattr $C$DW$110, DW_AT_decl_line(0x97)
    1885        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1886$C$DW$111       .dwtag  DW_TAG_member
    1887        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1888        .dwattr $C$DW$111, DW_AT_name("PRU1_IMEM_PE")
    1889        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1890        .dwattr $C$DW$111, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1891        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1893        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1894        .dwattr $C$DW$111, DW_AT_decl_line(0x98)
    1895        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1896$C$DW$112       .dwtag  DW_TAG_member
    1897        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1898        .dwattr $C$DW$112, DW_AT_name("PRU1_DMEM_PE")
    1899        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1900        .dwattr $C$DW$112, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1901        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1903        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1904        .dwattr $C$DW$112, DW_AT_decl_line(0x99)
    1905        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1906$C$DW$113       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   36

    1907        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1908        .dwattr $C$DW$113, DW_AT_name("RAM_PE")
    1909        .dwattr $C$DW$113, DW_AT_TI_symbol_name("RAM_PE")
    1910        .dwattr $C$DW$113, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1911        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1913        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1914        .dwattr $C$DW$113, DW_AT_decl_line(0x9a)
    1915        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1916$C$DW$114       .dwtag  DW_TAG_member
    1917        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1918        .dwattr $C$DW$114, DW_AT_name("rsvd20")
    1919        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd20")
    1920        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1921        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1923        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1924        .dwattr $C$DW$114, DW_AT_decl_line(0x9b)
    1925        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1926        .dwendtag $C$DW$T$25
    1927
    1928        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1929        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1930        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1931$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    1932        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$25)
    1933
    1934$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1935        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1936$C$DW$115       .dwtag  DW_TAG_member
    1937        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1938        .dwattr $C$DW$115, DW_AT_name("PRU0_IMEM_PE_SET")
    1939        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1940        .dwattr $C$DW$115, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1941        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1943        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1944        .dwattr $C$DW$115, DW_AT_decl_line(0xa4)
    1945        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1946$C$DW$116       .dwtag  DW_TAG_member
    1947        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1948        .dwattr $C$DW$116, DW_AT_name("PRU0_DMEM_PE_SET")
    1949        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1950        .dwattr $C$DW$116, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1951        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1953        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1954        .dwattr $C$DW$116, DW_AT_decl_line(0xa5)
    1955        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1956$C$DW$117       .dwtag  DW_TAG_member
    1957        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1958        .dwattr $C$DW$117, DW_AT_name("PRU1_IMEM_PE_SET")
    1959        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1960        .dwattr $C$DW$117, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1961        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   37

    1962        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1963        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1964        .dwattr $C$DW$117, DW_AT_decl_line(0xa6)
    1965        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1966$C$DW$118       .dwtag  DW_TAG_member
    1967        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1968        .dwattr $C$DW$118, DW_AT_name("PRU1_DMEM_PE_SET")
    1969        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1970        .dwattr $C$DW$118, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1971        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1973        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1974        .dwattr $C$DW$118, DW_AT_decl_line(0xa7)
    1975        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1976$C$DW$119       .dwtag  DW_TAG_member
    1977        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1978        .dwattr $C$DW$119, DW_AT_name("RAM_PE_SET")
    1979        .dwattr $C$DW$119, DW_AT_TI_symbol_name("RAM_PE_SET")
    1980        .dwattr $C$DW$119, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1981        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1983        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1984        .dwattr $C$DW$119, DW_AT_decl_line(0xa8)
    1985        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1986$C$DW$120       .dwtag  DW_TAG_member
    1987        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1988        .dwattr $C$DW$120, DW_AT_name("rsvd20")
    1989        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd20")
    1990        .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1991        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1993        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1994        .dwattr $C$DW$120, DW_AT_decl_line(0xa9)
    1995        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1996        .dwendtag $C$DW$T$26
    1997
    1998        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1999        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2000        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2001$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    2002        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$26)
    2003
    2004$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2005        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2006$C$DW$121       .dwtag  DW_TAG_member
    2007        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2008        .dwattr $C$DW$121, DW_AT_name("PRU0_IMEM_PE_CLR")
    2009        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2010        .dwattr $C$DW$121, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2011        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2013        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2014        .dwattr $C$DW$121, DW_AT_decl_line(0xb3)
    2015        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2016$C$DW$122       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   38

    2017        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2018        .dwattr $C$DW$122, DW_AT_name("PRU0_DMEM_PE_CLR")
    2019        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2020        .dwattr $C$DW$122, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2021        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2023        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2024        .dwattr $C$DW$122, DW_AT_decl_line(0xb4)
    2025        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2026$C$DW$123       .dwtag  DW_TAG_member
    2027        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2028        .dwattr $C$DW$123, DW_AT_name("PRU1_IMEM_PE_CLR")
    2029        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2030        .dwattr $C$DW$123, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2031        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2033        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2034        .dwattr $C$DW$123, DW_AT_decl_line(0xb5)
    2035        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2036$C$DW$124       .dwtag  DW_TAG_member
    2037        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2038        .dwattr $C$DW$124, DW_AT_name("PRU1_DMEM_PE_CLR")
    2039        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2040        .dwattr $C$DW$124, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2041        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2043        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2044        .dwattr $C$DW$124, DW_AT_decl_line(0xb6)
    2045        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2046$C$DW$125       .dwtag  DW_TAG_member
    2047        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2048        .dwattr $C$DW$125, DW_AT_name("rsvd16")
    2049        .dwattr $C$DW$125, DW_AT_TI_symbol_name("rsvd16")
    2050        .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2051        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2053        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2054        .dwattr $C$DW$125, DW_AT_decl_line(0xb7)
    2055        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2056        .dwendtag $C$DW$T$27
    2057
    2058        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2059        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2060        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2061$C$DW$T$147     .dwtag  DW_TAG_volatile_type
    2062        .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$27)
    2063
    2064$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2065        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2066$C$DW$126       .dwtag  DW_TAG_member
    2067        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2068        .dwattr $C$DW$126, DW_AT_name("PMAO_PRU0")
    2069        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PMAO_PRU0")
    2070        .dwattr $C$DW$126, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2071        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   39

    2072        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2073        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2074        .dwattr $C$DW$126, DW_AT_decl_line(0xc4)
    2075        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2076$C$DW$127       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2078        .dwattr $C$DW$127, DW_AT_name("PMAO_PRU1")
    2079        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PMAO_PRU1")
    2080        .dwattr $C$DW$127, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2081        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2083        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2084        .dwattr $C$DW$127, DW_AT_decl_line(0xc5)
    2085        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2086$C$DW$128       .dwtag  DW_TAG_member
    2087        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2088        .dwattr $C$DW$128, DW_AT_name("rsvd2")
    2089        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd2")
    2090        .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2091        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2092        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2093        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2094        .dwattr $C$DW$128, DW_AT_decl_line(0xc6)
    2095        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2096        .dwendtag $C$DW$T$28
    2097
    2098        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2099        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2100        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2101$C$DW$T$149     .dwtag  DW_TAG_volatile_type
    2102        .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$28)
    2103
    2104$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2105        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2106$C$DW$129       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2108        .dwattr $C$DW$129, DW_AT_name("OCP_EN")
    2109        .dwattr $C$DW$129, DW_AT_TI_symbol_name("OCP_EN")
    2110        .dwattr $C$DW$129, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2111        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2113        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2114        .dwattr $C$DW$129, DW_AT_decl_line(0xd3)
    2115        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2116$C$DW$130       .dwtag  DW_TAG_member
    2117        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2118        .dwattr $C$DW$130, DW_AT_name("rsvd1")
    2119        .dwattr $C$DW$130, DW_AT_TI_symbol_name("rsvd1")
    2120        .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2121        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2123        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2124        .dwattr $C$DW$130, DW_AT_decl_line(0xd4)
    2125        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2126        .dwendtag $C$DW$T$29
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   40

    2127
    2128        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2129        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2130        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2131$C$DW$T$151     .dwtag  DW_TAG_volatile_type
    2132        .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$29)
    2133
    2134$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2135        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2136$C$DW$131       .dwtag  DW_TAG_member
    2137        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2138        .dwattr $C$DW$131, DW_AT_name("PRU1_PAD_HP_EN")
    2139        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2140        .dwattr $C$DW$131, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2141        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2143        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2144        .dwattr $C$DW$131, DW_AT_decl_line(0xde)
    2145        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2146$C$DW$132       .dwtag  DW_TAG_member
    2147        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2148        .dwattr $C$DW$132, DW_AT_name("XFR_SHIFT_EN")
    2149        .dwattr $C$DW$132, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2150        .dwattr $C$DW$132, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2151        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2152        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2153        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2154        .dwattr $C$DW$132, DW_AT_decl_line(0xdf)
    2155        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2156$C$DW$133       .dwtag  DW_TAG_member
    2157        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2158        .dwattr $C$DW$133, DW_AT_name("rsvd2")
    2159        .dwattr $C$DW$133, DW_AT_TI_symbol_name("rsvd2")
    2160        .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2161        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2163        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2164        .dwattr $C$DW$133, DW_AT_decl_line(0xe0)
    2165        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2166        .dwendtag $C$DW$T$30
    2167
    2168        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2169        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2170        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2171$C$DW$T$153     .dwtag  DW_TAG_volatile_type
    2172        .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$30)
    2173
    2174$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2175        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2176$C$DW$134       .dwtag  DW_TAG_member
    2177        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2178        .dwattr $C$DW$134, DW_AT_name("PIN_MUX_SEL")
    2179        .dwattr $C$DW$134, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2180        .dwattr $C$DW$134, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    2181        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   41

    2182        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2183        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2184        .dwattr $C$DW$134, DW_AT_decl_line(0xec)
    2185        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2186$C$DW$135       .dwtag  DW_TAG_member
    2187        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2188        .dwattr $C$DW$135, DW_AT_name("rsvd2")
    2189        .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd2")
    2190        .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    2191        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2193        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2194        .dwattr $C$DW$135, DW_AT_decl_line(0xed)
    2195        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2196        .dwendtag $C$DW$T$31
    2197
    2198        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2199        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2200        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2201$C$DW$T$155     .dwtag  DW_TAG_volatile_type
    2202        .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$31)
    2203
    2204$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2205        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2206$C$DW$136       .dwtag  DW_TAG_member
    2207        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$132)
    2208        .dwattr $C$DW$136, DW_AT_name("$P$T0")
    2209        .dwattr $C$DW$136, DW_AT_TI_symbol_name("$P$T0")
    2210        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2211        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2212        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2213        .dwattr $C$DW$136, DW_AT_decl_line(0x29)
    2214        .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    2215$C$DW$137       .dwtag  DW_TAG_member
    2216        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$134)
    2217        .dwattr $C$DW$137, DW_AT_name("$P$T1")
    2218        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T1")
    2219        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2220        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2221        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2222        .dwattr $C$DW$137, DW_AT_decl_line(0x33)
    2223        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2224$C$DW$138       .dwtag  DW_TAG_member
    2225        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$136)
    2226        .dwattr $C$DW$138, DW_AT_name("$P$T2")
    2227        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T2")
    2228        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2229        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2230        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2231        .dwattr $C$DW$138, DW_AT_decl_line(0x41)
    2232        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    2233$C$DW$139       .dwtag  DW_TAG_member
    2234        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$138)
    2235        .dwattr $C$DW$139, DW_AT_name("$P$T3")
    2236        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T3")
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   42

    2237        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2238        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2239        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2240        .dwattr $C$DW$139, DW_AT_decl_line(0x54)
    2241        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2242$C$DW$140       .dwtag  DW_TAG_member
    2243        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$140)
    2244        .dwattr $C$DW$140, DW_AT_name("$P$T4")
    2245        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T4")
    2246        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2247        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2248        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2249        .dwattr $C$DW$140, DW_AT_decl_line(0x67)
    2250        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2251$C$DW$141       .dwtag  DW_TAG_member
    2252        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$142)
    2253        .dwattr $C$DW$141, DW_AT_name("$P$T5")
    2254        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T5")
    2255        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2256        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2257        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2258        .dwattr $C$DW$141, DW_AT_decl_line(0x83)
    2259        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2260$C$DW$142       .dwtag  DW_TAG_member
    2261        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$144)
    2262        .dwattr $C$DW$142, DW_AT_name("$P$T6")
    2263        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T6")
    2264        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2265        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2266        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2267        .dwattr $C$DW$142, DW_AT_decl_line(0x92)
    2268        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2269$C$DW$143       .dwtag  DW_TAG_member
    2270        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$146)
    2271        .dwattr $C$DW$143, DW_AT_name("$P$T7")
    2272        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T7")
    2273        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2274        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2275        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2276        .dwattr $C$DW$143, DW_AT_decl_line(0xa0)
    2277        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2278$C$DW$144       .dwtag  DW_TAG_member
    2279        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$148)
    2280        .dwattr $C$DW$144, DW_AT_name("$P$T8")
    2281        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T8")
    2282        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2283        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2284        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2285        .dwattr $C$DW$144, DW_AT_decl_line(0xaf)
    2286        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2287$C$DW$145       .dwtag  DW_TAG_member
    2288        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    2289        .dwattr $C$DW$145, DW_AT_name("rsvd24")
    2290        .dwattr $C$DW$145, DW_AT_TI_symbol_name("rsvd24")
    2291        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   43

    2292        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2293        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2294        .dwattr $C$DW$145, DW_AT_decl_line(0xbc)
    2295        .dwattr $C$DW$145, DW_AT_decl_column(0x0b)
    2296$C$DW$146       .dwtag  DW_TAG_member
    2297        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$150)
    2298        .dwattr $C$DW$146, DW_AT_name("$P$T9")
    2299        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T9")
    2300        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2301        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2302        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2303        .dwattr $C$DW$146, DW_AT_decl_line(0xc0)
    2304        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2305$C$DW$147       .dwtag  DW_TAG_member
    2306        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$33)
    2307        .dwattr $C$DW$147, DW_AT_name("rsvd2c")
    2308        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd2c")
    2309        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2310        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2311        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2312        .dwattr $C$DW$147, DW_AT_decl_line(0xcb)
    2313        .dwattr $C$DW$147, DW_AT_decl_column(0x0b)
    2314$C$DW$148       .dwtag  DW_TAG_member
    2315        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$152)
    2316        .dwattr $C$DW$148, DW_AT_name("$P$T10")
    2317        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T10")
    2318        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2319        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2320        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2321        .dwattr $C$DW$148, DW_AT_decl_line(0xcf)
    2322        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2323$C$DW$149       .dwtag  DW_TAG_member
    2324        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$154)
    2325        .dwattr $C$DW$149, DW_AT_name("$P$T11")
    2326        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T11")
    2327        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2328        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2329        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2330        .dwattr $C$DW$149, DW_AT_decl_line(0xda)
    2331        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2332$C$DW$150       .dwtag  DW_TAG_member
    2333        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$34)
    2334        .dwattr $C$DW$150, DW_AT_name("rsvd38")
    2335        .dwattr $C$DW$150, DW_AT_TI_symbol_name("rsvd38")
    2336        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2337        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2338        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2339        .dwattr $C$DW$150, DW_AT_decl_line(0xe5)
    2340        .dwattr $C$DW$150, DW_AT_decl_column(0x0b)
    2341$C$DW$151       .dwtag  DW_TAG_member
    2342        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$156)
    2343        .dwattr $C$DW$151, DW_AT_name("$P$T12")
    2344        .dwattr $C$DW$151, DW_AT_TI_symbol_name("$P$T12")
    2345        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2346        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   44

    2347        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2348        .dwattr $C$DW$151, DW_AT_decl_line(0xe8)
    2349        .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2350        .dwendtag $C$DW$T$35
    2351
    2352        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2353        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2354        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2355$C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2356        .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$35)
    2357        .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    2358        .dwattr $C$DW$T$353, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2359        .dwattr $C$DW$T$353, DW_AT_decl_line(0xf0)
    2360        .dwattr $C$DW$T$353, DW_AT_decl_column(0x03)
    2361$C$DW$T$354     .dwtag  DW_TAG_volatile_type
    2362        .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
    2363
    2364$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2365        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2366$C$DW$152       .dwtag  DW_TAG_member
    2367        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2368        .dwattr $C$DW$152, DW_AT_name("REV_MINOR")
    2369        .dwattr $C$DW$152, DW_AT_TI_symbol_name("REV_MINOR")
    2370        .dwattr $C$DW$152, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2371        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2373        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2374        .dwattr $C$DW$152, DW_AT_decl_line(0x2d)
    2375        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2376$C$DW$153       .dwtag  DW_TAG_member
    2377        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2378        .dwattr $C$DW$153, DW_AT_name("REV_CUSTOM")
    2379        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_CUSTOM")
    2380        .dwattr $C$DW$153, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2381        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2382        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2383        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2384        .dwattr $C$DW$153, DW_AT_decl_line(0x2e)
    2385        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2386$C$DW$154       .dwtag  DW_TAG_member
    2387        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2388        .dwattr $C$DW$154, DW_AT_name("REV_MAJOR")
    2389        .dwattr $C$DW$154, DW_AT_TI_symbol_name("REV_MAJOR")
    2390        .dwattr $C$DW$154, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2391        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2392        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2393        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2394        .dwattr $C$DW$154, DW_AT_decl_line(0x2f)
    2395        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2396$C$DW$155       .dwtag  DW_TAG_member
    2397        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2398        .dwattr $C$DW$155, DW_AT_name("REV_RTL")
    2399        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_RTL")
    2400        .dwattr $C$DW$155, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2401        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   45

    2402        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2403        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2404        .dwattr $C$DW$155, DW_AT_decl_line(0x30)
    2405        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2406$C$DW$156       .dwtag  DW_TAG_member
    2407        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2408        .dwattr $C$DW$156, DW_AT_name("REV_MODULE")
    2409        .dwattr $C$DW$156, DW_AT_TI_symbol_name("REV_MODULE")
    2410        .dwattr $C$DW$156, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2411        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2413        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2414        .dwattr $C$DW$156, DW_AT_decl_line(0x31)
    2415        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2416$C$DW$157       .dwtag  DW_TAG_member
    2417        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2418        .dwattr $C$DW$157, DW_AT_name("rsvd28")
    2419        .dwattr $C$DW$157, DW_AT_TI_symbol_name("rsvd28")
    2420        .dwattr $C$DW$157, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2421        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2422        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2423        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2424        .dwattr $C$DW$157, DW_AT_decl_line(0x32)
    2425        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2426$C$DW$158       .dwtag  DW_TAG_member
    2427        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2428        .dwattr $C$DW$158, DW_AT_name("REV_SCHEME")
    2429        .dwattr $C$DW$158, DW_AT_TI_symbol_name("REV_SCHEME")
    2430        .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2431        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2433        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2434        .dwattr $C$DW$158, DW_AT_decl_line(0x33)
    2435        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2436        .dwendtag $C$DW$T$36
    2437
    2438        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2439        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2440        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2441$C$DW$T$157     .dwtag  DW_TAG_volatile_type
    2442        .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$36)
    2443
    2444$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2445        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2446$C$DW$159       .dwtag  DW_TAG_member
    2447        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2448        .dwattr $C$DW$159, DW_AT_name("rsvd0")
    2449        .dwattr $C$DW$159, DW_AT_TI_symbol_name("rsvd0")
    2450        .dwattr $C$DW$159, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2451        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2453        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2454        .dwattr $C$DW$159, DW_AT_decl_line(0x3d)
    2455        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2456$C$DW$160       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   46

    2457        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2458        .dwattr $C$DW$160, DW_AT_name("NEST_MODE")
    2459        .dwattr $C$DW$160, DW_AT_TI_symbol_name("NEST_MODE")
    2460        .dwattr $C$DW$160, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2461        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2463        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2464        .dwattr $C$DW$160, DW_AT_decl_line(0x3e)
    2465        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2466$C$DW$161       .dwtag  DW_TAG_member
    2467        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2468        .dwattr $C$DW$161, DW_AT_name("rsvd4")
    2469        .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd4")
    2470        .dwattr $C$DW$161, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2471        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2473        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2474        .dwattr $C$DW$161, DW_AT_decl_line(0x3f)
    2475        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2476        .dwendtag $C$DW$T$37
    2477
    2478        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2479        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2480        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2481$C$DW$T$159     .dwtag  DW_TAG_volatile_type
    2482        .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$37)
    2483
    2484$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2485        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2486$C$DW$162       .dwtag  DW_TAG_member
    2487        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2488        .dwattr $C$DW$162, DW_AT_name("EN_HINT_ANY")
    2489        .dwattr $C$DW$162, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2490        .dwattr $C$DW$162, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2491        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2493        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2494        .dwattr $C$DW$162, DW_AT_decl_line(0x4c)
    2495        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2496$C$DW$163       .dwtag  DW_TAG_member
    2497        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2498        .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2499        .dwattr $C$DW$163, DW_AT_TI_symbol_name("rsvd1")
    2500        .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2501        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2503        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2504        .dwattr $C$DW$163, DW_AT_decl_line(0x4d)
    2505        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2506        .dwendtag $C$DW$T$38
    2507
    2508        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2509        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2510        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2511$C$DW$T$161     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   47

    2512        .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$38)
    2513
    2514$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2515        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2516$C$DW$164       .dwtag  DW_TAG_member
    2517        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2518        .dwattr $C$DW$164, DW_AT_name("GLB_NEST_LEVEL")
    2519        .dwattr $C$DW$164, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2520        .dwattr $C$DW$164, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2521        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2522        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2523        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2524        .dwattr $C$DW$164, DW_AT_decl_line(0x5a)
    2525        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2526$C$DW$165       .dwtag  DW_TAG_member
    2527        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2528        .dwattr $C$DW$165, DW_AT_name("rsvd9")
    2529        .dwattr $C$DW$165, DW_AT_TI_symbol_name("rsvd9")
    2530        .dwattr $C$DW$165, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2531        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2533        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2534        .dwattr $C$DW$165, DW_AT_decl_line(0x5b)
    2535        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2536$C$DW$166       .dwtag  DW_TAG_member
    2537        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2538        .dwattr $C$DW$166, DW_AT_name("AUTO_OVERRIDE")
    2539        .dwattr $C$DW$166, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2540        .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2541        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2543        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2544        .dwattr $C$DW$166, DW_AT_decl_line(0x5c)
    2545        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2546        .dwendtag $C$DW$T$39
    2547
    2548        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2549        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2550        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2551$C$DW$T$163     .dwtag  DW_TAG_volatile_type
    2552        .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$39)
    2553
    2554$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2555        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2556$C$DW$167       .dwtag  DW_TAG_member
    2557        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2558        .dwattr $C$DW$167, DW_AT_name("STS_SET_IDX")
    2559        .dwattr $C$DW$167, DW_AT_TI_symbol_name("STS_SET_IDX")
    2560        .dwattr $C$DW$167, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2561        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2563        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2564        .dwattr $C$DW$167, DW_AT_decl_line(0x66)
    2565        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2566$C$DW$168       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sat Apr 14 23:23:22 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main1.asm                                                            PAGE   48

    2567        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2568        .dwattr $C$DW$168, DW_AT_name("rsvd10")
    2569        .dwattr $C$DW$168, DW_AT_TI_symbol_name("rsvd10")
    2570        .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2571        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2573        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2574        .dwattr $C$DW$168, DW_AT_decl_line(0x67)
    2575        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2576        .dwendtag $C$DW$T$40
    2577
    2578        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2579        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    2580        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2581$C$DW$T$165     .dwtag  DW_TAG_volatile_type
    2582        .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$40)
    2583
    2584$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2585        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2586$C$DW$169       .dwtag  DW_TAG_member
    2587        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2588        .dwattr $C$DW$169, DW_AT_name("STS_CLR_IDX")
    2589        .dwattr $C$DW$169, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2590        .dwattr $C$DW$169, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2591        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2592        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2593        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2594        .dwattr $C$DW$169, DW_AT_decl_line(0x71)
    2595        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2596$C$DW$170       .dwtag  DW_TAG_member
    2597        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2598        .dwattr $C$DW$170, DW_AT_name("rsvd10")
    2599        .dwattr $C$DW$170, DW_AT_TI_symbol_name("rsvd10")
    2600        .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2601        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2602        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2603        .dwattr $C$DW$170, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2604        .dwattr $C$DW$170, DW_AT_decl_line(0x72)
    2605        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2606        .dwendtag $C$DW$T$41
    2607
    2608        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2609        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2610        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2611$C$DW$T$167     .dwtag  DW_TAG_volatile_type
    2612        .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$41)
    2613
